#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1393;                                                        // 0x0004 (size: 0x8)
    float __FloatProperty_1394;                                                       // 0x000C (size: 0x4)
    FName __NameProperty_1395;                                                        // 0x0010 (size: 0x8)
    FName __NameProperty_1396;                                                        // 0x0018 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1397;                            // 0x0020 (size: 0x1)
    FName __NameProperty_1398;                                                        // 0x0024 (size: 0x8)
    TArray<float> __ArrayProperty_1399;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_1400;                                               // 0x0040 (size: 0x10)
    TArray<float> __ArrayProperty_1401;                                               // 0x0050 (size: 0x10)
    TArray<int32> __ArrayProperty_1402;                                               // 0x0060 (size: 0x10)
    FName __NameProperty_1403;                                                        // 0x0070 (size: 0x8)
    TArray<float> __ArrayProperty_1404;                                               // 0x0078 (size: 0x10)
    TArray<int32> __ArrayProperty_1405;                                               // 0x0088 (size: 0x10)
    float __FloatProperty_1406;                                                       // 0x0098 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1407;                            // 0x009C (size: 0x1)
    FName __NameProperty_1408;                                                        // 0x00A0 (size: 0x8)
    float __FloatProperty_1409;                                                       // 0x00A8 (size: 0x4)
    class UBlendProfile* __BlendProfile_1410;                                         // 0x00B0 (size: 0x8)
    class UCurveFloat* __CurveFloat_1411;                                             // 0x00B8 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1412;                                            // 0x00C0 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1413;                                     // 0x00C1 (size: 0x1)
    TArray<float> __ArrayProperty_1414;                                               // 0x00C8 (size: 0x10)
    TArray<int32> __ArrayProperty_1415;                                               // 0x00D8 (size: 0x10)
    float __FloatProperty_1416;                                                       // 0x00E8 (size: 0x4)
    FName __NameProperty_1417;                                                        // 0x00EC (size: 0x8)
    EAnimSyncMethod __EnumProperty_1418;                                              // 0x00F4 (size: 0x1)
    FName __NameProperty_1419;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_1420;                                                        // 0x0100 (size: 0x8)
    FName __NameProperty_1421;                                                        // 0x0108 (size: 0x8)
    FName __NameProperty_1422;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_1423;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_1424;                                                        // 0x0120 (size: 0x8)
    int32 __IntProperty_1425;                                                         // 0x0128 (size: 0x4)
    FName __NameProperty_1426;                                                        // 0x012C (size: 0x8)
    int32 __IntProperty_1427;                                                         // 0x0134 (size: 0x4)
    FName __NameProperty_1428;                                                        // 0x0138 (size: 0x8)
    FName __NameProperty_1429;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_1430;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_1431;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_1432;                                                        // 0x0158 (size: 0x8)
    int32 __IntProperty_1433;                                                         // 0x0160 (size: 0x4)
    FName __NameProperty_1434;                                                        // 0x0164 (size: 0x8)
    int32 __IntProperty_1435;                                                         // 0x016C (size: 0x4)
    FName __NameProperty_1436;                                                        // 0x0170 (size: 0x8)
    int32 __IntProperty_1437;                                                         // 0x0178 (size: 0x4)
    FName __NameProperty_1438;                                                        // 0x017C (size: 0x8)
    int32 __IntProperty_1439;                                                         // 0x0184 (size: 0x4)
    bool __BoolProperty_1440;                                                         // 0x0188 (size: 0x1)
    float __FloatProperty_1441;                                                       // 0x018C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1442;                              // 0x0190 (size: 0x2C)
    float __FloatProperty_1443;                                                       // 0x01BC (size: 0x4)
    bool __BoolProperty_1444;                                                         // 0x01C0 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1445;                                              // 0x01C1 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1446;                            // 0x01C2 (size: 0x1)
    FName __NameProperty_1447;                                                        // 0x01C4 (size: 0x8)
    FName __NameProperty_1448;                                                        // 0x01CC (size: 0x8)
    int32 __IntProperty_1449;                                                         // 0x01D4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1450;                                       // 0x01D8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01F8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0278 (size: 0x18)

}; // Size: 0x290

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x001C (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x001D (size: 0x1)
    float __FloatProperty_7;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0028 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x002C (size: 0x4)
    uint8 __ByteProperty_11;                                                          // 0x0030 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0048 (size: 0x4)

}; // Size: 0x4C

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x4C)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03E8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03F0 (size: 0x8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x03F8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x0440 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0520 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0628 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x06F0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x0738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x0760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x0788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x07B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x07D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x0800 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x0828 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x0870 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x0890 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x08D8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x08F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x0920 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x0968 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x0988 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x09F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x0A18 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x0AE0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0BC0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0BE8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0CF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x0D18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x0D40 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x0D68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x0DB0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0DF8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x0E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x0E68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x0E90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x0ED8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x0EF8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x0F68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x0F88 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x1050 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x1098 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x10E0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x1128 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x1150 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x1178 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x11C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x11E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x1228 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x1248 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1310 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1358 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x1438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x1460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x1488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x14B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x14D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x1500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x1528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x1550 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x1578 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x15C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x15E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x1628 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x1648 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x1690 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x16B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x16F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x1718 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x17E0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1828 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x1870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x1898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x18C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x18E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x1910 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x1938 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x1960 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x19A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x19C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x1A10 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x1A30 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x1A58 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x1A78 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x1B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x1B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x1B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x1BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x1BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1C08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x1C30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x1C78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x1C98 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1CE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x1D28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x1D70 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x1D90 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x1E00 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x1E20 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1EE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x1F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x1F38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x1F60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1FB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x1FD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x2020 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x2040 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x2088 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x20A8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x2118 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x2138 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x2200 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x22E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x2308 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x2330 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x2378 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x2398 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x23E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x2400 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x24C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x24F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x2518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x2540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x2568 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x2590 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x25D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x25F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x2640 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x2660 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x26A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x26C8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x2790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x27B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x27E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x2828 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x2848 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x28B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x28D8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x29A0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x29E8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2AF0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2B18 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2BF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x2C20 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2C68 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2C90 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2D98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2DC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x2DE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x2E10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x2E38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x2E60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x2E88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x2EB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x2ED8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x2F20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x2F40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x2F88 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x2FA8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x3018 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x3038 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3100 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x3128 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x3170 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x31E0 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x3250 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x3298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x32C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x32E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x3330 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x3350 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x33C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x33E0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x34A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x34D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x34F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x3520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x3548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x3570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x3598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x35C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x35E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x3610 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x3638 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x3658 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x36A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x36C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x3708 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x3728 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x3770 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x3790 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x37D8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x37F8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x3820 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x3840 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3908 (size: 0xD0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x39D8 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x39F8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x3AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x3B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x3B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x3B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x3B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x3BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x3BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x3BF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x3C18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x3C60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x3C80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x3CC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x3CE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x3D30 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x3D50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3D98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x3DB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x3E00 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x3E20 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3EE8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3F10 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3FF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x4018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x4040 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x4068 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x4090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x40B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x40E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x4108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x4130 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x4158 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x4180 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x41C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x41E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x4230 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x4250 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x4298 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x42B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x4300 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x4320 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x4368 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x4388 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4450 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4558 (size: 0x28)
    double UpperBodySpeedReference;                                                   // 0x4580 (size: 0x8)
    double deltaT;                                                                    // 0x4588 (size: 0x8)
    double PulseSumTime;                                                              // 0x4590 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_BlendSpacePlayer_A93DB38D49738EF832DCF492B403C3DF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_924A231840EFD8BFAEE6FF97D5A9DF8F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_A207C5FD40B4BD992FDDAB8681219062();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_98973D2647D559DC03C63CA996985C30();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TwoWayBlend_354DD17E4A0C899E8EF85C97E420B17E();
