#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    class UAnimSequenceBase* __AnimSequenceBase_3666;                                 // 0x0008 (size: 0x8)
    TArray<float> __ArrayProperty_3667;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_3668;                                               // 0x0020 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_3669;                                 // 0x0030 (size: 0x8)
    FInputScaleBiasClampConstants __StructProperty_3670;                              // 0x0038 (size: 0x2C)
    class UAnimSequenceBase* __AnimSequenceBase_3671;                                 // 0x0068 (size: 0x8)
    TArray<float> __ArrayProperty_3672;                                               // 0x0070 (size: 0x10)
    TArray<int32> __ArrayProperty_3673;                                               // 0x0080 (size: 0x10)
    FName __NameProperty_3674;                                                        // 0x0090 (size: 0x8)
    float __FloatProperty_3675;                                                       // 0x0098 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3676;                                 // 0x00A0 (size: 0x8)
    float __FloatProperty_3677;                                                       // 0x00A8 (size: 0x4)
    TArray<int32> __ArrayProperty_3678;                                               // 0x00B0 (size: 0x10)
    FName __NameProperty_3679;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_3680;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_3681;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_3682;                                                        // 0x00D8 (size: 0x8)
    FName __NameProperty_3683;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_3684;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_3685;                                                        // 0x00F0 (size: 0x8)
    TArray<float> __ArrayProperty_3686;                                               // 0x00F8 (size: 0x10)
    FName __NameProperty_3687;                                                        // 0x0108 (size: 0x8)
    FName __NameProperty_3688;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_3689;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_3690;                                                        // 0x0120 (size: 0x8)
    FName __NameProperty_3691;                                                        // 0x0128 (size: 0x8)
    FName __NameProperty_3692;                                                        // 0x0130 (size: 0x8)
    float __FloatProperty_3693;                                                       // 0x0138 (size: 0x4)
    FName __NameProperty_3694;                                                        // 0x013C (size: 0x8)
    FName __NameProperty_3695;                                                        // 0x0144 (size: 0x8)
    FName __NameProperty_3696;                                                        // 0x014C (size: 0x8)
    int32 __IntProperty_3697;                                                         // 0x0154 (size: 0x4)
    FName __NameProperty_3698;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_3699;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_3700;                                                        // 0x0168 (size: 0x8)
    FName __NameProperty_3701;                                                        // 0x0170 (size: 0x8)
    FName __NameProperty_3702;                                                        // 0x0178 (size: 0x8)
    FName __NameProperty_3703;                                                        // 0x0180 (size: 0x8)
    FName __NameProperty_3704;                                                        // 0x0188 (size: 0x8)
    FName __NameProperty_3705;                                                        // 0x0190 (size: 0x8)
    FName __NameProperty_3706;                                                        // 0x0198 (size: 0x8)
    FName __NameProperty_3707;                                                        // 0x01A0 (size: 0x8)
    FName __NameProperty_3708;                                                        // 0x01A8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3709;                                 // 0x01B0 (size: 0x8)
    class UMirrorDataTable* __MirrorDataTable_3710;                                   // 0x01B8 (size: 0x8)
    FName __NameProperty_3711;                                                        // 0x01C0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3712;                                 // 0x01C8 (size: 0x8)
    FName __NameProperty_3713;                                                        // 0x01D0 (size: 0x8)
    int32 __IntProperty_3714;                                                         // 0x01D8 (size: 0x4)
    int32 __IntProperty_3715;                                                         // 0x01DC (size: 0x4)
    FName __NameProperty_3716;                                                        // 0x01E0 (size: 0x8)
    float __FloatProperty_3717;                                                       // 0x01E8 (size: 0x4)
    FName __NameProperty_3718;                                                        // 0x01EC (size: 0x8)
    FName __NameProperty_3719;                                                        // 0x01F4 (size: 0x8)
    TArray<int32> __ArrayProperty_3720;                                               // 0x0200 (size: 0x10)
    TArray<float> __ArrayProperty_3721;                                               // 0x0210 (size: 0x10)
    TArray<int32> __ArrayProperty_3722;                                               // 0x0220 (size: 0x10)
    TArray<int32> __ArrayProperty_3723;                                               // 0x0230 (size: 0x10)
    FName __NameProperty_3724;                                                        // 0x0240 (size: 0x8)
    FName __NameProperty_3725;                                                        // 0x0248 (size: 0x8)
    FName __NameProperty_3726;                                                        // 0x0250 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3727;                                 // 0x0258 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3728;                                 // 0x0260 (size: 0x8)
    float __FloatProperty_3729;                                                       // 0x0268 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3730;                                 // 0x0270 (size: 0x8)
    FName __NameProperty_3731;                                                        // 0x0278 (size: 0x8)
    TArray<float> __ArrayProperty_3732;                                               // 0x0280 (size: 0x10)
    TArray<float> __ArrayProperty_3733;                                               // 0x0290 (size: 0x10)
    FName __NameProperty_3734;                                                        // 0x02A0 (size: 0x8)
    float __FloatProperty_3735;                                                       // 0x02A8 (size: 0x4)
    FName __NameProperty_3736;                                                        // 0x02AC (size: 0x8)
    float __FloatProperty_3737;                                                       // 0x02B4 (size: 0x4)
    TArray<float> __ArrayProperty_3738;                                               // 0x02B8 (size: 0x10)
    TArray<float> __ArrayProperty_3739;                                               // 0x02C8 (size: 0x10)
    FName __NameProperty_3740;                                                        // 0x02D8 (size: 0x8)
    FName __NameProperty_3741;                                                        // 0x02E0 (size: 0x8)
    FName __NameProperty_3742;                                                        // 0x02E8 (size: 0x8)
    FName __NameProperty_3743;                                                        // 0x02F0 (size: 0x8)
    FName __NameProperty_3744;                                                        // 0x02F8 (size: 0x8)
    FName __NameProperty_3745;                                                        // 0x0300 (size: 0x8)
    FName __NameProperty_3746;                                                        // 0x0308 (size: 0x8)
    FName __NameProperty_3747;                                                        // 0x0310 (size: 0x8)
    float __FloatProperty_3748;                                                       // 0x0318 (size: 0x4)
    FName __NameProperty_3749;                                                        // 0x031C (size: 0x8)
    float __FloatProperty_3750;                                                       // 0x0324 (size: 0x4)
    EAnimSyncMethod __EnumProperty_3751;                                              // 0x0328 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_3752;                            // 0x0329 (size: 0x1)
    FName __NameProperty_3753;                                                        // 0x032C (size: 0x8)
    FName __NameProperty_3754;                                                        // 0x0334 (size: 0x8)
    FName __NameProperty_3755;                                                        // 0x033C (size: 0x8)
    FName __NameProperty_3756;                                                        // 0x0344 (size: 0x8)
    class UBlendProfile* __BlendProfile_3757;                                         // 0x0350 (size: 0x8)
    class UCurveFloat* __CurveFloat_3758;                                             // 0x0358 (size: 0x8)
    EAlphaBlendOption __EnumProperty_3759;                                            // 0x0360 (size: 0x1)
    EBlendListTransitionType __EnumProperty_3760;                                     // 0x0361 (size: 0x1)
    TArray<float> __ArrayProperty_3761;                                               // 0x0368 (size: 0x10)
    FName __NameProperty_3762;                                                        // 0x0378 (size: 0x8)
    int32 __IntProperty_3763;                                                         // 0x0380 (size: 0x4)
    FName __NameProperty_3764;                                                        // 0x0384 (size: 0x8)
    int32 __IntProperty_3765;                                                         // 0x038C (size: 0x4)
    float __FloatProperty_3766;                                                       // 0x0390 (size: 0x4)
    float __FloatProperty_3767;                                                       // 0x0394 (size: 0x4)
    FName __NameProperty_3768;                                                        // 0x0398 (size: 0x8)
    int32 __IntProperty_3769;                                                         // 0x03A0 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_3770;                              // 0x03A4 (size: 0x2C)
    float __FloatProperty_3771;                                                       // 0x03D0 (size: 0x4)
    FName __NameProperty_3772;                                                        // 0x03D4 (size: 0x8)
    int32 __IntProperty_3773;                                                         // 0x03DC (size: 0x4)
    float __FloatProperty_3774;                                                       // 0x03E0 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_3775;                       // 0x03E4 (size: 0x1)
    bool __BoolProperty_3776;                                                         // 0x03E5 (size: 0x1)
    float __FloatProperty_3777;                                                       // 0x03E8 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3778;                                 // 0x03F0 (size: 0x8)
    bool __BoolProperty_3779;                                                         // 0x03F8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_3780;                                              // 0x03F9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_3781;                            // 0x03FA (size: 0x1)
    FName __NameProperty_3782;                                                        // 0x03FC (size: 0x8)
    FName __NameProperty_3783;                                                        // 0x0404 (size: 0x8)
    int32 __IntProperty_3784;                                                         // 0x040C (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_3785;                                       // 0x0410 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0430 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x04B0 (size: 0x18)

}; // Size: 0x4C8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0004 (size: 0x1)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_5;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0014 (size: 0x4)
    uint8 __ByteProperty_7;                                                           // 0x0018 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0019 (size: 0x1)
    uint8 __ByteProperty_9;                                                           // 0x001A (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x001B (size: 0x1)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0020 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    uint8 __ByteProperty_14;                                                          // 0x0028 (size: 0x1)
    float __FloatProperty_15;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    bool __BoolProperty_17;                                                           // 0x0034 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x004C (size: 0x4)
    bool __BoolProperty_24;                                                           // 0x0050 (size: 0x1)
    float __FloatProperty_25;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0074 (size: 0x4)
    bool __BoolProperty_34;                                                           // 0x0078 (size: 0x1)
    float __FloatProperty_35;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_36;                                                         // 0x0080 (size: 0x4)
    float __FloatProperty_37;                                                         // 0x0084 (size: 0x4)
    float __FloatProperty_38;                                                         // 0x0088 (size: 0x4)
    float __FloatProperty_39;                                                         // 0x008C (size: 0x4)
    float __FloatProperty_40;                                                         // 0x0090 (size: 0x4)
    float __FloatProperty_41;                                                         // 0x0094 (size: 0x4)
    float __FloatProperty_42;                                                         // 0x0098 (size: 0x4)
    float __FloatProperty_43;                                                         // 0x009C (size: 0x4)
    float __FloatProperty_44;                                                         // 0x00A0 (size: 0x4)
    bool __BoolProperty_45;                                                           // 0x00A4 (size: 0x1)
    float __FloatProperty_46;                                                         // 0x00A8 (size: 0x4)
    bool __BoolProperty_47;                                                           // 0x00AC (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x00AD (size: 0x1)
    uint8 __ByteProperty_49;                                                          // 0x00AE (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x00AF (size: 0x1)
    float __FloatProperty_51;                                                         // 0x00B0 (size: 0x4)
    uint8 __ByteProperty_52;                                                          // 0x00B4 (size: 0x1)
    uint8 __ByteProperty_53;                                                          // 0x00B5 (size: 0x1)
    bool __BoolProperty_54;                                                           // 0x00B6 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x00B7 (size: 0x1)
    bool __BoolProperty_56;                                                           // 0x00B8 (size: 0x1)
    float __FloatProperty_57;                                                         // 0x00BC (size: 0x4)
    float __FloatProperty_58;                                                         // 0x00C0 (size: 0x4)
    bool __BoolProperty_59;                                                           // 0x00C4 (size: 0x1)
    bool __BoolProperty_60;                                                           // 0x00C5 (size: 0x1)
    bool __BoolProperty_61;                                                           // 0x00C6 (size: 0x1)
    bool __BoolProperty_62;                                                           // 0x00C7 (size: 0x1)
    bool __BoolProperty_63;                                                           // 0x00C8 (size: 0x1)
    bool __BoolProperty_64;                                                           // 0x00C9 (size: 0x1)
    bool __BoolProperty_65;                                                           // 0x00CA (size: 0x1)
    bool __BoolProperty_66;                                                           // 0x00CB (size: 0x1)
    float __FloatProperty_67;                                                         // 0x00CC (size: 0x4)
    bool __BoolProperty_68;                                                           // 0x00D0 (size: 0x1)
    bool __BoolProperty_69;                                                           // 0x00D1 (size: 0x1)
    bool __BoolProperty_70;                                                           // 0x00D2 (size: 0x1)
    bool __BoolProperty_71;                                                           // 0x00D3 (size: 0x1)
    bool __BoolProperty_72;                                                           // 0x00D4 (size: 0x1)
    float __FloatProperty_73;                                                         // 0x00D8 (size: 0x4)
    float __FloatProperty_74;                                                         // 0x00DC (size: 0x4)
    bool __BoolProperty_75;                                                           // 0x00E0 (size: 0x1)
    float __FloatProperty_76;                                                         // 0x00E4 (size: 0x4)
    bool __BoolProperty_77;                                                           // 0x00E8 (size: 0x1)
    bool __BoolProperty_78;                                                           // 0x00E9 (size: 0x1)
    float __FloatProperty_79;                                                         // 0x00EC (size: 0x4)
    float __FloatProperty_80;                                                         // 0x00F0 (size: 0x4)
    float __FloatProperty_81;                                                         // 0x00F4 (size: 0x4)
    float __FloatProperty_82;                                                         // 0x00F8 (size: 0x4)
    bool __BoolProperty_83;                                                           // 0x00FC (size: 0x1)
    float __FloatProperty_84;                                                         // 0x0100 (size: 0x4)
    float __FloatProperty_85;                                                         // 0x0104 (size: 0x4)
    bool __BoolProperty_86;                                                           // 0x0108 (size: 0x1)

}; // Size: 0x109

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03D0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03D8 (size: 0x10C)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x04E8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x04F0 (size: 0x8)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x04F8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x0540 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0620 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0728 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x07F0 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11;                   // 0x0838 (size: 0x40)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x0878 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x0958 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0980 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0A88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0AB0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0AD8 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0B00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124;                        // 0x0B48 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0B90 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_166;                    // 0x0BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_165;                    // 0x0C00 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123;                        // 0x0C28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32;                       // 0x0C70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122;                        // 0x0CB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_117;                              // 0x0D00 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10;                   // 0x0D20 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31;                       // 0x0D60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121;                        // 0x0DA8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30;                       // 0x0DF0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16;                     // 0x0E38 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_116;                              // 0x0EA8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_34;                             // 0x0EC8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120;                        // 0x0F90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119;                        // 0x0FD8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118;                        // 0x1020 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_164;                    // 0x1068 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_163;                    // 0x1090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_162;                    // 0x10B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_161;                    // 0x10E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_160;                    // 0x1108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_159;                    // 0x1130 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_158;                    // 0x1158 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_157;                    // 0x1180 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x11A8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_115;                              // 0x11E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117;                        // 0x1208 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_114;                              // 0x1250 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116;                        // 0x1270 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_113;                              // 0x12B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115;                        // 0x12D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_112;                              // 0x1320 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114;                        // 0x1340 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_111;                              // 0x1388 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_33;                             // 0x13A8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x1470 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x14B8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_156;                    // 0x1598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_155;                    // 0x15C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_154;                    // 0x15E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_153;                    // 0x1610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_152;                    // 0x1638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_151;                    // 0x1660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_150;                    // 0x1688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_149;                    // 0x16B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113;                        // 0x16D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_110;                              // 0x1720 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112;                        // 0x1740 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_109;                              // 0x1788 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111;                        // 0x17A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_108;                              // 0x17F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110;                        // 0x1810 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_107;                              // 0x1858 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_32;                             // 0x1878 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1940 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_148;                    // 0x1988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_147;                    // 0x19B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109;                        // 0x19D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_106;                              // 0x1A20 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x1A40 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29;                       // 0x1A80 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x1AC8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_105;                              // 0x1AF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_31;                             // 0x1B10 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_146;                    // 0x1BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_145;                    // 0x1C00 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108;                        // 0x1C28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107;                        // 0x1C70 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1CB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_104;                              // 0x1D00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106;                        // 0x1D20 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x1D68 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x1DB0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_103;                              // 0x1E20 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_30;                             // 0x1E40 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_144;                    // 0x1F08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_143;                    // 0x1F30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105;                        // 0x1F58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_102;                              // 0x1FA0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x1FC0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_101;                              // 0x2030 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_29;                             // 0x2050 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x2118 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_142;                    // 0x21F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_141;                    // 0x2220 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104;                        // 0x2248 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_100;                              // 0x2290 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x22B0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_99;                               // 0x2320 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_28;                             // 0x2340 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x2408 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2450 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2558 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103;                        // 0x2580 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x25C8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x25F0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x26F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_140;                    // 0x2748 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_139;                    // 0x2770 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102;                        // 0x2798 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_98;                               // 0x27E0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x2800 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x2870 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x28B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_97;                               // 0x2928 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_27;                             // 0x2948 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_138;                    // 0x2A10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_137;                    // 0x2A38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_136;                    // 0x2A60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_135;                    // 0x2A88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_134;                    // 0x2AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_133;                    // 0x2AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_132;                    // 0x2B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_131;                    // 0x2B28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101;                        // 0x2B50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_96;                               // 0x2B98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100;                        // 0x2BB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_95;                               // 0x2C00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99;                         // 0x2C20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_94;                               // 0x2C68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98;                         // 0x2C88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_93;                               // 0x2CD0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x2CF0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_92;                               // 0x2D30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_26;                             // 0x2D50 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97;                         // 0x2E18 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2E60 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2ED0 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96;                         // 0x2F40 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_130;                    // 0x2F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129;                    // 0x2FB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95;                         // 0x2FD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_91;                               // 0x3020 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x3040 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_90;                               // 0x30B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_25;                             // 0x30D0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_128;                    // 0x3198 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127;                    // 0x31C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126;                    // 0x31E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125;                    // 0x3210 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124;                    // 0x3238 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123;                    // 0x3260 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122;                    // 0x3288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121;                    // 0x32B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120;                    // 0x32D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119;                    // 0x3300 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_89;                               // 0x3328 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94;                         // 0x3348 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_88;                               // 0x3390 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93;                         // 0x33B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_87;                               // 0x33F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92;                         // 0x3418 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_86;                               // 0x3460 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91;                         // 0x3480 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_85;                               // 0x34C8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118;                    // 0x34E8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_84;                               // 0x3510 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x3530 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x35F8 (size: 0xD0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x36C8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117;                    // 0x37A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116;                    // 0x37D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115;                    // 0x37F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114;                    // 0x3820 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113;                    // 0x3848 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112;                    // 0x3870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111;                    // 0x3898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110;                    // 0x38C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90;                         // 0x38E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_83;                               // 0x3930 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89;                         // 0x3950 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_82;                               // 0x3998 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88;                         // 0x39B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_81;                               // 0x3A00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87;                         // 0x3A20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_80;                               // 0x3A68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86;                         // 0x3A88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_79;                               // 0x3AD0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x3AF0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x3BB8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3BE0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3CC0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x3CE8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109;                    // 0x3D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108;                    // 0x3D58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107;                    // 0x3D80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106;                    // 0x3DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105;                    // 0x3DD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104;                    // 0x3DF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103;                    // 0x3E20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102;                    // 0x3E48 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85;                         // 0x3E70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_78;                               // 0x3EB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x3ED8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_77;                               // 0x3F20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x3F40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_76;                               // 0x3F88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x3FA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_75;                               // 0x3FF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x4010 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_74;                               // 0x4058 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x4078 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4140 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x4248 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x4270 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x4298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101;                    // 0x42C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100;                    // 0x42E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99;                     // 0x4310 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98;                     // 0x4338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97;                     // 0x4360 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x4388 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_73;                               // 0x43D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x43F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_72;                               // 0x4438 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x4458 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_71;                               // 0x44A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x44C0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96;                     // 0x4588 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95;                     // 0x45B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94;                     // 0x45D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0x4600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x4628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x4650 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x4678 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_70;                               // 0x46C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x46E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_69;                               // 0x4728 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x4748 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x4770 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x47B8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x47D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x4800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x4828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x4850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x4878 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x48A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x48C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x48F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x4918 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x4940 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x4968 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x49D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x49F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x4A40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x4A60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x4AA8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x4AC8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x4B38 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x4B58 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x4BC8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x4BE8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x4C58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x4C78 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x4CC0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x4D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x4D50 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4D70 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x4DE0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x4E00 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x4EC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x4EE8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x4FB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x4FD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x5000 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x5028 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x5050 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x5078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x50A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x50C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x50F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x5118 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x5140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x5168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x5190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x51B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x51E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x5208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x5230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x5258 (size: 0x28)
    FAnimNode_Mirror AnimGraphNode_Mirror_2;                                          // 0x5280 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x52C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x5310 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x5330 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x5378 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x5398 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x53E0 (size: 0x20)
    FAnimNode_Mirror AnimGraphNode_Mirror_1;                                          // 0x5400 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x5448 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x5490 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x54B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x54F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x5518 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x5560 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x5580 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x55C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x55E0 (size: 0xC8)
    FAnimNode_Mirror AnimGraphNode_Mirror;                                            // 0x56A8 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x56F0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x5710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x5738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x5760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x5788 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x57B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x57F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x5818 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x5860 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x5880 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x58C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x58E0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x59A8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x59F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x5A18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x5A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x5A68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x5A90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x5AB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x5AE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x5B08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x5B30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x5B58 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x5B80 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x5BC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x5BE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x5C28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x5C48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x5C90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x5CB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x5CF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x5D18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x5D60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x5D80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x5DC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x5DE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x5E30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x5E50 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x5F18 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x5F60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x5F88 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x5FB0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x5FF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x6040 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x6088 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x60D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x6118 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x6138 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x6180 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x61C8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x6238 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x6258 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x6320 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x6368 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x63B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x63F8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x6440 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x6488 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x64D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x6518 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x6560 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x65A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x65F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x6638 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x6680 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x66A0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x6768 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x6848 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x6870 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x68B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x68E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x6908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x6930 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x6958 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x69A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x69C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x6A08 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x6A28 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x6A68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x6A88 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x6B50 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x6B78 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x6BC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x6BE8 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x6C10 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x6C50 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x6C98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x6CE0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x6D00 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x6D40 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x6D88 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x6DD0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x6E18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x6E60 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x6E80 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x6F48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x6F70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x6F98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x6FE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x7000 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x7048 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x7090 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x70D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x70F8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x71C0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x7208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x7230 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x7258 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x72A0 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x72C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x7308 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x7350 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x7398 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x73E0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x7450 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x7470 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x7538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x7560 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x7588 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x75D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x75F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x7638 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x7680 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x76C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x76E8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x77B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x77F8 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x78D8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x7920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x7948 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x7970 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x79B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x79D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x7A20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x7A68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x7AB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x7AD0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x7B98 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x7BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x7C08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x7C30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x7C78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x7C98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x7CE0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x7D28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x7D70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x7D90 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x7E58 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x7F38 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x7F60 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x7FD0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x8018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x8040 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x8068 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x80B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x80D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x8118 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x8138 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x8200 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x8248 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x8290 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x82D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x8300 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x8348 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x8368 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x83B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x83D0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x8498 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x84E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x8508 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x8530 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x8558 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x8580 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x85A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x85D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x8618 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x8638 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x8680 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x86A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x86E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x8708 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x8750 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x8770 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x8838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x8860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x8888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x88B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x88D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x8920 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x8940 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x8988 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x89A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x89F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x8A10 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x8AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x8B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x8B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x8B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x8B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x8BA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x8BC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x8C10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x8C30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x8C78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x8C98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x8CE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x8D00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x8D48 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x8D68 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x8E30 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x8E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x8EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x8EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x8EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x8F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x8F40 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x8F68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x8FB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x8FD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x9018 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x9038 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x9080 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x90A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x90E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x9108 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x91D0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x9218 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x9240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x9268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x9290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x92B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x92E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x9308 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x9350 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x9370 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x93B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x93D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x9420 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x9440 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x9488 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x94A8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x94E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x9508 (size: 0xC8)
    double PulseSumTime;                                                              // 0x95D0 (size: 0x8)
    double staticYaw;                                                                 // 0x95D8 (size: 0x8)
    double deltaYaw;                                                                  // 0x95E0 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x95E8 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x95E9 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x95F0 (size: 0x18)
    double HelmsmanInput;                                                             // 0x9608 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_433248044F1B6C1BD8AAC5B89FF32CD3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_BCDDDCE4445F65FDED2DEAB2E861558E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_0BECB29F428E4481A01449BECCED4F0C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_D5D0C9C8414736B574D740AB03A95A5A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_E8597FD147B6FE7B94E54C8C17268B18();
