#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TArray<float> __ArrayProperty_1581;                                               // 0x0008 (size: 0x10)
    TArray<int32> __ArrayProperty_1582;                                               // 0x0018 (size: 0x10)
    FName __NameProperty_1583;                                                        // 0x0028 (size: 0x8)
    TArray<float> __ArrayProperty_1584;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_1585;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_1586;                                                        // 0x0050 (size: 0x8)
    TArray<float> __ArrayProperty_1587;                                               // 0x0058 (size: 0x10)
    TArray<int32> __ArrayProperty_1588;                                               // 0x0068 (size: 0x10)
    TArray<float> __ArrayProperty_1589;                                               // 0x0078 (size: 0x10)
    float __FloatProperty_1590;                                                       // 0x0088 (size: 0x4)
    class UBlendProfile* __BlendProfile_1591;                                         // 0x0090 (size: 0x8)
    class UCurveFloat* __CurveFloat_1592;                                             // 0x0098 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1593;                                            // 0x00A0 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1594;                                     // 0x00A1 (size: 0x1)
    TArray<float> __ArrayProperty_1595;                                               // 0x00A8 (size: 0x10)
    TArray<int32> __ArrayProperty_1596;                                               // 0x00B8 (size: 0x10)
    float __FloatProperty_1597;                                                       // 0x00C8 (size: 0x4)
    FName __NameProperty_1598;                                                        // 0x00CC (size: 0x8)
    FName __NameProperty_1599;                                                        // 0x00D4 (size: 0x8)
    FName __NameProperty_1600;                                                        // 0x00DC (size: 0x8)
    FName __NameProperty_1601;                                                        // 0x00E4 (size: 0x8)
    FName __NameProperty_1602;                                                        // 0x00EC (size: 0x8)
    FName __NameProperty_1603;                                                        // 0x00F4 (size: 0x8)
    FName __NameProperty_1604;                                                        // 0x00FC (size: 0x8)
    FName __NameProperty_1605;                                                        // 0x0104 (size: 0x8)
    FName __NameProperty_1606;                                                        // 0x010C (size: 0x8)
    FName __NameProperty_1607;                                                        // 0x0114 (size: 0x8)
    FName __NameProperty_1608;                                                        // 0x011C (size: 0x8)
    FName __NameProperty_1609;                                                        // 0x0124 (size: 0x8)
    FName __NameProperty_1610;                                                        // 0x012C (size: 0x8)
    FName __NameProperty_1611;                                                        // 0x0134 (size: 0x8)
    FName __NameProperty_1612;                                                        // 0x013C (size: 0x8)
    float __FloatProperty_1613;                                                       // 0x0144 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1614;                            // 0x0148 (size: 0x1)
    FName __NameProperty_1615;                                                        // 0x014C (size: 0x8)
    FName __NameProperty_1616;                                                        // 0x0154 (size: 0x8)
    FName __NameProperty_1617;                                                        // 0x015C (size: 0x8)
    float __FloatProperty_1618;                                                       // 0x0164 (size: 0x4)
    FName __NameProperty_1619;                                                        // 0x0168 (size: 0x8)
    FName __NameProperty_1620;                                                        // 0x0170 (size: 0x8)
    FName __NameProperty_1621;                                                        // 0x0178 (size: 0x8)
    int32 __IntProperty_1622;                                                         // 0x0180 (size: 0x4)
    FName __NameProperty_1623;                                                        // 0x0184 (size: 0x8)
    int32 __IntProperty_1624;                                                         // 0x018C (size: 0x4)
    FName __NameProperty_1625;                                                        // 0x0190 (size: 0x8)
    int32 __IntProperty_1626;                                                         // 0x0198 (size: 0x4)
    FName __NameProperty_1627;                                                        // 0x019C (size: 0x8)
    int32 __IntProperty_1628;                                                         // 0x01A4 (size: 0x4)
    FName __NameProperty_1629;                                                        // 0x01A8 (size: 0x8)
    int32 __IntProperty_1630;                                                         // 0x01B0 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1631;                              // 0x01B4 (size: 0x2C)
    float __FloatProperty_1632;                                                       // 0x01E0 (size: 0x4)
    EAnimSyncMethod __EnumProperty_1633;                                              // 0x01E4 (size: 0x1)
    FName __NameProperty_1634;                                                        // 0x01E8 (size: 0x8)
    bool __BoolProperty_1635;                                                         // 0x01F0 (size: 0x1)
    float __FloatProperty_1636;                                                       // 0x01F4 (size: 0x4)
    bool __BoolProperty_1637;                                                         // 0x01F8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1638;                                              // 0x01F9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1639;                            // 0x01FA (size: 0x1)
    FName __NameProperty_1640;                                                        // 0x01FC (size: 0x8)
    FName __NameProperty_1641;                                                        // 0x0204 (size: 0x8)
    int32 __IntProperty_1642;                                                         // 0x020C (size: 0x4)
    FName __NameProperty_1643;                                                        // 0x0210 (size: 0x8)
    FName __NameProperty_1644;                                                        // 0x0218 (size: 0x8)
    int32 __IntProperty_1645;                                                         // 0x0220 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1646;                                       // 0x0228 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0248 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02C8 (size: 0x18)

}; // Size: 0x2E0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_3;                                                           // 0x0010 (size: 0x1)
    uint8 __ByteProperty_4;                                                           // 0x0011 (size: 0x1)
    float __FloatProperty_5;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    bool __BoolProperty_7;                                                            // 0x001C (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0020 (size: 0x4)
    uint8 __ByteProperty_9;                                                           // 0x0024 (size: 0x1)
    float __FloatProperty_10;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0064 (size: 0x4)

}; // Size: 0x68

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x68)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0400 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0408 (size: 0x8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0410 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x0458 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0538 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0640 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0708 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x0750 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0830 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0858 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0960 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x0988 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x09B0 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x09D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x0A20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x0A68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x0AB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x0AD0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0B98 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x0BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x0C08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x0C30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x0C78 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x0C98 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x0D08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x0D28 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x0DF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x0E38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x0E80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0EF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x0F18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x0F60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x0F80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x0FC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x0FE8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x10B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x10F8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x11D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x1200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x1228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x1250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x1278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x12A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x12C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x12F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x1318 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x1360 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x1380 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x13C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x13E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x1430 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x1450 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x1498 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x14B8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x1580 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x15C8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x1638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x1660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x16B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x16D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x1700 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x1748 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x1768 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x17B0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x17D0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x17F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x1818 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x18E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x1930 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x1958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x1980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x19A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x19D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x1A18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x1A38 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1A80 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x1AC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x1B10 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x1B30 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x1BA0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x1BC0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x1C88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x1CB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x1CD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x1D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x1D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x1D50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x1D78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x1DC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x1DE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x1E28 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x1E48 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x1EB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x1ED8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1FA0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x20A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x20D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x2118 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x2138 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x2180 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x21A0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2268 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x22B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x22D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x2300 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x2348 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2368 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x23D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x23F8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x24C0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2508 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2610 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2638 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2718 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x2740 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2788 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x27B0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x28B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x28E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2930 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x2980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x29A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x29D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x29F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x2A40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x2A60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x2AA8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2AC8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x2B38 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x2B58 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x2C20 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x2C68 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x2CD8 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x2D48 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x2D90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x2DB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x2DE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x2E28 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x2E48 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x2EB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x2ED8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x2FA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x2FC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x2FF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x3040 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x3068 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x30B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x30E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3108 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3130 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x3150 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3198 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x31B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x3200 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x3220 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x3268 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x3288 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x32D0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x32F0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x3318 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x3338 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3400 (size: 0xD0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x34D0 (size: 0x118)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x35E8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x36C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x36F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x37B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x37E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x3808 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x3850 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x3870 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x38B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x38D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x3920 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x3940 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x3988 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x39A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x39F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x3A10 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3AD8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3B00 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x3C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x3C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x3C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x3CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x3CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x3CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x3D20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x3D48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x3D90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x3DB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x3DF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x3E18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x3E60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x3E80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x3EC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x3EE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x3F30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x3F50 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4018 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x4120 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x4148 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x4170 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x41B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x41E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4258 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x4280 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x42C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x42E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x4330 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x4350 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x4398 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x43B8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x4480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x44A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x44D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x44F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4548 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x4570 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x45B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x45D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x4620 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4640 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x4668 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x46B0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x46D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x46F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x4720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x4748 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x4770 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x4798 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x47C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x47E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x4810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x4838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x4860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x4888 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x48B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x48F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x4918 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x4960 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4980 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x49F0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x4A10 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x4A80 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x4AA0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x4B10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x4B30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x4B78 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x4B98 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x4C08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x4C28 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x4CF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x4D10 (size: 0xC8)
    double UpperBodySpeedReference;                                                   // 0x4DD8 (size: 0x8)
    double deltaT;                                                                    // 0x4DE0 (size: 0x8)
    double PulseSumTime;                                                              // 0x4DE8 (size: 0x8)
    double staticYaw;                                                                 // 0x4DF0 (size: 0x8)
    double deltaYaw;                                                                  // 0x4DF8 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x4E00 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x4E01 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x4E08 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
