#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2462;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2463;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2464;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2465;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2466;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2467;                                                        // 0x0050 (size: 0x8)
    FName __NameProperty_2468;                                                        // 0x0058 (size: 0x8)
    FName __NameProperty_2469;                                                        // 0x0060 (size: 0x8)
    float __FloatProperty_2470;                                                       // 0x0068 (size: 0x4)
    TArray<int32> __ArrayProperty_2471;                                               // 0x0070 (size: 0x10)
    FName __NameProperty_2472;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2473;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2474;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2475;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2476;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2477;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2478;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2479;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2480;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_2481;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_2482;                                                        // 0x00D0 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2483;                            // 0x00D8 (size: 0x1)
    FName __NameProperty_2484;                                                        // 0x00DC (size: 0x8)
    FName __NameProperty_2485;                                                        // 0x00E4 (size: 0x8)
    float __FloatProperty_2486;                                                       // 0x00EC (size: 0x4)
    FName __NameProperty_2487;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_2488;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_2489;                                                        // 0x0100 (size: 0x8)
    int32 __IntProperty_2490;                                                         // 0x0108 (size: 0x4)
    FName __NameProperty_2491;                                                        // 0x010C (size: 0x8)
    int32 __IntProperty_2492;                                                         // 0x0114 (size: 0x4)
    FName __NameProperty_2493;                                                        // 0x0118 (size: 0x8)
    int32 __IntProperty_2494;                                                         // 0x0120 (size: 0x4)
    FName __NameProperty_2495;                                                        // 0x0124 (size: 0x8)
    int32 __IntProperty_2496;                                                         // 0x012C (size: 0x4)
    FName __NameProperty_2497;                                                        // 0x0130 (size: 0x8)
    int32 __IntProperty_2498;                                                         // 0x0138 (size: 0x4)
    FName __NameProperty_2499;                                                        // 0x013C (size: 0x8)
    FName __NameProperty_2500;                                                        // 0x0144 (size: 0x8)
    FName __NameProperty_2501;                                                        // 0x014C (size: 0x8)
    TArray<float> __ArrayProperty_2502;                                               // 0x0158 (size: 0x10)
    FName __NameProperty_2503;                                                        // 0x0168 (size: 0x8)
    TArray<int32> __ArrayProperty_2504;                                               // 0x0170 (size: 0x10)
    TArray<float> __ArrayProperty_2505;                                               // 0x0180 (size: 0x10)
    TArray<int32> __ArrayProperty_2506;                                               // 0x0190 (size: 0x10)
    TArray<int32> __ArrayProperty_2507;                                               // 0x01A0 (size: 0x10)
    FName __NameProperty_2508;                                                        // 0x01B0 (size: 0x8)
    EAnimSyncMethod __EnumProperty_2509;                                              // 0x01B8 (size: 0x1)
    FName __NameProperty_2510;                                                        // 0x01BC (size: 0x8)
    TArray<float> __ArrayProperty_2511;                                               // 0x01C8 (size: 0x10)
    FName __NameProperty_2512;                                                        // 0x01D8 (size: 0x8)
    TArray<float> __ArrayProperty_2513;                                               // 0x01E0 (size: 0x10)
    FName __NameProperty_2514;                                                        // 0x01F0 (size: 0x8)
    class UBlendProfile* __BlendProfile_2515;                                         // 0x01F8 (size: 0x8)
    class UCurveFloat* __CurveFloat_2516;                                             // 0x0200 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2517;                                            // 0x0208 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2518;                                     // 0x0209 (size: 0x1)
    TArray<float> __ArrayProperty_2519;                                               // 0x0210 (size: 0x10)
    float __FloatProperty_2520;                                                       // 0x0220 (size: 0x4)
    FName __NameProperty_2521;                                                        // 0x0224 (size: 0x8)
    int32 __IntProperty_2522;                                                         // 0x022C (size: 0x4)
    bool __BoolProperty_2523;                                                         // 0x0230 (size: 0x1)
    float __FloatProperty_2524;                                                       // 0x0234 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2525;                              // 0x0238 (size: 0x2C)
    float __FloatProperty_2526;                                                       // 0x0264 (size: 0x4)
    bool __BoolProperty_2527;                                                         // 0x0268 (size: 0x1)
    EAnimSyncMethod __EnumProperty_2528;                                              // 0x0269 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2529;                            // 0x026A (size: 0x1)
    FName __NameProperty_2530;                                                        // 0x026C (size: 0x8)
    FName __NameProperty_2531;                                                        // 0x0274 (size: 0x8)
    int32 __IntProperty_2532;                                                         // 0x027C (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2533;                                       // 0x0280 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x02A0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0320 (size: 0x18)

}; // Size: 0x338

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_4;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_11;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_14;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_15;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0040 (size: 0x4)
    bool __BoolProperty_20;                                                           // 0x0044 (size: 0x1)
    float __FloatProperty_21;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0060 (size: 0x4)
    bool __BoolProperty_28;                                                           // 0x0064 (size: 0x1)
    float __FloatProperty_29;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x006C (size: 0x4)
    bool __BoolProperty_31;                                                           // 0x0070 (size: 0x1)
    float __FloatProperty_32;                                                         // 0x0074 (size: 0x4)
    bool __BoolProperty_33;                                                           // 0x0078 (size: 0x1)
    bool __BoolProperty_34;                                                           // 0x0079 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x007A (size: 0x1)
    uint8 __ByteProperty_36;                                                          // 0x007B (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_38;                                                         // 0x0080 (size: 0x4)
    uint8 __ByteProperty_39;                                                          // 0x0084 (size: 0x1)
    uint8 __ByteProperty_40;                                                          // 0x0085 (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x0086 (size: 0x1)
    bool __BoolProperty_42;                                                           // 0x0087 (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x0088 (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x0089 (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x008A (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x008B (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x008C (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x008D (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x008E (size: 0x1)
    float __FloatProperty_50;                                                         // 0x0090 (size: 0x4)
    bool __BoolProperty_51;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_53;                                                           // 0x0096 (size: 0x1)
    bool __BoolProperty_54;                                                           // 0x0097 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x0098 (size: 0x1)
    float __FloatProperty_56;                                                         // 0x009C (size: 0x4)
    float __FloatProperty_57;                                                         // 0x00A0 (size: 0x4)
    bool __BoolProperty_58;                                                           // 0x00A4 (size: 0x1)
    float __FloatProperty_59;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_60;                                                         // 0x00AC (size: 0x4)

}; // Size: 0xB0

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0388 (size: 0xB0)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0438 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0440 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0448 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0468 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x04B0 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0590 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0698 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0760 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x07A8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x07D0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x08B0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08D8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x09E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0A08 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0A30 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0A58 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86;                         // 0x0AA0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85;                         // 0x0AE8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0B30 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0x0B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x0BA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x0BC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_70;                               // 0x0C10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x0C30 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x0C78 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0CC0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_69;                               // 0x0D30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_25;                             // 0x0D50 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x0E18 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x0E60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x0EA8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x0EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0F18 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x0F40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x0F88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x0FA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x0FF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x1010 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x10D8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x1120 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x1200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x1228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x1250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x1278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x12A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x12C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x12F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x1318 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x1340 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x1388 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x13A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x13F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x1410 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x1458 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x1478 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x14C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x14E0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x15A8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x15F0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x1638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1660 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x1688 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x16D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x16F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x1738 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1780 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x17A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x17C8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x1890 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x18B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x18E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x1928 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1970 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x19B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x19D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x1A20 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x1A68 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x1AD8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x1AF8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1BC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1BE8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x1C10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1C58 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1C78 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x1CE8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x1D08 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1DD0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1EB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x1ED8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1F20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x1F40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1F88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x1FA8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x2070 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x2098 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x20C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x2108 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x2128 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x2198 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x21B8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x2280 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x22C8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x23D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x23F8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2440 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2468 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2570 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x25C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x25E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x2610 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x2658 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x2678 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x26E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2730 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x27A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x27C0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x2888 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x28D0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2940 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x29B0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x29F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x2A20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x2A48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2A90 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2AB0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x2B20 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x2B40 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2D20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2D48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2D70 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x2D98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x2DB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x2E00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x2E20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2E68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x2E88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2ED0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2EF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2F38 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2F58 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2F80 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2FA0 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3068 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x3138 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3180 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x3260 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x3288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x32B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x32D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x3300 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x3328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x3350 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3378 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x33A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x33E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x3408 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x3450 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x3470 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x34B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x34D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x3520 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x3540 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3588 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x35A8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3670 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3698 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3778 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x37A0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x37E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x3860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x3888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x38B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x38D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3900 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x3928 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x3970 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x3990 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x39D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x39F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x3A40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x3A60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3AA8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x3AC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x3B10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3B30 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3BF8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3D00 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3D28 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3DC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3DF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3E18 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x3E40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3E88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3EA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3EF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3F10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3F58 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3F78 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x4040 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x4068 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x4090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x40B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x40E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x4108 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x4130 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x4178 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x4198 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x41E0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x4200 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x4228 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x4270 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x4290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x42B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x42E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4308 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4330 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4358 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x4380 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x43A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x43D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x43F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x4448 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x4470 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x44B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x44D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x4520 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x4540 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x45B0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x45D0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x4640 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x4660 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x46D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x46F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x4738 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x4780 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x47C8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x47E8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4858 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x4878 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4940 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x4960 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x4A28 (size: 0x48)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4A70 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x4B88 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4BF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x4C20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4C68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x4C88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4CD0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x4CF0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x4DB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4E00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4E28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4E50 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x4E98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4EE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x4F28 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4F70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4FB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4FD8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x5020 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x5068 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x50D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x50F8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x51C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x5208 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x5250 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x5298 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x52E0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x5328 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x5370 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x53B8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5400 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x5448 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x5490 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x54D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x5520 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x5540 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x5608 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x56E8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5710 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x5758 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5780 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x57C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x57F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x5818 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x5860 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x5880 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x58C8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x5910 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5958 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x5978 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5A68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x5A90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x5AD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5AF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5B40 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5B88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5BD0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x5BF0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x5CB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5D28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5D50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5D98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5DB8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5E00 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5E48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5E90 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5ED8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5F48 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5F68 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x6030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x6058 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x6080 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x60C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x60E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x6130 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x6178 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x61C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x61E0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x62A8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x62F0 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x63D0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x6418 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x6440 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x6468 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x64B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x64D0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x6518 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x6560 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x65A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x65C8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x6690 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x66D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x6700 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x6728 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x6770 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x6790 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x67D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x6820 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x6868 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x6888 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x6950 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x6A30 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x6A58 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x6AC8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6B10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6B38 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x6B60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x6BA8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6BC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x6C10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x6C30 (size: 0xC8)
    double UpperBodySpeedReference;                                                   // 0x6CF8 (size: 0x8)
    double deltaT;                                                                    // 0x6D00 (size: 0x8)
    double PulseSumTime;                                                              // 0x6D08 (size: 0x8)
    double staticYaw;                                                                 // 0x6D10 (size: 0x8)
    double deltaYaw;                                                                  // 0x6D18 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x6D20 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x6D21 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x6D28 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
