#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2374;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_2375;                                                        // 0x000C (size: 0x8)
    TArray<float> __ArrayProperty_2376;                                               // 0x0018 (size: 0x10)
    TArray<int32> __ArrayProperty_2377;                                               // 0x0028 (size: 0x10)
    TArray<float> __ArrayProperty_2378;                                               // 0x0038 (size: 0x10)
    TArray<float> __ArrayProperty_2379;                                               // 0x0048 (size: 0x10)
    TArray<int32> __ArrayProperty_2380;                                               // 0x0058 (size: 0x10)
    FName __NameProperty_2381;                                                        // 0x0068 (size: 0x8)
    float __FloatProperty_2382;                                                       // 0x0070 (size: 0x4)
    TArray<int32> __ArrayProperty_2383;                                               // 0x0078 (size: 0x10)
    FName __NameProperty_2384;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2385;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2386;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2387;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2388;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2389;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2390;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2391;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_2392;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_2393;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_2394;                                                        // 0x00D8 (size: 0x8)
    float __FloatProperty_2395;                                                       // 0x00E0 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2396;                            // 0x00E4 (size: 0x1)
    FName __NameProperty_2397;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_2398;                                                        // 0x00F0 (size: 0x8)
    float __FloatProperty_2399;                                                       // 0x00F8 (size: 0x4)
    FName __NameProperty_2400;                                                        // 0x00FC (size: 0x8)
    FName __NameProperty_2401;                                                        // 0x0104 (size: 0x8)
    FName __NameProperty_2402;                                                        // 0x010C (size: 0x8)
    int32 __IntProperty_2403;                                                         // 0x0114 (size: 0x4)
    FName __NameProperty_2404;                                                        // 0x0118 (size: 0x8)
    int32 __IntProperty_2405;                                                         // 0x0120 (size: 0x4)
    FName __NameProperty_2406;                                                        // 0x0124 (size: 0x8)
    int32 __IntProperty_2407;                                                         // 0x012C (size: 0x4)
    FName __NameProperty_2408;                                                        // 0x0130 (size: 0x8)
    int32 __IntProperty_2409;                                                         // 0x0138 (size: 0x4)
    FName __NameProperty_2410;                                                        // 0x013C (size: 0x8)
    int32 __IntProperty_2411;                                                         // 0x0144 (size: 0x4)
    FName __NameProperty_2412;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2413;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_2414;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_2415;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_2416;                                                        // 0x0168 (size: 0x8)
    TArray<int32> __ArrayProperty_2417;                                               // 0x0170 (size: 0x10)
    TArray<float> __ArrayProperty_2418;                                               // 0x0180 (size: 0x10)
    TArray<int32> __ArrayProperty_2419;                                               // 0x0190 (size: 0x10)
    TArray<int32> __ArrayProperty_2420;                                               // 0x01A0 (size: 0x10)
    FName __NameProperty_2421;                                                        // 0x01B0 (size: 0x8)
    EAnimSyncMethod __EnumProperty_2422;                                              // 0x01B8 (size: 0x1)
    FName __NameProperty_2423;                                                        // 0x01BC (size: 0x8)
    bool __BoolProperty_2424;                                                         // 0x01C4 (size: 0x1)
    TArray<float> __ArrayProperty_2425;                                               // 0x01C8 (size: 0x10)
    FName __NameProperty_2426;                                                        // 0x01D8 (size: 0x8)
    int32 __IntProperty_2427;                                                         // 0x01E0 (size: 0x4)
    float __FloatProperty_2428;                                                       // 0x01E4 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2429;                              // 0x01E8 (size: 0x2C)
    float __FloatProperty_2430;                                                       // 0x0214 (size: 0x4)
    EAnimSyncMethod __EnumProperty_2431;                                              // 0x0218 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2432;                            // 0x0219 (size: 0x1)
    class UBlendProfile* __BlendProfile_2433;                                         // 0x0220 (size: 0x8)
    class UCurveFloat* __CurveFloat_2434;                                             // 0x0228 (size: 0x8)
    bool __BoolProperty_2435;                                                         // 0x0230 (size: 0x1)
    EAlphaBlendOption __EnumProperty_2436;                                            // 0x0231 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2437;                                     // 0x0232 (size: 0x1)
    TArray<float> __ArrayProperty_2438;                                               // 0x0238 (size: 0x10)
    FName __NameProperty_2439;                                                        // 0x0248 (size: 0x8)
    FName __NameProperty_2440;                                                        // 0x0250 (size: 0x8)
    int32 __IntProperty_2441;                                                         // 0x0258 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2442;                                       // 0x0260 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0280 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0300 (size: 0x18)

}; // Size: 0x318

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x000D (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x000E (size: 0x1)
    float __FloatProperty_4;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_5;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    uint8 __ByteProperty_7;                                                           // 0x001C (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x001D (size: 0x1)
    uint8 __ByteProperty_9;                                                           // 0x001E (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x001F (size: 0x1)
    float __FloatProperty_11;                                                         // 0x0020 (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0028 (size: 0x4)
    uint8 __ByteProperty_14;                                                          // 0x002C (size: 0x1)
    float __FloatProperty_15;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0034 (size: 0x4)
    bool __BoolProperty_17;                                                           // 0x0038 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0068 (size: 0x4)
    bool __BoolProperty_30;                                                           // 0x006C (size: 0x1)
    float __FloatProperty_31;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_34;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_35;                                                         // 0x0080 (size: 0x4)
    bool __BoolProperty_36;                                                           // 0x0084 (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x0085 (size: 0x1)
    bool __BoolProperty_38;                                                           // 0x0086 (size: 0x1)
    uint8 __ByteProperty_39;                                                          // 0x0087 (size: 0x1)
    bool __BoolProperty_40;                                                           // 0x0088 (size: 0x1)
    float __FloatProperty_41;                                                         // 0x008C (size: 0x4)
    uint8 __ByteProperty_42;                                                          // 0x0090 (size: 0x1)
    uint8 __ByteProperty_43;                                                          // 0x0091 (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x0092 (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x0093 (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x0096 (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x0097 (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x0098 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x0099 (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x009A (size: 0x1)
    float __FloatProperty_53;                                                         // 0x009C (size: 0x4)
    bool __BoolProperty_54;                                                           // 0x00A0 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x00A1 (size: 0x1)
    bool __BoolProperty_56;                                                           // 0x00A2 (size: 0x1)
    bool __BoolProperty_57;                                                           // 0x00A3 (size: 0x1)
    bool __BoolProperty_58;                                                           // 0x00A4 (size: 0x1)

}; // Size: 0xA5

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0xA8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0440 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0448 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0450 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0470 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x04B8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0598 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x06A0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0768 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x07B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x07D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x0800 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x0848 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x0868 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x08B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x08D0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x0998 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0A78 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0AA0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0BA8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0BD0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0BF8 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0C20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x0C68 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x0CB0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0CF8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0D68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x0D90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x0DD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x0DF8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x0E40 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0E88 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x0EF8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x0F18 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x0FE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x1028 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x1070 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x10B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x10E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x1108 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x1150 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x1170 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x11B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x11D8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x12A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x12E8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x13C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x13F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x1418 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x1440 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x1468 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x1490 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x14B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x14E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x1508 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x1550 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x1570 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x15B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x15D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x1620 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x1640 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x1688 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x16A8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x1770 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x17B8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x1800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1828 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x1850 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1898 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x18B8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x1900 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1948 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x1970 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x1990 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1A58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1A80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x1AA8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x1AF0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1B38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1B80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x1BA0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x1BE8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x1C30 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1CA0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x1CC0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1D88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1DB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x1DD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1E20 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1E40 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1EB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x1ED0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1F98 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x2078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x20A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x20C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x2110 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x2130 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x21A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x21C0 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x2288 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x22D0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x23D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x2400 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2448 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2470 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2578 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x25A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x25C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x25F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x2618 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2660 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x2680 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x26F0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2738 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x27A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x27C8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x2890 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x28D8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2948 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x29B8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2A28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x2A50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x2A98 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2AB8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x2B28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2B48 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2C10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2C38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2C60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2C88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2CB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2CD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2D78 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2DA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2DC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2E08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x2E28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2E70 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x2E90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2ED8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x2EF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x2F40 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2F60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x2F88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x2FA8 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3070 (size: 0xD0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3140 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x3220 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x3248 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x3270 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x3298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x32C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x32E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3310 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3338 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x3360 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x33A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x33C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x3410 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x3430 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3478 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x3498 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x34E0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x3500 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x3548 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3568 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3630 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3658 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x3788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x37B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x37D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3878 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x38A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x38E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x3908 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3950 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x3970 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x39B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x39D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3A20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3A40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3A88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3AA8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3B70 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3C78 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3CA0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3CC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3CF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3D18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3D90 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3DB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3E00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x3E20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3E68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3E88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3ED0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x3EF0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x4008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x4030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x4058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x4080 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x40A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x40F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x4110 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x4158 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x4178 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x41A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x41E8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x42A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x42D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x42F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4320 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4348 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x4370 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x43C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x43E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4430 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x4450 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x4498 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x44B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4528 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x4548 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x45B8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x45D8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4648 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x4668 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x46B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x46F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4740 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4760 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x47D0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x47F0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x48B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x48D8 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x49A0 (size: 0x70)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4A10 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x4B28 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4B70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4B98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4BC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4C08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4C28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4C70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x4C90 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x4D58 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4DC8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x4DF0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x4E38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4E80 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x4EC8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4F10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4F58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x4F78 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x4FC0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5008 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x5078 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x5098 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x5160 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x51A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x51F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x5238 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x5280 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x52C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x5310 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x5358 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x53A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x53E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x5430 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5478 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x54C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x54E0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x55A8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x5688 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x56B0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x56F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x5720 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x5748 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x57B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x57E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x5828 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x5848 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5890 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x58D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5920 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x5940 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5A08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5A30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5A58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5AA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5AC0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5B08 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x5B50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5B98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5BB8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5C80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5CC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5CF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5D18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x5D60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5D80 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5DC8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5E10 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5E58 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5EA0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x5F10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x5F30 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x5FF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x6020 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x6048 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x6090 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x60B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x60F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x6140 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6188 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x61A8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x6270 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x62B8 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x6398 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6478 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x64C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x64E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x6510 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x6558 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x6578 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x65C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x6608 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x6650 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x6670 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x6738 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x67A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x67D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x6818 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x6838 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6880 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x68C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x6910 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x6930 (size: 0xC8)
    double UpperBodySpeedReference;                                                   // 0x69F8 (size: 0x8)
    double deltaT;                                                                    // 0x6A00 (size: 0x8)
    double PulseSumTime;                                                              // 0x6A08 (size: 0x8)
    double staticYaw;                                                                 // 0x6A10 (size: 0x8)
    double deltaYaw;                                                                  // 0x6A18 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x6A20 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x6A21 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x6A28 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_2C58BF374F7F8C8D168D968559D1C73E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_8338F95C4AF3E60124916B8D9A86FABA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
