#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2248;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2249;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2250;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2251;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2252;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2253;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_2254;                                                       // 0x0058 (size: 0x4)
    TArray<float> __ArrayProperty_2255;                                               // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_2256;                                               // 0x0070 (size: 0x10)
    FName __NameProperty_2257;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2258;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2259;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2260;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2261;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2262;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2263;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2264;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2265;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_2266;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_2267;                                                        // 0x00D0 (size: 0x8)
    float __FloatProperty_2268;                                                       // 0x00D8 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2269;                            // 0x00DC (size: 0x1)
    FName __NameProperty_2270;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_2271;                                                        // 0x00E8 (size: 0x8)
    float __FloatProperty_2272;                                                       // 0x00F0 (size: 0x4)
    FName __NameProperty_2273;                                                        // 0x00F4 (size: 0x8)
    FName __NameProperty_2274;                                                        // 0x00FC (size: 0x8)
    FName __NameProperty_2275;                                                        // 0x0104 (size: 0x8)
    int32 __IntProperty_2276;                                                         // 0x010C (size: 0x4)
    FName __NameProperty_2277;                                                        // 0x0110 (size: 0x8)
    int32 __IntProperty_2278;                                                         // 0x0118 (size: 0x4)
    FName __NameProperty_2279;                                                        // 0x011C (size: 0x8)
    int32 __IntProperty_2280;                                                         // 0x0124 (size: 0x4)
    FName __NameProperty_2281;                                                        // 0x0128 (size: 0x8)
    int32 __IntProperty_2282;                                                         // 0x0130 (size: 0x4)
    FName __NameProperty_2283;                                                        // 0x0134 (size: 0x8)
    int32 __IntProperty_2284;                                                         // 0x013C (size: 0x4)
    FName __NameProperty_2285;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_2286;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2287;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_2288;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_2289;                                                        // 0x0160 (size: 0x8)
    TArray<int32> __ArrayProperty_2290;                                               // 0x0168 (size: 0x10)
    FName __NameProperty_2291;                                                        // 0x0178 (size: 0x8)
    EAnimSyncMethod __EnumProperty_2292;                                              // 0x0180 (size: 0x1)
    FName __NameProperty_2293;                                                        // 0x0184 (size: 0x8)
    FName __NameProperty_2294;                                                        // 0x018C (size: 0x8)
    int32 __IntProperty_2295;                                                         // 0x0194 (size: 0x4)
    bool __BoolProperty_2296;                                                         // 0x0198 (size: 0x1)
    FInputScaleBiasClampConstants __StructProperty_2297;                              // 0x019C (size: 0x2C)
    float __FloatProperty_2298;                                                       // 0x01C8 (size: 0x4)
    float __FloatProperty_2299;                                                       // 0x01CC (size: 0x4)
    EAnimSyncMethod __EnumProperty_2300;                                              // 0x01D0 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2301;                            // 0x01D1 (size: 0x1)
    TArray<float> __ArrayProperty_2302;                                               // 0x01D8 (size: 0x10)
    FName __NameProperty_2303;                                                        // 0x01E8 (size: 0x8)
    FName __NameProperty_2304;                                                        // 0x01F0 (size: 0x8)
    int32 __IntProperty_2305;                                                         // 0x01F8 (size: 0x4)
    class UBlendProfile* __BlendProfile_2306;                                         // 0x0200 (size: 0x8)
    class UCurveFloat* __CurveFloat_2307;                                             // 0x0208 (size: 0x8)
    bool __BoolProperty_2308;                                                         // 0x0210 (size: 0x1)
    EAlphaBlendOption __EnumProperty_2309;                                            // 0x0211 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2310;                                     // 0x0212 (size: 0x1)
    TArray<float> __ArrayProperty_2311;                                               // 0x0218 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_2312;                                       // 0x0228 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0248 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02C8 (size: 0x18)

}; // Size: 0x2E0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_7;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_9;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0018 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_12;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_15;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    bool __BoolProperty_17;                                                           // 0x0034 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0044 (size: 0x4)
    bool __BoolProperty_22;                                                           // 0x0048 (size: 0x1)
    float __FloatProperty_23;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0064 (size: 0x4)
    bool __BoolProperty_30;                                                           // 0x0068 (size: 0x1)
    float __FloatProperty_31;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0074 (size: 0x4)
    bool __BoolProperty_34;                                                           // 0x0078 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x0079 (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x007A (size: 0x1)
    uint8 __ByteProperty_37;                                                          // 0x007B (size: 0x1)
    bool __BoolProperty_38;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_39;                                                         // 0x0080 (size: 0x4)
    bool __BoolProperty_40;                                                           // 0x0084 (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x0085 (size: 0x1)
    bool __BoolProperty_42;                                                           // 0x0086 (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x0087 (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x0088 (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x0089 (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x008A (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x008B (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x008C (size: 0x1)
    float __FloatProperty_49;                                                         // 0x0090 (size: 0x4)
    bool __BoolProperty_50;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x0095 (size: 0x1)

}; // Size: 0x96

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x98)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0430 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0438 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0440 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0460 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x04A8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0588 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0690 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0758 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x07A0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0880 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08A8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x09B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x09D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x0A00 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x0A28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x0A70 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0AB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0AE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x0B08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x0B50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x0B70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x0BB8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x0C00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x0C48 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x0C68 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0D30 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x0D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x0DA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x0DC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x0E10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x0E30 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x0E78 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x0EC0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x0F30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x0F50 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x1018 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x1060 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x10A8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x10F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x1118 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x1140 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x1188 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x11A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x11F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x1210 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x12D8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1320 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x1400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x1428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x1450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x1478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x14A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x14C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x14F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1518 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x1540 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x1588 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x15A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x15F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x1610 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1658 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x1678 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x16C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x16E0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x17A8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x17F0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1860 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x1888 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x18D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x18F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x1938 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1980 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x19A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x19C8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1A90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1AB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x1AE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x1B28 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1B70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1BB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x1BD8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x1C20 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1C68 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1CD8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x1CF8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x1DC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x1DE8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x1E10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x1E58 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1E78 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x1EE8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x1F08 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1FD0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x20B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x20D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2100 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2148 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x2168 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x21D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x21F8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x22C0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2308 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2410 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x2438 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2480 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x24A8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x25B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x25D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2628 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x2650 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x2698 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x26B8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x2728 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2770 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x27E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2800 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x28C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x2910 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2958 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x29C8 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x2A38 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2A80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2AA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x2AD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2B18 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x2B38 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2BA8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x2BC8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2CB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2CE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2D08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2D58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2D80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2DD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x2DF8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2E20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x2E40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2E88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x2EA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x2EF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x2F10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x2F58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x2F78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x2FC0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x2FE0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x3008 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3028 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x30F0 (size: 0xD0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x31C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x31E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x3210 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3258 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x3278 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x32C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x3308 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x3350 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3370 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3438 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x3518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x35B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x35E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x3608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3630 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3658 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x36A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x36C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x3708 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x3728 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3770 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3790 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x37D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x37F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3840 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x3860 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3928 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x3950 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3A30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3A58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3A80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3AA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3AD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3AF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3B20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3B70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x3B98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3BE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x3C00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3C48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x3C68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3CB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x3CD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3D18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x3D38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x3D80 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x3DA0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3E68 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3F70 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3F98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3FC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3FE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x4010 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x4038 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x4060 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x4088 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x40B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x40F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4118 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x4160 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4180 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x41C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x41E8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x42B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x42D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x4300 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4350 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4378 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x43A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x43E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4408 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4450 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4470 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x4498 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x44E0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x4500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x45A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x45C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x45F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x46B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x46E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4728 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x4748 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4790 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x47B0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4820 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x4840 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x48B0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x48D0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4940 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x4960 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x49A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x49F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4A38 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x4A58 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4AC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x4AE8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x4BB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x4BD0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x4C98 (size: 0x48)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4CE0 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x4DF8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x4E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x4E68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x4E90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x4ED8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x4EF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x4F40 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x4F60 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5028 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5070 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5098 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x50C0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x5108 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x5150 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x5198 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x51E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5228 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5248 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5290 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x52D8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5348 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x5368 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x5430 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5478 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x54C0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5508 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5550 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5598 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x55E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5628 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5648 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x5710 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x57F0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5818 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x5860 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5888 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x58D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x58F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5920 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x5968 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5988 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x59D0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5A18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x5A60 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x5A80 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x5B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x5B70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x5B98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x5BE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x5C00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x5C48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5C90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x5CD8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x5CF8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x5DC0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x5E08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x5E30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x5E58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x5EA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x5EC0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x5F08 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x5F50 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x5F98 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5FE0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x6050 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x6070 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6138 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6160 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x6188 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x61D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x61F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6238 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x6280 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x62C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x62E8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x63B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x63F8 (size: 0xE0)
    double UpperBodySpeedReference;                                                   // 0x64D8 (size: 0x8)
    double deltaT;                                                                    // 0x64E0 (size: 0x8)
    double PulseSumTime;                                                              // 0x64E8 (size: 0x8)
    double staticYaw;                                                                 // 0x64F0 (size: 0x8)
    double deltaYaw;                                                                  // 0x64F8 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x6500 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x6501 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x6508 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
