#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1227;                                                        // 0x0004 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1228;                            // 0x000C (size: 0x1)
    TArray<float> __ArrayProperty_1229;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_1230;                                               // 0x0020 (size: 0x10)
    float __FloatProperty_1231;                                                       // 0x0030 (size: 0x4)
    TArray<float> __ArrayProperty_1232;                                               // 0x0038 (size: 0x10)
    TArray<int32> __ArrayProperty_1233;                                               // 0x0048 (size: 0x10)
    FName __NameProperty_1234;                                                        // 0x0058 (size: 0x8)
    TArray<float> __ArrayProperty_1235;                                               // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_1236;                                               // 0x0070 (size: 0x10)
    float __FloatProperty_1237;                                                       // 0x0080 (size: 0x4)
    class UBlendProfile* __BlendProfile_1238;                                         // 0x0088 (size: 0x8)
    class UCurveFloat* __CurveFloat_1239;                                             // 0x0090 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1240;                                            // 0x0098 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1241;                                     // 0x0099 (size: 0x1)
    TArray<float> __ArrayProperty_1242;                                               // 0x00A0 (size: 0x10)
    TArray<int32> __ArrayProperty_1243;                                               // 0x00B0 (size: 0x10)
    float __FloatProperty_1244;                                                       // 0x00C0 (size: 0x4)
    FName __NameProperty_1245;                                                        // 0x00C4 (size: 0x8)
    EAnimSyncMethod __EnumProperty_1246;                                              // 0x00CC (size: 0x1)
    FName __NameProperty_1247;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_1248;                                                        // 0x00D8 (size: 0x8)
    FName __NameProperty_1249;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_1250;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_1251;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_1252;                                                        // 0x00F8 (size: 0x8)
    int32 __IntProperty_1253;                                                         // 0x0100 (size: 0x4)
    FName __NameProperty_1254;                                                        // 0x0104 (size: 0x8)
    int32 __IntProperty_1255;                                                         // 0x010C (size: 0x4)
    FName __NameProperty_1256;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_1257;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_1258;                                                        // 0x0120 (size: 0x8)
    FName __NameProperty_1259;                                                        // 0x0128 (size: 0x8)
    int32 __IntProperty_1260;                                                         // 0x0130 (size: 0x4)
    FName __NameProperty_1261;                                                        // 0x0134 (size: 0x8)
    int32 __IntProperty_1262;                                                         // 0x013C (size: 0x4)
    FName __NameProperty_1263;                                                        // 0x0140 (size: 0x8)
    int32 __IntProperty_1264;                                                         // 0x0148 (size: 0x4)
    FName __NameProperty_1265;                                                        // 0x014C (size: 0x8)
    int32 __IntProperty_1266;                                                         // 0x0154 (size: 0x4)
    bool __BoolProperty_1267;                                                         // 0x0158 (size: 0x1)
    float __FloatProperty_1268;                                                       // 0x015C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1269;                              // 0x0160 (size: 0x2C)
    float __FloatProperty_1270;                                                       // 0x018C (size: 0x4)
    bool __BoolProperty_1271;                                                         // 0x0190 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1272;                                              // 0x0191 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1273;                            // 0x0192 (size: 0x1)
    FName __NameProperty_1274;                                                        // 0x0194 (size: 0x8)
    FName __NameProperty_1275;                                                        // 0x019C (size: 0x8)
    int32 __IntProperty_1276;                                                         // 0x01A4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1277;                                       // 0x01A8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01C8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0248 (size: 0x18)

}; // Size: 0x260

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x001C (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x001D (size: 0x1)
    float __FloatProperty_7;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0028 (size: 0x4)
    uint8 __ByteProperty_10;                                                          // 0x002C (size: 0x1)
    float __FloatProperty_11;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0044 (size: 0x4)

}; // Size: 0x48

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x48)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03E0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03E8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03F0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x0410 (size: 0x70)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0480 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x04C8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x05A8 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x06B0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0778 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x07C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x07E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x0810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x0838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x0860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x0888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x08B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x08D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x0900 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x0948 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x0968 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x09B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x09D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x0A18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x0A38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x0A80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x0AA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x0AE8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x0B08 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x0BD0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x0CB0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x0CD8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x0DE0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x0E08 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x0E30 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x0E58 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x0EA0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x0EE8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0F10 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x0F58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x0F80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x0FA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x0FF0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x1010 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x1080 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x10A0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x1168 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x11B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x11F8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x1240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x1268 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x1290 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x12D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x12F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x1340 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x1360 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1428 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1470 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x1550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x1578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x15A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x15C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x15F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x1618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1668 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x1690 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x16D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x16F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x1740 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x1760 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x17A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x17C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x1810 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x1830 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x18F8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1940 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x1988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x19B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x19D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x1A50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x1A78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x1AC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x1AE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x1B28 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x1B48 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x1B70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x1B90 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x1C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x1C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x1CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x1CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x1CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x1D20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x1D48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1D90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x1DB0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1DF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x1E40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x1E88 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x1EA8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x1F18 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x1F38 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x2000 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x2028 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x2050 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x2078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x20A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x20C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x20F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x2138 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x2158 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x21A0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x21C0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x2230 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x2250 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x2318 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x23F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x2420 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x2448 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x2490 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x24B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x24F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x2518 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x25E0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x26C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x26E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x2710 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x2758 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x2778 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x27E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x2808 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x28D0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2918 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2A20 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2A48 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2B28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x2B50 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2B98 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2BC0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2CC8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2CF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x2D18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x2D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x2D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x2D90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x2DB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x2DE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x2E08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x2E50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x2E70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x2EB8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x2ED8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x2F48 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x2F68 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3030 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x3058 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x30A0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x3110 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x3180 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x31C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x31F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x3218 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x3260 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x3280 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x32F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x3310 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x33D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x3400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x3428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x3450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x3478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x34A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x34C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x34F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x3518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x3540 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x3568 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x3588 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x35D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x35F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x3638 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x3658 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x36A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x36C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3708 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x3728 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x3750 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x3770 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3838 (size: 0xD0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x3908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x3930 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x3958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x3980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x39A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x39D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x39F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x3A20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x3A48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x3A90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x3AB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x3AF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x3B18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3B60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3B80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x3BC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x3BE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3C30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x3C50 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3D18 (size: 0xE0)
    double UpperBodySpeedReference;                                                   // 0x3DF8 (size: 0x8)
    double deltaT;                                                                    // 0x3E00 (size: 0x8)
    double PulseSumTime;                                                              // 0x3E08 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_BlendSpacePlayer_A93DB38D49738EF832DCF492B403C3DF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_924A231840EFD8BFAEE6FF97D5A9DF8F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_A207C5FD40B4BD992FDDAB8681219062();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_98973D2647D559DC03C63CA996985C30();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TwoWayBlend_354DD17E4A0C899E8EF85C97E420B17E();
