#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2418;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2419;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2420;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2421;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2422;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2423;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_2424;                                                       // 0x0058 (size: 0x4)
    TArray<int32> __ArrayProperty_2425;                                               // 0x0060 (size: 0x10)
    FName __NameProperty_2426;                                                        // 0x0070 (size: 0x8)
    FName __NameProperty_2427;                                                        // 0x0078 (size: 0x8)
    FName __NameProperty_2428;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2429;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2430;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2431;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2432;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2433;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2434;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2435;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2436;                                                        // 0x00C0 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2437;                            // 0x00C8 (size: 0x1)
    FName __NameProperty_2438;                                                        // 0x00CC (size: 0x8)
    FName __NameProperty_2439;                                                        // 0x00D4 (size: 0x8)
    float __FloatProperty_2440;                                                       // 0x00DC (size: 0x4)
    FName __NameProperty_2441;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_2442;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_2443;                                                        // 0x00F0 (size: 0x8)
    int32 __IntProperty_2444;                                                         // 0x00F8 (size: 0x4)
    FName __NameProperty_2445;                                                        // 0x00FC (size: 0x8)
    int32 __IntProperty_2446;                                                         // 0x0104 (size: 0x4)
    FName __NameProperty_2447;                                                        // 0x0108 (size: 0x8)
    int32 __IntProperty_2448;                                                         // 0x0110 (size: 0x4)
    FName __NameProperty_2449;                                                        // 0x0114 (size: 0x8)
    int32 __IntProperty_2450;                                                         // 0x011C (size: 0x4)
    FName __NameProperty_2451;                                                        // 0x0120 (size: 0x8)
    int32 __IntProperty_2452;                                                         // 0x0128 (size: 0x4)
    FName __NameProperty_2453;                                                        // 0x012C (size: 0x8)
    FName __NameProperty_2454;                                                        // 0x0134 (size: 0x8)
    FName __NameProperty_2455;                                                        // 0x013C (size: 0x8)
    float __FloatProperty_2456;                                                       // 0x0144 (size: 0x4)
    FName __NameProperty_2457;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2458;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_2459;                                                        // 0x0158 (size: 0x8)
    TArray<int32> __ArrayProperty_2460;                                               // 0x0160 (size: 0x10)
    TArray<float> __ArrayProperty_2461;                                               // 0x0170 (size: 0x10)
    TArray<int32> __ArrayProperty_2462;                                               // 0x0180 (size: 0x10)
    TArray<int32> __ArrayProperty_2463;                                               // 0x0190 (size: 0x10)
    FName __NameProperty_2464;                                                        // 0x01A0 (size: 0x8)
    TArray<float> __ArrayProperty_2465;                                               // 0x01A8 (size: 0x10)
    EAnimSyncMethod __EnumProperty_2466;                                              // 0x01B8 (size: 0x1)
    FName __NameProperty_2467;                                                        // 0x01BC (size: 0x8)
    TArray<float> __ArrayProperty_2468;                                               // 0x01C8 (size: 0x10)
    FName __NameProperty_2469;                                                        // 0x01D8 (size: 0x8)
    int32 __IntProperty_2470;                                                         // 0x01E0 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2471;                              // 0x01E4 (size: 0x2C)
    class UBlendProfile* __BlendProfile_2472;                                         // 0x0210 (size: 0x8)
    class UCurveFloat* __CurveFloat_2473;                                             // 0x0218 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2474;                                            // 0x0220 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2475;                                     // 0x0221 (size: 0x1)
    TArray<float> __ArrayProperty_2476;                                               // 0x0228 (size: 0x10)
    FName __NameProperty_2477;                                                        // 0x0238 (size: 0x8)
    int32 __IntProperty_2478;                                                         // 0x0240 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2479;                                       // 0x0248 (size: 0x20)
    float __FloatProperty_2480;                                                       // 0x0268 (size: 0x4)
    bool __BoolProperty_2481;                                                         // 0x026C (size: 0x1)
    float __FloatProperty_2482;                                                       // 0x0270 (size: 0x4)
    bool __BoolProperty_2483;                                                         // 0x0274 (size: 0x1)
    EAnimSyncMethod __EnumProperty_2484;                                              // 0x0275 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2485;                            // 0x0276 (size: 0x1)
    FName __NameProperty_2486;                                                        // 0x0278 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0280 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0300 (size: 0x18)

}; // Size: 0x318

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_7;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_9;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0018 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_12;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_15;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0040 (size: 0x4)
    bool __BoolProperty_21;                                                           // 0x0044 (size: 0x1)
    float __FloatProperty_22;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0060 (size: 0x4)
    bool __BoolProperty_29;                                                           // 0x0064 (size: 0x1)
    float __FloatProperty_30;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_34;                                                         // 0x0078 (size: 0x4)
    bool __BoolProperty_35;                                                           // 0x007C (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x007D (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x007E (size: 0x1)
    uint8 __ByteProperty_38;                                                          // 0x007F (size: 0x1)
    bool __BoolProperty_39;                                                           // 0x0080 (size: 0x1)
    float __FloatProperty_40;                                                         // 0x0084 (size: 0x4)
    uint8 __ByteProperty_41;                                                          // 0x0088 (size: 0x1)
    uint8 __ByteProperty_42;                                                          // 0x0089 (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x008A (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x008B (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x008C (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x008D (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x008E (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x008F (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x0090 (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x0091 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x0092 (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x0093 (size: 0x1)
    float __FloatProperty_53;                                                         // 0x0094 (size: 0x4)
    bool __BoolProperty_54;                                                           // 0x0098 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x0099 (size: 0x1)
    bool __BoolProperty_56;                                                           // 0x009A (size: 0x1)
    bool __BoolProperty_57;                                                           // 0x009B (size: 0x1)
    bool __BoolProperty_58;                                                           // 0x009C (size: 0x1)
    float __FloatProperty_59;                                                         // 0x00A0 (size: 0x4)
    float __FloatProperty_60;                                                         // 0x00A4 (size: 0x4)

}; // Size: 0xA8

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0388 (size: 0xA8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0430 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0438 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0440 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0460 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x04A8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0588 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0690 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0758 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x07A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x07E8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x08C8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08F0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x09F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0A20 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0A48 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0A70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x0AB8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x0B00 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0B48 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x0B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x0BB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x0BE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x0C28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x0C48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x0C90 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0CD8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x0D48 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x0D68 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x0E30 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x0E78 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x0EC0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0F08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0F30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x0F58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x0FA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x0FC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x1008 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x1028 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x10F0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x1138 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x1218 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x1240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x1268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x1290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x12B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x12E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x1308 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x1330 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x1358 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x13A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x13C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x1408 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x1428 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x1470 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x1490 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x14D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x14F8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x15C0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1608 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x1678 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x16A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x16E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x1708 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x1750 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1798 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x17C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x17E0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x18A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x18D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x18F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x1940 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1988 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x19D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x19F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x1A38 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x1A80 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x1AF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x1B10 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1C00 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x1C28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1C70 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1C90 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1D00 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x1D20 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1DE8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1EF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x1F18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1F60 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1F80 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1FF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x2010 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x20D8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2120 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2228 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x2250 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2298 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x22C0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x23C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x23F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x2418 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x2440 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x2468 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x24B0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x24D0 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x2540 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2588 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x25F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x2618 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x26E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x2728 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2770 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x27E0 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x2850 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x2898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x28C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x28E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2930 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2950 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x29C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x29E0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2AA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2AD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2AF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2B20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2B70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2B98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2BC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2BE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2C10 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x2C38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x2C58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x2CA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x2CC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2D08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2D28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2D70 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x2D90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2DD8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2DF8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2E20 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2E40 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2F08 (size: 0xD0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x2FD8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3020 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x3100 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x3128 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x3150 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x3178 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x31A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x31C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x31F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3218 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x3240 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x3288 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x32A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x32F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x3310 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x3358 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x3378 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x33C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x33E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3428 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x3448 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3510 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3538 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x36B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x36E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3758 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x3780 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x37C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x37E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x3830 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x3850 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x3898 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x38B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3900 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x3920 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x3968 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3988 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3A50 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3B58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3B80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3BA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3BF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3C20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3C48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3C70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x3C98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3CE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3D00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3D48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3D68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3DB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3DD0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3E98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3EC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3EE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3F38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3F60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x3F88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3FD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3FF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x4038 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x4058 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x4080 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x40C8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x40E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x4110 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4138 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4160 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x41B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x41D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x42A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x42C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x4310 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x4330 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x4378 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x4398 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4408 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x4428 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x4498 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x44B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4528 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x4548 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x4590 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x45D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x4620 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4640 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x46B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x46D0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4798 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x47B8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x48A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x48D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4918 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x4938 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4980 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x49A0 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4A68 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x4B80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4BF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4C18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4C60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4C80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4CC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x4CE8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x4DB0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4DF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4E20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x4E48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x4E90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4ED8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x4F20 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4F68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4FB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x4FD0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x5018 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x5060 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x50D0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x50F0 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x51B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x5200 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x5248 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x5290 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x52D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x5320 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x5368 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x53B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x53F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x5440 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x5488 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x54D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5518 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x5538 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x5600 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x56E0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5708 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5750 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x5798 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x57C0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5808 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5830 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x5858 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x58A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x58C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5908 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5950 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5998 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x59B8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5A80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5AA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5AD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5B18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5B38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5B80 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x5BC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5C10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5C30 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5CF8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5D68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5D90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x5DD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5DF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5E40 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5E88 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5ED0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5F18 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x5F88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x5FA8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x6070 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x6098 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x60C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x6108 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x6128 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x6170 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x61B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6200 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x6220 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x62E8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x6330 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6410 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x6458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x6480 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x64A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x64F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x6510 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x6558 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x65A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x65E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x6608 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x66D0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6740 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x6768 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x67B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x67D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6818 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x6860 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x68A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x68C8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x6990 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x6A70 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x6A98 (size: 0x70)
    double UpperBodySpeedReference;                                                   // 0x6B08 (size: 0x8)
    double deltaT;                                                                    // 0x6B10 (size: 0x8)
    double PulseSumTime;                                                              // 0x6B18 (size: 0x8)
    double staticYaw;                                                                 // 0x6B20 (size: 0x8)
    double deltaYaw;                                                                  // 0x6B28 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x6B30 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x6B31 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x6B38 (size: 0x18)
    bool IsFalling;                                                                   // 0x6B50 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
