#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2101;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2102;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2103;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2104;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2105;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2106;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_2107;                                                       // 0x0058 (size: 0x4)
    TArray<float> __ArrayProperty_2108;                                               // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_2109;                                               // 0x0070 (size: 0x10)
    FName __NameProperty_2110;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2111;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2112;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2113;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2114;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2115;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2116;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2117;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2118;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_2119;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_2120;                                                        // 0x00D0 (size: 0x8)
    float __FloatProperty_2121;                                                       // 0x00D8 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2122;                            // 0x00DC (size: 0x1)
    FName __NameProperty_2123;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_2124;                                                        // 0x00E8 (size: 0x8)
    float __FloatProperty_2125;                                                       // 0x00F0 (size: 0x4)
    FName __NameProperty_2126;                                                        // 0x00F4 (size: 0x8)
    FName __NameProperty_2127;                                                        // 0x00FC (size: 0x8)
    FName __NameProperty_2128;                                                        // 0x0104 (size: 0x8)
    int32 __IntProperty_2129;                                                         // 0x010C (size: 0x4)
    FName __NameProperty_2130;                                                        // 0x0110 (size: 0x8)
    int32 __IntProperty_2131;                                                         // 0x0118 (size: 0x4)
    FName __NameProperty_2132;                                                        // 0x011C (size: 0x8)
    int32 __IntProperty_2133;                                                         // 0x0124 (size: 0x4)
    FName __NameProperty_2134;                                                        // 0x0128 (size: 0x8)
    int32 __IntProperty_2135;                                                         // 0x0130 (size: 0x4)
    FName __NameProperty_2136;                                                        // 0x0134 (size: 0x8)
    int32 __IntProperty_2137;                                                         // 0x013C (size: 0x4)
    FName __NameProperty_2138;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_2139;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2140;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_2141;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_2142;                                                        // 0x0160 (size: 0x8)
    TArray<int32> __ArrayProperty_2143;                                               // 0x0168 (size: 0x10)
    FName __NameProperty_2144;                                                        // 0x0178 (size: 0x8)
    TArray<float> __ArrayProperty_2145;                                               // 0x0180 (size: 0x10)
    FName __NameProperty_2146;                                                        // 0x0190 (size: 0x8)
    int32 __IntProperty_2147;                                                         // 0x0198 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2148;                              // 0x019C (size: 0x2C)
    EAnimSyncMethod __EnumProperty_2149;                                              // 0x01C8 (size: 0x1)
    class UBlendProfile* __BlendProfile_2150;                                         // 0x01D0 (size: 0x8)
    class UCurveFloat* __CurveFloat_2151;                                             // 0x01D8 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2152;                                            // 0x01E0 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2153;                                     // 0x01E1 (size: 0x1)
    TArray<float> __ArrayProperty_2154;                                               // 0x01E8 (size: 0x10)
    bool __BoolProperty_2155;                                                         // 0x01F8 (size: 0x1)
    float __FloatProperty_2156;                                                       // 0x01FC (size: 0x4)
    float __FloatProperty_2157;                                                       // 0x0200 (size: 0x4)
    bool __BoolProperty_2158;                                                         // 0x0204 (size: 0x1)
    EAnimSyncMethod __EnumProperty_2159;                                              // 0x0205 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2160;                            // 0x0206 (size: 0x1)
    FName __NameProperty_2161;                                                        // 0x0208 (size: 0x8)
    FName __NameProperty_2162;                                                        // 0x0210 (size: 0x8)
    FName __NameProperty_2163;                                                        // 0x0218 (size: 0x8)
    int32 __IntProperty_2164;                                                         // 0x0220 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2165;                                       // 0x0228 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0248 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02C8 (size: 0x18)

}; // Size: 0x2E0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_4;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_11;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_14;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_15;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x005C (size: 0x4)
    bool __BoolProperty_27;                                                           // 0x0060 (size: 0x1)
    float __FloatProperty_28;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0068 (size: 0x4)
    bool __BoolProperty_30;                                                           // 0x006C (size: 0x1)
    float __FloatProperty_31;                                                         // 0x0070 (size: 0x4)
    bool __BoolProperty_32;                                                           // 0x0074 (size: 0x1)
    bool __BoolProperty_33;                                                           // 0x0075 (size: 0x1)
    bool __BoolProperty_34;                                                           // 0x0076 (size: 0x1)
    uint8 __ByteProperty_35;                                                          // 0x0077 (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x0078 (size: 0x1)
    float __FloatProperty_37;                                                         // 0x007C (size: 0x4)
    bool __BoolProperty_38;                                                           // 0x0080 (size: 0x1)
    bool __BoolProperty_39;                                                           // 0x0081 (size: 0x1)
    bool __BoolProperty_40;                                                           // 0x0082 (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x0083 (size: 0x1)
    bool __BoolProperty_42;                                                           // 0x0084 (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x0085 (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x0086 (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x0087 (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x0088 (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x0089 (size: 0x1)
    float __FloatProperty_48;                                                         // 0x008C (size: 0x4)

}; // Size: 0x90

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x90)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0428 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0430 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0438 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0458 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x04A0 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0580 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0688 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0750 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x0798 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0878 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08A0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x09A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x09D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x09F8 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x0A20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x0A68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x0AB0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0AF8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x0B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x0B68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x0B90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x0BD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x0BF8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x0C40 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x0C88 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x0CF8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x0D18 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x0DE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x0E28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x0E70 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x0EB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x0EE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x0F08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x0F50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x0F70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x0FB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x0FD8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x10A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x10E8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x11C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x11F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1218 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x1240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x1268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x12B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x12E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x1308 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1350 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x1370 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x13B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x13D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1420 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x1440 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1488 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x14A8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x1570 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x15B8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1628 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x1650 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1698 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x16B8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x1700 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1748 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1770 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x1790 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x1858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x1880 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x18A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x18F0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1938 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x1980 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x19A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x19E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1A30 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x1AA0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x1AC0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x1B88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x1BB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x1BD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x1C20 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1C40 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x1CB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x1CD0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1D98 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x1E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x1EA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x1EC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x1F10 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x1F30 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x1FA0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x1FC0 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x2088 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x20D0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x21D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x2200 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2248 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2270 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2378 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x23A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x23C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x23F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x2418 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2460 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2480 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x24F0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2538 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x25A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x25C8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x2690 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x2770 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x27B8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2828 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x2898 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x28E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2908 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x2930 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2978 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x2998 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2A08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x2A28 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2AF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2B18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x2C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x2C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x2C58 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x2C80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x2CA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x2CE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x2D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x2D50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x2D70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x2DB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x2DD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x2E20 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x2E40 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x2E68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x2E88 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2F50 (size: 0xD0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x3020 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x3100 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3128 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3150 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3178 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x31A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x31C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x31F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3218 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3240 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x3288 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x32A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x32F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3310 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3358 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x3378 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x33C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x33E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3428 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x3448 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3510 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x3538 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x36B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x36E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3758 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x3780 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x37C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x37E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3830 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x3850 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3898 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x38B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3900 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x3920 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x3968 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x3988 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3A50 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3B58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3B80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3BA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3BF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3C20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3C48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3C70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x3C98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x3CE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x3D00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x3D48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x3D68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x3DB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x3DD0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x3E98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x3EC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x3EE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x3F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x3F38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x3F60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x3F88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x3FD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x3FF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4038 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4058 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x4080 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x40C8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x40E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4110 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4138 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4160 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x41B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x41D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x42A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x42C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4310 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x4330 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4378 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x4398 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4408 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x4428 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4498 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x44B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4528 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x4548 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x4590 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x45D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4620 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x4640 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x46B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x46D0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x4798 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x47B8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x4880 (size: 0x48)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x48C8 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x49E0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x4A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x4A50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x4A78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x4AC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x4AE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x4B28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x4B48 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x4C10 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x4C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x4C80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x4CA8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x4CF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x4D38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x4D80 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x4DC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x4E10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x4E30 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x4E78 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x4EC0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x4F30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x4F50 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5018 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5060 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x50A8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x50F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5138 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5180 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x51C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5210 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5230 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x52F8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x53D8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5400 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5448 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5470 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5498 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x54E0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5500 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x5548 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5590 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x55D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x55F8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x56C0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x56E8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x5730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x5758 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x5780 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x57C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x57E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x5830 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x5878 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x58C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x58E0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x59A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x59D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x59F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x5A40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x5A60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x5AA8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x5AF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x5B38 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x5B58 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x5C20 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x5C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x5C90 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x5CB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x5D00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x5D20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x5D68 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x5DB0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x5DF8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5E40 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x5EB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x5ED0 (size: 0xC8)
    double UpperBodySpeedReference;                                                   // 0x5F98 (size: 0x8)
    double deltaT;                                                                    // 0x5FA0 (size: 0x8)
    double PulseSumTime;                                                              // 0x5FA8 (size: 0x8)
    double staticYaw;                                                                 // 0x5FB0 (size: 0x8)
    double deltaYaw;                                                                  // 0x5FB8 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x5FC0 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x5FC1 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x5FC8 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
