#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2417;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2418;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2419;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2420;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2421;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2422;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_2423;                                                       // 0x0058 (size: 0x4)
    TArray<int32> __ArrayProperty_2424;                                               // 0x0060 (size: 0x10)
    FName __NameProperty_2425;                                                        // 0x0070 (size: 0x8)
    FName __NameProperty_2426;                                                        // 0x0078 (size: 0x8)
    FName __NameProperty_2427;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2428;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2429;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2430;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2431;                                                        // 0x00A0 (size: 0x8)
    TArray<float> __ArrayProperty_2432;                                               // 0x00A8 (size: 0x10)
    FName __NameProperty_2433;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2434;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_2435;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_2436;                                                        // 0x00D0 (size: 0x8)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2437;                            // 0x00D8 (size: 0x1)
    FName __NameProperty_2438;                                                        // 0x00DC (size: 0x8)
    FName __NameProperty_2439;                                                        // 0x00E4 (size: 0x8)
    float __FloatProperty_2440;                                                       // 0x00EC (size: 0x4)
    FName __NameProperty_2441;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_2442;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_2443;                                                        // 0x0100 (size: 0x8)
    int32 __IntProperty_2444;                                                         // 0x0108 (size: 0x4)
    FName __NameProperty_2445;                                                        // 0x010C (size: 0x8)
    int32 __IntProperty_2446;                                                         // 0x0114 (size: 0x4)
    FName __NameProperty_2447;                                                        // 0x0118 (size: 0x8)
    int32 __IntProperty_2448;                                                         // 0x0120 (size: 0x4)
    FName __NameProperty_2449;                                                        // 0x0124 (size: 0x8)
    int32 __IntProperty_2450;                                                         // 0x012C (size: 0x4)
    FName __NameProperty_2451;                                                        // 0x0130 (size: 0x8)
    int32 __IntProperty_2452;                                                         // 0x0138 (size: 0x4)
    FName __NameProperty_2453;                                                        // 0x013C (size: 0x8)
    FName __NameProperty_2454;                                                        // 0x0144 (size: 0x8)
    FName __NameProperty_2455;                                                        // 0x014C (size: 0x8)
    float __FloatProperty_2456;                                                       // 0x0154 (size: 0x4)
    FName __NameProperty_2457;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_2458;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_2459;                                                        // 0x0168 (size: 0x8)
    TArray<int32> __ArrayProperty_2460;                                               // 0x0170 (size: 0x10)
    TArray<float> __ArrayProperty_2461;                                               // 0x0180 (size: 0x10)
    TArray<int32> __ArrayProperty_2462;                                               // 0x0190 (size: 0x10)
    TArray<int32> __ArrayProperty_2463;                                               // 0x01A0 (size: 0x10)
    FName __NameProperty_2464;                                                        // 0x01B0 (size: 0x8)
    TArray<float> __ArrayProperty_2465;                                               // 0x01B8 (size: 0x10)
    EAnimSyncMethod __EnumProperty_2466;                                              // 0x01C8 (size: 0x1)
    FName __NameProperty_2467;                                                        // 0x01CC (size: 0x8)
    TArray<float> __ArrayProperty_2468;                                               // 0x01D8 (size: 0x10)
    FName __NameProperty_2469;                                                        // 0x01E8 (size: 0x8)
    int32 __IntProperty_2470;                                                         // 0x01F0 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2471;                              // 0x01F4 (size: 0x2C)
    class UBlendProfile* __BlendProfile_2472;                                         // 0x0220 (size: 0x8)
    class UCurveFloat* __CurveFloat_2473;                                             // 0x0228 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2474;                                            // 0x0230 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2475;                                     // 0x0231 (size: 0x1)
    TArray<float> __ArrayProperty_2476;                                               // 0x0238 (size: 0x10)
    FName __NameProperty_2477;                                                        // 0x0248 (size: 0x8)
    int32 __IntProperty_2478;                                                         // 0x0250 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2479;                                       // 0x0258 (size: 0x20)
    float __FloatProperty_2480;                                                       // 0x0278 (size: 0x4)
    bool __BoolProperty_2481;                                                         // 0x027C (size: 0x1)
    float __FloatProperty_2482;                                                       // 0x0280 (size: 0x4)
    bool __BoolProperty_2483;                                                         // 0x0284 (size: 0x1)
    EAnimSyncMethod __EnumProperty_2484;                                              // 0x0285 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2485;                            // 0x0286 (size: 0x1)
    FName __NameProperty_2486;                                                        // 0x0288 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0290 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0310 (size: 0x18)

}; // Size: 0x328

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_4;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    bool __BoolProperty_10;                                                           // 0x001C (size: 0x1)
    float __FloatProperty_11;                                                         // 0x0020 (size: 0x4)
    uint8 __ByteProperty_12;                                                          // 0x0024 (size: 0x1)
    float __FloatProperty_13;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x002C (size: 0x4)
    bool __BoolProperty_15;                                                           // 0x0030 (size: 0x1)
    float __FloatProperty_16;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0044 (size: 0x4)
    bool __BoolProperty_21;                                                           // 0x0048 (size: 0x1)
    float __FloatProperty_22;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0064 (size: 0x4)
    bool __BoolProperty_29;                                                           // 0x0068 (size: 0x1)
    float __FloatProperty_30;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_31;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_34;                                                         // 0x007C (size: 0x4)
    bool __BoolProperty_35;                                                           // 0x0080 (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x0081 (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x0082 (size: 0x1)
    uint8 __ByteProperty_38;                                                          // 0x0083 (size: 0x1)
    bool __BoolProperty_39;                                                           // 0x0084 (size: 0x1)
    float __FloatProperty_40;                                                         // 0x0088 (size: 0x4)
    uint8 __ByteProperty_41;                                                          // 0x008C (size: 0x1)
    uint8 __ByteProperty_42;                                                          // 0x008D (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x008E (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x008F (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x0090 (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x0091 (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x0092 (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x0093 (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x0096 (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x0097 (size: 0x1)
    float __FloatProperty_53;                                                         // 0x0098 (size: 0x4)
    bool __BoolProperty_54;                                                           // 0x009C (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x009D (size: 0x1)
    bool __BoolProperty_56;                                                           // 0x009E (size: 0x1)
    bool __BoolProperty_57;                                                           // 0x009F (size: 0x1)
    bool __BoolProperty_58;                                                           // 0x00A0 (size: 0x1)
    float __FloatProperty_59;                                                         // 0x00A4 (size: 0x4)
    float __FloatProperty_60;                                                         // 0x00A8 (size: 0x4)

}; // Size: 0xAC

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0388 (size: 0xAC)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0438 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0440 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0448 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0468 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x04B0 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0590 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0698 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0760 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x07A8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0888 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08B0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x09B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x09E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0A08 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0A30 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x0A78 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x0AC0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0B08 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x0B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x0B78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x0BA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x0BE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x0C08 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x0C50 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0C98 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x0D08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x0D28 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x0DF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x0E38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x0E80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0EF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x0F18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x0F60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x0F80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x0FC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x0FE8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x10B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x10F8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x11D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x1200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x1228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x1250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x1278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x12A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x12C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x12F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x1318 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x1360 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x1380 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x13C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x13E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x1430 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x1450 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x1498 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x14B8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x1580 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x15C8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x1638 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x1660 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x16A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x16C8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x1710 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1758 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x1780 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x17A0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x1868 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x1890 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x18B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x1900 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1948 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1990 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x19B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x19F8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x1A40 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x1AB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x1AD0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1B98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1BC0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x1BE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1C30 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1C50 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1CC0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x1CE0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1DA8 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x1E88 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1ED0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1EF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x1F20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1F68 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1F88 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1FF8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x2018 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x20E0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2128 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2230 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x2258 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x22A0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x22C8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x23D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x23F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x2420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x2448 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x2470 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x24B8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x24D8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x2548 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x2590 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x2600 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x2620 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x26E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x2730 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2778 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x27E8 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x2858 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x28A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x28C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x28F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2938 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2958 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x29C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x29E8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2C18 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x2C40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x2C60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x2CA8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x2CC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2D10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2D30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2D78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x2D98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2DE0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2E00 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2E28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2E48 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2F10 (size: 0xD0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x2FE0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3028 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x3108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x3130 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x3158 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x3180 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x31A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x31D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x31F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3220 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x3248 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x3290 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x32B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x32F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x3318 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x3360 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x3380 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x33C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x33E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3430 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x3450 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3518 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3540 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3620 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3648 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3670 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3698 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x36C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x36E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3760 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x3788 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x37D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x37F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x3838 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x3858 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x38A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x38C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3908 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x3928 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x3970 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3990 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3A58 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3B60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3B88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3BB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3C00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3C28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3C50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3C78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x3CA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3CE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3D50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3D70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3DB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3DD8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3F68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x3F90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3FD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3FF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x4040 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x4060 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x4088 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x40D0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x40F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x4118 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x41B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x41E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x42A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x42D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x4318 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x4338 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x4380 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x43A0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4410 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x4430 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x44A0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x44C0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4530 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x4550 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x4598 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x45E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x4628 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4648 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x46B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x46D8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x47A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x47C0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x48B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x48D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4920 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x4940 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4988 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x49A8 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4A70 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x4B88 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4BF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4C20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4C68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4C88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4CD0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x4CF0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x4DB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4E00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4E28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x4E50 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x4E98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4EE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x4F28 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4F70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4FB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x4FD8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x5020 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x5068 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x50D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x50F8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x51C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x5208 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x5250 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x5298 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x52E0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x5328 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x5370 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x53B8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5400 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x5448 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x5490 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x54D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5520 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x5540 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x5608 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x56E8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5710 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5758 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x57A0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x57C8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5838 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x5860 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x58A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x58C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x5910 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5958 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x59A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x59C0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5A88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5AB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x5AD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5B20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5B40 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x5B88 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x5BD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5C18 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5C38 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5D00 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5D48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5D70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5D98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x5DE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5E00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5E48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5E90 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5ED8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5F20 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x5F90 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x5FB0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x6078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x60A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x60C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x6110 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x6130 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x6178 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x61C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6208 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x6228 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x62F0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x6338 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6418 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x6460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x6488 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x64B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x64F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x6518 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x6560 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x65A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x65F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x6610 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x66D8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6748 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x6770 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x67B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x67D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6820 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x6868 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x68B0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x68D0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x6998 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x6A78 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x6AA0 (size: 0x70)
    double UpperBodySpeedReference;                                                   // 0x6B10 (size: 0x8)
    double deltaT;                                                                    // 0x6B18 (size: 0x8)
    double PulseSumTime;                                                              // 0x6B20 (size: 0x8)
    double staticYaw;                                                                 // 0x6B28 (size: 0x8)
    double deltaYaw;                                                                  // 0x6B30 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x6B38 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x6B39 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x6B40 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
