#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1895;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_1896;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_1897;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_1898;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_1899;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_1900;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_1901;                                                       // 0x0058 (size: 0x4)
    TArray<float> __ArrayProperty_1902;                                               // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_1903;                                               // 0x0070 (size: 0x10)
    FName __NameProperty_1904;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_1905;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_1906;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_1907;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_1908;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_1909;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_1910;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_1911;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_1912;                                                        // 0x00C0 (size: 0x8)
    FName __NameProperty_1913;                                                        // 0x00C8 (size: 0x8)
    FName __NameProperty_1914;                                                        // 0x00D0 (size: 0x8)
    float __FloatProperty_1915;                                                       // 0x00D8 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1916;                            // 0x00DC (size: 0x1)
    FName __NameProperty_1917;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_1918;                                                        // 0x00E8 (size: 0x8)
    float __FloatProperty_1919;                                                       // 0x00F0 (size: 0x4)
    FName __NameProperty_1920;                                                        // 0x00F4 (size: 0x8)
    FName __NameProperty_1921;                                                        // 0x00FC (size: 0x8)
    FName __NameProperty_1922;                                                        // 0x0104 (size: 0x8)
    int32 __IntProperty_1923;                                                         // 0x010C (size: 0x4)
    FName __NameProperty_1924;                                                        // 0x0110 (size: 0x8)
    int32 __IntProperty_1925;                                                         // 0x0118 (size: 0x4)
    FName __NameProperty_1926;                                                        // 0x011C (size: 0x8)
    int32 __IntProperty_1927;                                                         // 0x0124 (size: 0x4)
    FName __NameProperty_1928;                                                        // 0x0128 (size: 0x8)
    int32 __IntProperty_1929;                                                         // 0x0130 (size: 0x4)
    FName __NameProperty_1930;                                                        // 0x0134 (size: 0x8)
    int32 __IntProperty_1931;                                                         // 0x013C (size: 0x4)
    FName __NameProperty_1932;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_1933;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_1934;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_1935;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_1936;                                                        // 0x0160 (size: 0x8)
    TArray<float> __ArrayProperty_1937;                                               // 0x0168 (size: 0x10)
    TArray<int32> __ArrayProperty_1938;                                               // 0x0178 (size: 0x10)
    FName __NameProperty_1939;                                                        // 0x0188 (size: 0x8)
    int32 __IntProperty_1940;                                                         // 0x0190 (size: 0x4)
    bool __BoolProperty_1941;                                                         // 0x0194 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1942;                                              // 0x0195 (size: 0x1)
    FName __NameProperty_1943;                                                        // 0x0198 (size: 0x8)
    FName __NameProperty_1944;                                                        // 0x01A0 (size: 0x8)
    FInputScaleBiasClampConstants __StructProperty_1945;                              // 0x01A8 (size: 0x2C)
    float __FloatProperty_1946;                                                       // 0x01D4 (size: 0x4)
    float __FloatProperty_1947;                                                       // 0x01D8 (size: 0x4)
    EAnimSyncMethod __EnumProperty_1948;                                              // 0x01DC (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1949;                            // 0x01DD (size: 0x1)
    class UBlendProfile* __BlendProfile_1950;                                         // 0x01E0 (size: 0x8)
    class UCurveFloat* __CurveFloat_1951;                                             // 0x01E8 (size: 0x8)
    bool __BoolProperty_1952;                                                         // 0x01F0 (size: 0x1)
    EAlphaBlendOption __EnumProperty_1953;                                            // 0x01F1 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1954;                                     // 0x01F2 (size: 0x1)
    TArray<float> __ArrayProperty_1955;                                               // 0x01F8 (size: 0x10)
    FName __NameProperty_1956;                                                        // 0x0208 (size: 0x8)
    FName __NameProperty_1957;                                                        // 0x0210 (size: 0x8)
    int32 __IntProperty_1958;                                                         // 0x0218 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1959;                                       // 0x0220 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0240 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02C0 (size: 0x18)

}; // Size: 0x2D8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_7;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_9;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0018 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_12;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_15;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    bool __BoolProperty_17;                                                           // 0x0034 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0044 (size: 0x4)
    bool __BoolProperty_22;                                                           // 0x0048 (size: 0x1)
    float __FloatProperty_23;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x006C (size: 0x4)
    bool __BoolProperty_32;                                                           // 0x0070 (size: 0x1)
    float __FloatProperty_33;                                                         // 0x0074 (size: 0x4)
    bool __BoolProperty_34;                                                           // 0x0078 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x0079 (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x007A (size: 0x1)
    uint8 __ByteProperty_37;                                                          // 0x007B (size: 0x1)
    bool __BoolProperty_38;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_39;                                                         // 0x0080 (size: 0x4)
    bool __BoolProperty_40;                                                           // 0x0084 (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x0085 (size: 0x1)
    bool __BoolProperty_42;                                                           // 0x0086 (size: 0x1)

}; // Size: 0x87

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x88)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0420 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0428 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0430 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0450 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x0498 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0578 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0680 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0748 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x0790 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0870 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0898 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x09A0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x09C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x09F0 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x0A18 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x0A60 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x0AA8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0AF0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x0B38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x0B60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x0B88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x0BD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x0BF0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x0C38 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x0C80 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x0CF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x0D10 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x0DD8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x0E20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x0E68 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x0EB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x0ED8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x0F00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x0F48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x0F68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x0FB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x0FD0 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x1098 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x10E0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x11C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x11E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1210 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1238 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1260 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x12B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x12D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x1300 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1348 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x1368 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x13B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x13D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x1418 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x1438 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x1480 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x14A0 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x1568 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x15B0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x15F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x1620 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x1648 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x1690 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x16B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x16F8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1740 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x1768 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x1788 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x1850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x1878 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x18A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x18E8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1930 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x1978 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x1998 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x19E0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1A28 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x1A98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x1AB8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x1B80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x1BA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x1BD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x1C18 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x1C38 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x1CA8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x1CC8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1D90 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x1E70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x1E98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x1EC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x1F08 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x1F28 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x1F98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x1FB8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x2080 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x20C8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x21D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x21F8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2240 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2268 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2370 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x23C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x23E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x2410 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x2458 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2478 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x24E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2530 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x25A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x25C0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x26B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x26D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x2720 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x2740 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x2788 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x27D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x2818 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x2838 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x2900 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2948 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x29B8 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x2A28 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2A70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2A98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x2AC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x2B08 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x2B28 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x2B98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x2BB8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x2CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x2CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x2CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x2D20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x2D48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x2D70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x2D98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x2DC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x2DE8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x2E10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x2E30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x2E78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x2E98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x2EE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x2F00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x2F48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x2F68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x2FB0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x2FD0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x2FF8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x3018 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x30E0 (size: 0xD0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x31B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x31D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x3200 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3248 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x3268 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x32B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x32F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3340 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x3360 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x3428 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3508 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3530 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3558 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x3580 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x35A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x35D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x35F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3620 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x3648 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3690 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x36B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x36F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x3718 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x3760 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x3780 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x37C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x37E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x3830 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x3850 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3918 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x3940 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3A20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3A48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3A70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3A98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3AE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x3B10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x3B38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x3B60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x3B88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x3BD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x3BF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x3C38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x3C58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x3CA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x3CC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x3D08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x3D28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x3D70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x3D90 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3E58 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3F60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3F88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3FB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x3FD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4000 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4028 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4050 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x4078 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x40A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x40E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x4108 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4150 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x4170 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x41B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x41D8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x42A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x42C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x42F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4318 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x4340 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4368 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x4390 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x43D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x43F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4440 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4460 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x4488 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x44D0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x44F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x4590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x45B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x45E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x4608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x4630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x4658 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x4680 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x46A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x46D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x4718 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x4738 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x4780 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x47A0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x4810 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4830 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x48A0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x48C0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x4930 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x4950 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x4998 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x49B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x4A28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x4A48 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x4B10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x4B30 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x4BF8 (size: 0x48)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x4C40 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x4D58 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x4DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x4DC8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x4DF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x4E38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x4E58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x4EA0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x4EC0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x4F88 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x4FD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x4FF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x5020 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x5068 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x50B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x50F8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x5140 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x5188 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x51A8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x51F0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5238 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x52A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x52C8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x5390 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x53D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x5420 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x5468 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x54B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x54F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x5540 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x5588 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x55A8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x5670 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x5750 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5778 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x57C0 (size: 0x28)
    double UpperBodySpeedReference;                                                   // 0x57E8 (size: 0x8)
    double deltaT;                                                                    // 0x57F0 (size: 0x8)
    double PulseSumTime;                                                              // 0x57F8 (size: 0x8)
    double staticYaw;                                                                 // 0x5800 (size: 0x8)
    double deltaYaw;                                                                  // 0x5808 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x5810 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x5811 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x5818 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
