#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_3554;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_3555;                                                        // 0x000C (size: 0x8)
    TArray<int32> __ArrayProperty_3556;                                               // 0x0018 (size: 0x10)
    class UMirrorDataTable* __MirrorDataTable_3557;                                   // 0x0028 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3558;                                 // 0x0030 (size: 0x8)
    FInputScaleBiasClampConstants __StructProperty_3559;                              // 0x0038 (size: 0x2C)
    class UAnimSequenceBase* __AnimSequenceBase_3560;                                 // 0x0068 (size: 0x8)
    TArray<float> __ArrayProperty_3561;                                               // 0x0070 (size: 0x10)
    TArray<int32> __ArrayProperty_3562;                                               // 0x0080 (size: 0x10)
    FName __NameProperty_3563;                                                        // 0x0090 (size: 0x8)
    float __FloatProperty_3564;                                                       // 0x0098 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3565;                                 // 0x00A0 (size: 0x8)
    float __FloatProperty_3566;                                                       // 0x00A8 (size: 0x4)
    TArray<int32> __ArrayProperty_3567;                                               // 0x00B0 (size: 0x10)
    FName __NameProperty_3568;                                                        // 0x00C0 (size: 0x8)
    float __FloatProperty_3569;                                                       // 0x00C8 (size: 0x4)
    FName __NameProperty_3570;                                                        // 0x00CC (size: 0x8)
    FName __NameProperty_3571;                                                        // 0x00D4 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3572;                                 // 0x00E0 (size: 0x8)
    FName __NameProperty_3573;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_3574;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_3575;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_3576;                                                        // 0x0100 (size: 0x8)
    FName __NameProperty_3577;                                                        // 0x0108 (size: 0x8)
    FName __NameProperty_3578;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_3579;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_3580;                                                        // 0x0120 (size: 0x8)
    FName __NameProperty_3581;                                                        // 0x0128 (size: 0x8)
    FName __NameProperty_3582;                                                        // 0x0130 (size: 0x8)
    FName __NameProperty_3583;                                                        // 0x0138 (size: 0x8)
    float __FloatProperty_3584;                                                       // 0x0140 (size: 0x4)
    FName __NameProperty_3585;                                                        // 0x0144 (size: 0x8)
    FName __NameProperty_3586;                                                        // 0x014C (size: 0x8)
    FName __NameProperty_3587;                                                        // 0x0154 (size: 0x8)
    int32 __IntProperty_3588;                                                         // 0x015C (size: 0x4)
    FName __NameProperty_3589;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_3590;                                                        // 0x0168 (size: 0x8)
    FName __NameProperty_3591;                                                        // 0x0170 (size: 0x8)
    FName __NameProperty_3592;                                                        // 0x0178 (size: 0x8)
    FName __NameProperty_3593;                                                        // 0x0180 (size: 0x8)
    FName __NameProperty_3594;                                                        // 0x0188 (size: 0x8)
    FName __NameProperty_3595;                                                        // 0x0190 (size: 0x8)
    FName __NameProperty_3596;                                                        // 0x0198 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3597;                                 // 0x01A0 (size: 0x8)
    FName __NameProperty_3598;                                                        // 0x01A8 (size: 0x8)
    int32 __IntProperty_3599;                                                         // 0x01B0 (size: 0x4)
    int32 __IntProperty_3600;                                                         // 0x01B4 (size: 0x4)
    FName __NameProperty_3601;                                                        // 0x01B8 (size: 0x8)
    float __FloatProperty_3602;                                                       // 0x01C0 (size: 0x4)
    FName __NameProperty_3603;                                                        // 0x01C4 (size: 0x8)
    FName __NameProperty_3604;                                                        // 0x01CC (size: 0x8)
    TArray<int32> __ArrayProperty_3605;                                               // 0x01D8 (size: 0x10)
    TArray<float> __ArrayProperty_3606;                                               // 0x01E8 (size: 0x10)
    TArray<int32> __ArrayProperty_3607;                                               // 0x01F8 (size: 0x10)
    TArray<int32> __ArrayProperty_3608;                                               // 0x0208 (size: 0x10)
    FName __NameProperty_3609;                                                        // 0x0218 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3610;                                 // 0x0220 (size: 0x8)
    float __FloatProperty_3611;                                                       // 0x0228 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3612;                                 // 0x0230 (size: 0x8)
    FName __NameProperty_3613;                                                        // 0x0238 (size: 0x8)
    TArray<float> __ArrayProperty_3614;                                               // 0x0240 (size: 0x10)
    TArray<float> __ArrayProperty_3615;                                               // 0x0250 (size: 0x10)
    FName __NameProperty_3616;                                                        // 0x0260 (size: 0x8)
    float __FloatProperty_3617;                                                       // 0x0268 (size: 0x4)
    FName __NameProperty_3618;                                                        // 0x026C (size: 0x8)
    float __FloatProperty_3619;                                                       // 0x0274 (size: 0x4)
    TArray<float> __ArrayProperty_3620;                                               // 0x0278 (size: 0x10)
    TArray<float> __ArrayProperty_3621;                                               // 0x0288 (size: 0x10)
    FName __NameProperty_3622;                                                        // 0x0298 (size: 0x8)
    FName __NameProperty_3623;                                                        // 0x02A0 (size: 0x8)
    FName __NameProperty_3624;                                                        // 0x02A8 (size: 0x8)
    FName __NameProperty_3625;                                                        // 0x02B0 (size: 0x8)
    FName __NameProperty_3626;                                                        // 0x02B8 (size: 0x8)
    FName __NameProperty_3627;                                                        // 0x02C0 (size: 0x8)
    FName __NameProperty_3628;                                                        // 0x02C8 (size: 0x8)
    FName __NameProperty_3629;                                                        // 0x02D0 (size: 0x8)
    float __FloatProperty_3630;                                                       // 0x02D8 (size: 0x4)
    FName __NameProperty_3631;                                                        // 0x02DC (size: 0x8)
    float __FloatProperty_3632;                                                       // 0x02E4 (size: 0x4)
    EAnimSyncMethod __EnumProperty_3633;                                              // 0x02E8 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_3634;                            // 0x02E9 (size: 0x1)
    FName __NameProperty_3635;                                                        // 0x02EC (size: 0x8)
    FName __NameProperty_3636;                                                        // 0x02F4 (size: 0x8)
    FName __NameProperty_3637;                                                        // 0x02FC (size: 0x8)
    FName __NameProperty_3638;                                                        // 0x0304 (size: 0x8)
    class UBlendProfile* __BlendProfile_3639;                                         // 0x0310 (size: 0x8)
    class UCurveFloat* __CurveFloat_3640;                                             // 0x0318 (size: 0x8)
    EAlphaBlendOption __EnumProperty_3641;                                            // 0x0320 (size: 0x1)
    EBlendListTransitionType __EnumProperty_3642;                                     // 0x0321 (size: 0x1)
    TArray<float> __ArrayProperty_3643;                                               // 0x0328 (size: 0x10)
    FName __NameProperty_3644;                                                        // 0x0338 (size: 0x8)
    int32 __IntProperty_3645;                                                         // 0x0340 (size: 0x4)
    FName __NameProperty_3646;                                                        // 0x0344 (size: 0x8)
    int32 __IntProperty_3647;                                                         // 0x034C (size: 0x4)
    float __FloatProperty_3648;                                                       // 0x0350 (size: 0x4)
    float __FloatProperty_3649;                                                       // 0x0354 (size: 0x4)
    FName __NameProperty_3650;                                                        // 0x0358 (size: 0x8)
    int32 __IntProperty_3651;                                                         // 0x0360 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_3652;                              // 0x0364 (size: 0x2C)
    float __FloatProperty_3653;                                                       // 0x0390 (size: 0x4)
    FName __NameProperty_3654;                                                        // 0x0394 (size: 0x8)
    int32 __IntProperty_3655;                                                         // 0x039C (size: 0x4)
    float __FloatProperty_3656;                                                       // 0x03A0 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_3657;                       // 0x03A4 (size: 0x1)
    bool __BoolProperty_3658;                                                         // 0x03A5 (size: 0x1)
    float __FloatProperty_3659;                                                       // 0x03A8 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_3660;                                 // 0x03B0 (size: 0x8)
    bool __BoolProperty_3661;                                                         // 0x03B8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_3662;                                              // 0x03B9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_3663;                            // 0x03BA (size: 0x1)
    FName __NameProperty_3664;                                                        // 0x03BC (size: 0x8)
    FName __NameProperty_3665;                                                        // 0x03C4 (size: 0x8)
    int32 __IntProperty_3666;                                                         // 0x03CC (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_3667;                                       // 0x03D0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x03F0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0470 (size: 0x18)

}; // Size: 0x488

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0004 (size: 0x1)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_5;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0014 (size: 0x4)
    uint8 __ByteProperty_7;                                                           // 0x0018 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0019 (size: 0x1)
    uint8 __ByteProperty_9;                                                           // 0x001A (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x001B (size: 0x1)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0020 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    uint8 __ByteProperty_14;                                                          // 0x0028 (size: 0x1)
    float __FloatProperty_15;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    bool __BoolProperty_17;                                                           // 0x0034 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x006C (size: 0x4)
    bool __BoolProperty_32;                                                           // 0x0070 (size: 0x1)
    float __FloatProperty_33;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_34;                                                         // 0x0078 (size: 0x4)
    bool __BoolProperty_35;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_36;                                                         // 0x0080 (size: 0x4)
    bool __BoolProperty_37;                                                           // 0x0084 (size: 0x1)
    bool __BoolProperty_38;                                                           // 0x0085 (size: 0x1)
    uint8 __ByteProperty_39;                                                          // 0x0086 (size: 0x1)
    bool __BoolProperty_40;                                                           // 0x0087 (size: 0x1)
    float __FloatProperty_41;                                                         // 0x0088 (size: 0x4)
    uint8 __ByteProperty_42;                                                          // 0x008C (size: 0x1)
    uint8 __ByteProperty_43;                                                          // 0x008D (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x008E (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x008F (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x0090 (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x0091 (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x0092 (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x0093 (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_52;                                                           // 0x0096 (size: 0x1)
    bool __BoolProperty_53;                                                           // 0x0097 (size: 0x1)
    bool __BoolProperty_54;                                                           // 0x0098 (size: 0x1)
    float __FloatProperty_55;                                                         // 0x009C (size: 0x4)
    bool __BoolProperty_56;                                                           // 0x00A0 (size: 0x1)
    bool __BoolProperty_57;                                                           // 0x00A1 (size: 0x1)
    bool __BoolProperty_58;                                                           // 0x00A2 (size: 0x1)
    bool __BoolProperty_59;                                                           // 0x00A3 (size: 0x1)
    bool __BoolProperty_60;                                                           // 0x00A4 (size: 0x1)
    float __FloatProperty_61;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_62;                                                         // 0x00AC (size: 0x4)
    bool __BoolProperty_63;                                                           // 0x00B0 (size: 0x1)
    float __FloatProperty_64;                                                         // 0x00B4 (size: 0x4)
    bool __BoolProperty_65;                                                           // 0x00B8 (size: 0x1)
    bool __BoolProperty_66;                                                           // 0x00B9 (size: 0x1)
    float __FloatProperty_67;                                                         // 0x00BC (size: 0x4)
    float __FloatProperty_68;                                                         // 0x00C0 (size: 0x4)
    float __FloatProperty_69;                                                         // 0x00C4 (size: 0x4)
    float __FloatProperty_70;                                                         // 0x00C8 (size: 0x4)
    bool __BoolProperty_71;                                                           // 0x00CC (size: 0x1)
    float __FloatProperty_72;                                                         // 0x00D0 (size: 0x4)
    float __FloatProperty_73;                                                         // 0x00D4 (size: 0x4)
    bool __BoolProperty_74;                                                           // 0x00D8 (size: 0x1)

}; // Size: 0xD9

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03D0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03D8 (size: 0xDC)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x04B8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x04C0 (size: 0x8)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x04C8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x0510 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x05F0 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x06F8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x07C0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_160;                    // 0x0808 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_159;                    // 0x0830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_158;                    // 0x0858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_157;                    // 0x0880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_156;                    // 0x08A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_155;                    // 0x08D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_154;                    // 0x08F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_153;                    // 0x0920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_152;                    // 0x0948 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_151;                    // 0x0970 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_150;                    // 0x0998 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_149;                    // 0x09C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121;                        // 0x09E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_113;                              // 0x0A30 (size: 0x20)
    FAnimNode_Mirror AnimGraphNode_Mirror_1;                                          // 0x0A50 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120;                        // 0x0A98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_112;                              // 0x0AE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119;                        // 0x0B00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_111;                              // 0x0B48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118;                        // 0x0B68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_110;                              // 0x0BB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117;                        // 0x0BD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_109;                              // 0x0C18 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x0C38 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_108;                              // 0x0C78 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_33;                             // 0x0C98 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x0D60 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x0E40 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0E68 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0F70 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0F98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0FC0 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0FE8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116;                        // 0x1030 (size: 0x48)
    FAnimNode_Mirror AnimGraphNode_Mirror;                                            // 0x1078 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x10C0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_148;                    // 0x1108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_147;                    // 0x1130 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115;                        // 0x1158 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31;                       // 0x11A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114;                        // 0x11E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_107;                              // 0x1230 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x1250 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30;                       // 0x1290 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113;                        // 0x12D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29;                       // 0x1320 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16;                     // 0x1368 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_106;                              // 0x13D8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_32;                             // 0x13F8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112;                        // 0x14C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111;                        // 0x1508 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110;                        // 0x1550 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_146;                    // 0x1598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_145;                    // 0x15C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_144;                    // 0x15E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_143;                    // 0x1610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_142;                    // 0x1638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_141;                    // 0x1660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_140;                    // 0x1688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_139;                    // 0x16B0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x16D8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_105;                              // 0x1718 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109;                        // 0x1738 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_104;                              // 0x1780 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108;                        // 0x17A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_103;                              // 0x17E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107;                        // 0x1808 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_102;                              // 0x1850 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106;                        // 0x1870 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_101;                              // 0x18B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_31;                             // 0x18D8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x19A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x19E8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_138;                    // 0x1AC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_137;                    // 0x1AF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_136;                    // 0x1B18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_135;                    // 0x1B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_134;                    // 0x1B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_133;                    // 0x1B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_132;                    // 0x1BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_131;                    // 0x1BE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105;                        // 0x1C08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_100;                              // 0x1C50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104;                        // 0x1C70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_99;                               // 0x1CB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103;                        // 0x1CD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_98;                               // 0x1D20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102;                        // 0x1D40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_97;                               // 0x1D88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_30;                             // 0x1DA8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1E70 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_130;                    // 0x1EB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129;                    // 0x1EE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101;                        // 0x1F08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_96;                               // 0x1F50 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x1F70 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x1FB0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x1FF8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_95;                               // 0x2020 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_29;                             // 0x2040 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_128;                    // 0x2108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127;                    // 0x2130 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100;                        // 0x2158 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99;                         // 0x21A0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x21E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_94;                               // 0x2230 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98;                         // 0x2250 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x2298 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x22E0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_93;                               // 0x2350 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_28;                             // 0x2370 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126;                    // 0x2438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125;                    // 0x2460 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97;                         // 0x2488 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_92;                               // 0x24D0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x24F0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_91;                               // 0x2560 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_27;                             // 0x2580 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x2648 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124;                    // 0x2728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123;                    // 0x2750 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122;                    // 0x2778 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121;                    // 0x27A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120;                    // 0x27C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119;                    // 0x27F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118;                    // 0x2818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117;                    // 0x2840 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96;                         // 0x2868 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_90;                               // 0x28B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95;                         // 0x28D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_89;                               // 0x2918 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94;                         // 0x2938 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_88;                               // 0x2980 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x29A0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_87;                               // 0x29E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_26;                             // 0x2A00 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116;                    // 0x2AC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115;                    // 0x2AF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93;                         // 0x2B18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_86;                               // 0x2B60 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x2B80 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_85;                               // 0x2BF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_25;                             // 0x2C10 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x2CD8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2D20 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2E28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92;                         // 0x2E50 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2E98 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2EC0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2FC8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2FF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114;                    // 0x3018 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113;                    // 0x3040 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91;                         // 0x3068 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_84;                               // 0x30B0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x30D0 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x3140 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x3188 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_83;                               // 0x31F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_24;                             // 0x3218 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112;                    // 0x32E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111;                    // 0x3308 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110;                    // 0x3330 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109;                    // 0x3358 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108;                    // 0x3380 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107;                    // 0x33A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106;                    // 0x33D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105;                    // 0x33F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90;                         // 0x3420 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_82;                               // 0x3468 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89;                         // 0x3488 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_81;                               // 0x34D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88;                         // 0x34F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_80;                               // 0x3538 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x3558 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_79;                               // 0x3598 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x35B8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87;                         // 0x3680 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x36C8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x3738 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86;                         // 0x37A8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104;                    // 0x37F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103;                    // 0x3818 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85;                         // 0x3840 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_78;                               // 0x3888 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x38A8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_77;                               // 0x3918 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x3938 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102;                    // 0x3A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101;                    // 0x3A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100;                    // 0x3A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99;                     // 0x3A78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98;                     // 0x3AA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97;                     // 0x3AC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96;                     // 0x3AF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95;                     // 0x3B18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94;                     // 0x3B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0x3B68 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_76;                               // 0x3B90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x3BB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_75;                               // 0x3BF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x3C18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_74;                               // 0x3C60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x3C80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_73;                               // 0x3CC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x3CE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_72;                               // 0x3D30 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x3D50 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_71;                               // 0x3D78 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x3D98 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3E60 (size: 0xD0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3F30 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x4010 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x4038 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x4060 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x4088 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x40B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x40D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x4100 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x4128 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x4150 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_70;                               // 0x4198 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x41B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_69;                               // 0x4200 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x4220 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_68;                               // 0x4268 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x4288 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_67;                               // 0x42D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x42F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x4338 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x4358 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x4420 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x4448 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x4528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x4550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x4578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x45A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x45C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x45F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x4618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x4640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x4668 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x4690 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x46D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x46F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x4740 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x4760 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x47A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x47C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x4810 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x4830 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x4878 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x4898 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4960 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x4A68 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x4A90 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x4AB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x4AE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x4B08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x4B30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x4B58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x4B80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x4BA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x4BF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x4C10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x4C58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x4C78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x4CC0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x4CE0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x4DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x4DD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x4DF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x4E20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x4E48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x4E70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x4E98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x4EE0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x4F00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x4F48 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x4F68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x4F90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x4FD8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x4FF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x5020 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x5048 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x5070 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x5098 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x50C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x50E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x5110 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x5138 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x5160 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x5188 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x51F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x5218 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x5260 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x5280 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x52C8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x52E8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x5358 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x5378 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x53E8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x5408 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x5478 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x5498 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x54E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x5528 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x5570 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x5590 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x5600 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x5620 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x56E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x5708 (size: 0xC8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x57D0 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x57F0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x5838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x5860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x5888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x58B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x58D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x5900 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x5928 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x5950 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x5978 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x59A0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x59C8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x5A08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x5A28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x5A70 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x5A90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x5AD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x5AF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x5B40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x5B60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x5BA8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x5BC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x5C10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x5C30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x5C78 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x5C98 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x5D60 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x5DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x5DD0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x5DF8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x5E40 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x5E88 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x5ED0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x5F18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x5F60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x5F80 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x5FC8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x6010 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x6080 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x60A0 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x6168 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x61B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x61F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x6240 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x6288 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x62D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x6318 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x6360 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x63A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x63F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x6438 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x6480 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x64C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x64E8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x65B0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x6690 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x66B8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x6700 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x6728 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x6770 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x6798 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x67C0 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x6800 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x6848 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x6890 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x68B0 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x68F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x6938 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x6980 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x69C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x6A10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x6A30 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x6AF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x6B20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x6B48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x6B90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x6BB0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x6BF8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x6C40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x6C88 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x6CA8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x6D70 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x6DB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x6DE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x6E08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x6E50 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x6E70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x6EB8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x6F00 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x6F48 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x6F90 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x7000 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x7020 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x70E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x7110 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x7138 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x7180 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x71A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x71E8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x7230 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x7278 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x7298 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x7360 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x73A8 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x7488 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x74D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x74F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x7520 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x7568 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x7588 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x75D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x7618 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x7660 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x7680 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x7748 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x7790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x77B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x77E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x7828 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x7848 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x7890 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x78D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x7920 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x7940 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x7A08 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x7AE8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x7B10 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x7B80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x7BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x7BF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x7C18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x7C60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x7C80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x7CC8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x7CE8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x7DB0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x7DF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x7E40 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x7E88 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x7EB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x7EF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x7F18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x7F60 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x7F80 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x8048 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x8090 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x80B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x80E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x8108 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x8130 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x8158 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x8180 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x81C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x81E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x8230 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x8250 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x8298 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x82B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x8300 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x8320 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x83E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x8410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x8438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x8460 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x8488 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x84D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x84F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x8538 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x8558 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x85A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x85C0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x8688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x86B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x86D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x8700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x8728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x8750 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x8778 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x87C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x87E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x8828 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x8848 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x8890 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x88B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x88F8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x8918 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x89E0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x8A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x8A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x8A78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x8AA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x8AC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x8AF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x8B18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x8B60 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x8B80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x8BC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x8BE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x8C30 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x8C50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x8C98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x8CB8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x8D80 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x8DC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x8DF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x8E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x8E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x8E68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x8E90 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x8EB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x8F00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x8F20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x8F68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x8F88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x8FD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x8FF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x9038 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x9058 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x9098 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x90B8 (size: 0xC8)
    double PulseSumTime;                                                              // 0x9180 (size: 0x8)
    double staticYaw;                                                                 // 0x9188 (size: 0x8)
    double deltaYaw;                                                                  // 0x9190 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x9198 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x9199 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x91A0 (size: 0x18)
    double HelmsmanInput;                                                             // 0x91B8 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_433248044F1B6C1BD8AAC5B89FF32CD3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_BCDDDCE4445F65FDED2DEAB2E861558E();
    void AnimNotify_reset_turnLvar();
    void AnimNotify_reset_turnRvar();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_0BECB29F428E4481A01449BECCED4F0C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_D5D0C9C8414736B574D740AB03A95A5A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_E8597FD147B6FE7B94E54C8C17268B18();
