#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1239;                            // 0x0001 (size: 0x1)
    TArray<float> __ArrayProperty_1240;                                               // 0x0008 (size: 0x10)
    TArray<int32> __ArrayProperty_1241;                                               // 0x0018 (size: 0x10)
    FName __NameProperty_1242;                                                        // 0x0028 (size: 0x8)
    float __FloatProperty_1243;                                                       // 0x0030 (size: 0x4)
    TArray<float> __ArrayProperty_1244;                                               // 0x0038 (size: 0x10)
    TArray<int32> __ArrayProperty_1245;                                               // 0x0048 (size: 0x10)
    FName __NameProperty_1246;                                                        // 0x0058 (size: 0x8)
    TArray<float> __ArrayProperty_1247;                                               // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_1248;                                               // 0x0070 (size: 0x10)
    float __FloatProperty_1249;                                                       // 0x0080 (size: 0x4)
    class UBlendProfile* __BlendProfile_1250;                                         // 0x0088 (size: 0x8)
    class UCurveFloat* __CurveFloat_1251;                                             // 0x0090 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1252;                                            // 0x0098 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1253;                                     // 0x0099 (size: 0x1)
    TArray<float> __ArrayProperty_1254;                                               // 0x00A0 (size: 0x10)
    TArray<int32> __ArrayProperty_1255;                                               // 0x00B0 (size: 0x10)
    float __FloatProperty_1256;                                                       // 0x00C0 (size: 0x4)
    FName __NameProperty_1257;                                                        // 0x00C4 (size: 0x8)
    EAnimSyncMethod __EnumProperty_1258;                                              // 0x00CC (size: 0x1)
    FName __NameProperty_1259;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_1260;                                                        // 0x00D8 (size: 0x8)
    FName __NameProperty_1261;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_1262;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_1263;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_1264;                                                        // 0x00F8 (size: 0x8)
    int32 __IntProperty_1265;                                                         // 0x0100 (size: 0x4)
    FName __NameProperty_1266;                                                        // 0x0104 (size: 0x8)
    int32 __IntProperty_1267;                                                         // 0x010C (size: 0x4)
    FName __NameProperty_1268;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_1269;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_1270;                                                        // 0x0120 (size: 0x8)
    FName __NameProperty_1271;                                                        // 0x0128 (size: 0x8)
    int32 __IntProperty_1272;                                                         // 0x0130 (size: 0x4)
    FName __NameProperty_1273;                                                        // 0x0134 (size: 0x8)
    int32 __IntProperty_1274;                                                         // 0x013C (size: 0x4)
    FName __NameProperty_1275;                                                        // 0x0140 (size: 0x8)
    int32 __IntProperty_1276;                                                         // 0x0148 (size: 0x4)
    FName __NameProperty_1277;                                                        // 0x014C (size: 0x8)
    int32 __IntProperty_1278;                                                         // 0x0154 (size: 0x4)
    bool __BoolProperty_1279;                                                         // 0x0158 (size: 0x1)
    float __FloatProperty_1280;                                                       // 0x015C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1281;                              // 0x0160 (size: 0x2C)
    float __FloatProperty_1282;                                                       // 0x018C (size: 0x4)
    bool __BoolProperty_1283;                                                         // 0x0190 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1284;                                              // 0x0191 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1285;                            // 0x0192 (size: 0x1)
    FName __NameProperty_1286;                                                        // 0x0194 (size: 0x8)
    FName __NameProperty_1287;                                                        // 0x019C (size: 0x8)
    int32 __IntProperty_1288;                                                         // 0x01A4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1289;                                       // 0x01A8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01C8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0248 (size: 0x18)

}; // Size: 0x260

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x001C (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x001D (size: 0x1)
    float __FloatProperty_7;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0028 (size: 0x4)
    uint8 __ByteProperty_10;                                                          // 0x002C (size: 0x1)
    float __FloatProperty_11;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0044 (size: 0x4)

}; // Size: 0x48

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x48)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03E0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03E8 (size: 0x8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x03F0 (size: 0x70)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0460 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x04A8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0588 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0690 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0758 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x07A0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x07C8 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x08A8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08D0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x09D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x0A00 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x0A28 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x0A50 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x0A98 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0AE0 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0B00 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x0B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x0B70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x0B98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x0BE0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x0C00 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x0C70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x0C90 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x0D58 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x0DA0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x0DE8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x0E30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x0E58 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x0E80 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x0EC8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x0EE8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x0F30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x0F50 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1018 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1060 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x1140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x1168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x1190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x11B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x11E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x1208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x1230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x1258 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x1280 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x12C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x12E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x1330 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x1350 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x1398 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x13B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x1400 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x1420 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x14E8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1530 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x1578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x15A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x15C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x15F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x1618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x1640 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x1668 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x16B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x16D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x1718 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x1738 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x1760 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x1780 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1848 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x1898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x18C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x18E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1910 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x1938 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x1980 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x19A0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x19E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x1A30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x1A78 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x1A98 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x1B08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x1B28 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x1C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x1C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x1C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x1C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x1CB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x1CE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x1D28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x1D48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x1D90 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x1DB0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1E20 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x1E40 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1F08 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x1FE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x2010 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x2038 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x2080 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x20A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x20E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x2108 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x21D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x21F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x2220 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x2248 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x2290 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x22B0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x2320 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x2340 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x2408 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2450 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2558 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2580 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2660 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x2688 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x26D0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x26F8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2800 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x2850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x2878 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x28A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x28C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x28F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x2918 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x2940 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x2988 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x29A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x29F0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x2A10 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x2A80 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x2AA0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2B68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x2B90 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x2BD8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x2C48 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x2CB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x2D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x2D28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x2D50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x2D98 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x2DB8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x2E28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x2E48 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x2F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x2F38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x2F60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x2F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x2FB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x2FD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x3000 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x3028 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x3050 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x3078 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x30A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x30C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x3108 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x3128 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x3170 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x3190 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x31D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x31F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x3240 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x3260 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x3288 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x32A8 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3370 (size: 0xD0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3440 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x3548 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x3628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x3650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x3678 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x36A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x36C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x36F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x3718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x3740 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x3768 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x37B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x37D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x3818 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x3838 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x3880 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x38A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x38E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x3908 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x3950 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x3970 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x3A38 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3A60 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x3B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x3B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x3BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x3BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x3C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x3C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x3C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x3C80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x3CA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x3CF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x3D10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x3D58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x3D78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3DC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3DE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x3E28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x3E48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3E90 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x3EB0 (size: 0xC8)
    double UpperBodySpeedReference;                                                   // 0x3F78 (size: 0x8)
    double deltaT;                                                                    // 0x3F80 (size: 0x8)
    double PulseSumTime;                                                              // 0x3F88 (size: 0x8)
    bool NewVar;                                                                      // 0x3F90 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_BlendSpacePlayer_A93DB38D49738EF832DCF492B403C3DF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_924A231840EFD8BFAEE6FF97D5A9DF8F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_A207C5FD40B4BD992FDDAB8681219062();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_SequencePlayer_98973D2647D559DC03C63CA996985C30();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TwoWayBlend_354DD17E4A0C899E8EF85C97E420B17E();
