#ifndef UE4SS_SDK_ABP_PrototypeChar_HPP
#define UE4SS_SDK_ABP_PrototypeChar_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2322;                                                        // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_2323;                                               // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_2324;                                               // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_2325;                                               // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_2326;                                               // 0x0040 (size: 0x10)
    FName __NameProperty_2327;                                                        // 0x0050 (size: 0x8)
    float __FloatProperty_2328;                                                       // 0x0058 (size: 0x4)
    TArray<int32> __ArrayProperty_2329;                                               // 0x0060 (size: 0x10)
    FName __NameProperty_2330;                                                        // 0x0070 (size: 0x8)
    FName __NameProperty_2331;                                                        // 0x0078 (size: 0x8)
    FName __NameProperty_2332;                                                        // 0x0080 (size: 0x8)
    FName __NameProperty_2333;                                                        // 0x0088 (size: 0x8)
    FName __NameProperty_2334;                                                        // 0x0090 (size: 0x8)
    FName __NameProperty_2335;                                                        // 0x0098 (size: 0x8)
    FName __NameProperty_2336;                                                        // 0x00A0 (size: 0x8)
    FName __NameProperty_2337;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_2338;                                                        // 0x00B0 (size: 0x8)
    FName __NameProperty_2339;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2340;                                                        // 0x00C0 (size: 0x8)
    float __FloatProperty_2341;                                                       // 0x00C8 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2342;                            // 0x00CC (size: 0x1)
    FName __NameProperty_2343;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_2344;                                                        // 0x00D8 (size: 0x8)
    float __FloatProperty_2345;                                                       // 0x00E0 (size: 0x4)
    FName __NameProperty_2346;                                                        // 0x00E4 (size: 0x8)
    FName __NameProperty_2347;                                                        // 0x00EC (size: 0x8)
    FName __NameProperty_2348;                                                        // 0x00F4 (size: 0x8)
    int32 __IntProperty_2349;                                                         // 0x00FC (size: 0x4)
    FName __NameProperty_2350;                                                        // 0x0100 (size: 0x8)
    int32 __IntProperty_2351;                                                         // 0x0108 (size: 0x4)
    FName __NameProperty_2352;                                                        // 0x010C (size: 0x8)
    int32 __IntProperty_2353;                                                         // 0x0114 (size: 0x4)
    FName __NameProperty_2354;                                                        // 0x0118 (size: 0x8)
    int32 __IntProperty_2355;                                                         // 0x0120 (size: 0x4)
    FName __NameProperty_2356;                                                        // 0x0124 (size: 0x8)
    int32 __IntProperty_2357;                                                         // 0x012C (size: 0x4)
    FName __NameProperty_2358;                                                        // 0x0130 (size: 0x8)
    FName __NameProperty_2359;                                                        // 0x0138 (size: 0x8)
    FName __NameProperty_2360;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_2361;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2362;                                                        // 0x0150 (size: 0x8)
    TArray<int32> __ArrayProperty_2363;                                               // 0x0158 (size: 0x10)
    TArray<float> __ArrayProperty_2364;                                               // 0x0168 (size: 0x10)
    TArray<int32> __ArrayProperty_2365;                                               // 0x0178 (size: 0x10)
    TArray<int32> __ArrayProperty_2366;                                               // 0x0188 (size: 0x10)
    FName __NameProperty_2367;                                                        // 0x0198 (size: 0x8)
    EAnimSyncMethod __EnumProperty_2368;                                              // 0x01A0 (size: 0x1)
    FName __NameProperty_2369;                                                        // 0x01A4 (size: 0x8)
    FName __NameProperty_2370;                                                        // 0x01AC (size: 0x8)
    int32 __IntProperty_2371;                                                         // 0x01B4 (size: 0x4)
    TArray<float> __ArrayProperty_2372;                                               // 0x01B8 (size: 0x10)
    bool __BoolProperty_2373;                                                         // 0x01C8 (size: 0x1)
    float __FloatProperty_2374;                                                       // 0x01CC (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2375;                              // 0x01D0 (size: 0x2C)
    float __FloatProperty_2376;                                                       // 0x01FC (size: 0x4)
    EAnimSyncMethod __EnumProperty_2377;                                              // 0x0200 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2378;                            // 0x0201 (size: 0x1)
    FName __NameProperty_2379;                                                        // 0x0204 (size: 0x8)
    FName __NameProperty_2380;                                                        // 0x020C (size: 0x8)
    int32 __IntProperty_2381;                                                         // 0x0214 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_2382;                                       // 0x0218 (size: 0x20)
    class UBlendProfile* __BlendProfile_2383;                                         // 0x0238 (size: 0x8)
    class UCurveFloat* __CurveFloat_2384;                                             // 0x0240 (size: 0x8)
    bool __BoolProperty_2385;                                                         // 0x0248 (size: 0x1)
    EAlphaBlendOption __EnumProperty_2386;                                            // 0x0249 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2387;                                     // 0x024A (size: 0x1)
    TArray<float> __ArrayProperty_2388;                                               // 0x0250 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0260 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02E0 (size: 0x18)

}; // Size: 0x2F8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    uint8 __ByteProperty_4;                                                           // 0x0010 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0011 (size: 0x1)
    uint8 __ByteProperty_6;                                                           // 0x0012 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0013 (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x001C (size: 0x4)
    uint8 __ByteProperty_11;                                                          // 0x0020 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0028 (size: 0x4)
    bool __BoolProperty_14;                                                           // 0x002C (size: 0x1)
    float __FloatProperty_15;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0064 (size: 0x4)
    bool __BoolProperty_29;                                                           // 0x0068 (size: 0x1)
    float __FloatProperty_30;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_31;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0074 (size: 0x4)
    bool __BoolProperty_33;                                                           // 0x0078 (size: 0x1)
    bool __BoolProperty_34;                                                           // 0x0079 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x007A (size: 0x1)
    uint8 __ByteProperty_36;                                                          // 0x007B (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x007C (size: 0x1)
    float __FloatProperty_38;                                                         // 0x0080 (size: 0x4)
    uint8 __ByteProperty_39;                                                          // 0x0084 (size: 0x1)
    uint8 __ByteProperty_40;                                                          // 0x0085 (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x0086 (size: 0x1)
    bool __BoolProperty_42;                                                           // 0x0087 (size: 0x1)
    bool __BoolProperty_43;                                                           // 0x0088 (size: 0x1)
    bool __BoolProperty_44;                                                           // 0x0089 (size: 0x1)
    bool __BoolProperty_45;                                                           // 0x008A (size: 0x1)
    bool __BoolProperty_46;                                                           // 0x008B (size: 0x1)
    bool __BoolProperty_47;                                                           // 0x008C (size: 0x1)
    bool __BoolProperty_48;                                                           // 0x008D (size: 0x1)
    bool __BoolProperty_49;                                                           // 0x008E (size: 0x1)
    bool __BoolProperty_50;                                                           // 0x008F (size: 0x1)
    float __FloatProperty_51;                                                         // 0x0090 (size: 0x4)
    bool __BoolProperty_52;                                                           // 0x0094 (size: 0x1)
    bool __BoolProperty_53;                                                           // 0x0095 (size: 0x1)
    bool __BoolProperty_54;                                                           // 0x0096 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x0097 (size: 0x1)

}; // Size: 0x98

class UABP_PrototypeChar_C : public UVisPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x98)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0430 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0438 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0440 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0460 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x04A8 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0588 (size: 0x108)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0690 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0758 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x07A0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0880 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x08A8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x09B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x09D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0A00 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x0A28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x0A70 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0AB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x0B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x0B28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x0B50 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_66;                               // 0x0B98 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x0BB8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x0C00 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0C48 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_65;                               // 0x0CB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_23;                             // 0x0CD8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x0DA0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x0DE8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x0E30 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x0E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x0EA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x0EC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_64;                               // 0x0F10 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x0F30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_63;                               // 0x0F78 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_22;                             // 0x0F98 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x1060 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x10A8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x1188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x11B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x11D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x1200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x1228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x1250 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x1278 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x12A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x12C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_62;                               // 0x1310 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x1330 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_61;                               // 0x1378 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x1398 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_60;                               // 0x13E0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x1400 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_59;                               // 0x1448 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_21;                             // 0x1468 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x1530 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1578 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x15C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x15E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x1610 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_58;                               // 0x1658 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x1678 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x16C0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1708 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_57;                               // 0x1730 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_20;                             // 0x1750 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x1818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x1840 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x1868 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x18B0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x18F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_56;                               // 0x1940 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x1960 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x19A8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x19F0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x1A60 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_19;                             // 0x1A80 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x1B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x1B70 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x1B98 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x1BE0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x1C00 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x1C70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_18;                             // 0x1C90 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1D58 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x1E38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x1E60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x1E88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x1ED0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x1EF0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x1F60 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x1F80 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x2048 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2090 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2198 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x21C0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2208 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2230 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2338 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x2388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x23B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x23D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x2420 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x2440 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x24B0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x24F8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x2568 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x2588 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x2650 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x26C0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x2708 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x2778 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x27E8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x2830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x2858 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x2880 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x28C8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x28E8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x2958 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x2978 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2A68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2A90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2AB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x2AE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x2B08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x2B30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2B58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2B80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2BA8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2BD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x2BF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x2C38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x2C58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x2CA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x2CC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x2D08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x2D28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x2D70 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2D90 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x2DB8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x2DD8 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2EA0 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2F70 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x2F98 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x3078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x30A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x30C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x30F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x3118 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x3140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x3168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x3190 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x31B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x3200 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x3220 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x3268 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x3288 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x32D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x32F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x3338 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x3358 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x33A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x33C0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3488 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x34B0 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3590 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x35B8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x3698 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x36C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x36E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x3710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x3738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x3760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x37B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x37D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x3820 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x3840 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3888 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x38A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x38F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x3910 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3958 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x3978 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x39C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x39E0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3AA8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3BB0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3BD8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3C00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x3C28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3C50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3C78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3CA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3CC8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3CF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3D38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x3D58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3DA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x3DC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3E08 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x3E28 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x3F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x3F90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x3FB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x3FE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x4028 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x4048 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x4090 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x40B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x40D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x4120 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x4168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x41B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x41E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x42A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x42D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x42F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x4320 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4368 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x4388 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x43D0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x43F0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4460 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x4480 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x44F0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4510 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4580 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x45A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x45E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x4630 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4678 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x4698 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4708 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x4728 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x47F0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x4810 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x48D8 (size: 0x118)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x49F0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4A38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x4A60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x4A88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4AD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x4AF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4B38 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x4B58 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x4C20 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x4C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x4C90 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x4CB8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x4D00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x4D48 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x4D90 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4DD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x4E20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x4E40 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x4E88 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x4ED0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x4F40 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x4F60 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x5028 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x5070 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x50B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x5100 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x5148 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5190 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x51D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x5220 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x5268 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x52B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x52F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x5340 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5388 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x53A8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x5470 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x5550 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5578 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x55C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x55E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x5610 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x5658 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x5678 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x56C0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x5708 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5750 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x5770 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x5838 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x5860 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x58A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x58D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x58F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5940 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5960 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x59A8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x59F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5A38 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x5A58 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5B20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5B48 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5B70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x5BB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x5BD8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5C20 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x5C68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x5CB0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x5CD0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5D98 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x5DE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x5E08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x5E30 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x5E78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x5E98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x5EE0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x5F28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x5F70 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5FB8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6028 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x6048 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x6110 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x6138 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6160 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x61A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x61C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x6210 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x6258 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x62A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x62C0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x6388 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x63D0 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x64B0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x64F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6520 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x6548 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x6590 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x65B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x65F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x6640 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x6688 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x66A8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x6770 (size: 0x48)
    double UpperBodySpeedReference;                                                   // 0x67B8 (size: 0x8)
    double deltaT;                                                                    // 0x67C0 (size: 0x8)
    double PulseSumTime;                                                              // 0x67C8 (size: 0x8)
    double staticYaw;                                                                 // 0x67D0 (size: 0x8)
    double deltaYaw;                                                                  // 0x67D8 (size: 0x8)
    bool shouldTurnLeft;                                                              // 0x67E0 (size: 0x1)
    bool shouldTurnRight;                                                             // 0x67E1 (size: 0x1)
    FRotator staticYaw_Rotator;                                                       // 0x67E8 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void PulseTimer(double delta Time X, double interval_[seconds], bool& Fire);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_686AB5B9467388087C4A93AD751E2DB8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_C815C8BD46E6A68D87842CB13965B418();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_1853F427406B8696E0DD9B9126CD8ACA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_3D2F2855431BE7A9BF65EF981D79F5ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PrototypeChar_AnimGraphNode_TransitionResult_9C9ABEBD4BB6914F30F933B941322A37();
