#ifndef UE4SS_SDK_BPActionStrip_HPP
#define UE4SS_SDK_BPActionStrip_HPP

class UBPActionStrip_C : public UActionStrip
{
    class UBPAttachActionButton_C* BPAttachActionButton;                              // 0x0280 (size: 0x8)
    class UBPClaimBedActionButton_C* BPClaimBedActionButton;                          // 0x0288 (size: 0x8)
    class UBPClaimFamilyAreaActionButton_C* BPClaimFamilyAreaActionButton;            // 0x0290 (size: 0x8)
    class UBPDeployAsMilitiaActionButton_C* BPDeployAsMilitiaActionButton;            // 0x0298 (size: 0x8)
    class UBPDeployCampActionButton_C* BPDeployCampActionButton;                      // 0x02A0 (size: 0x8)
    class UBPDeployLadderActionButton_C* BPDeployLadderActionButton;                  // 0x02A8 (size: 0x8)
    class UBPDetachActionButton_C* BPDetachActionButton;                              // 0x02B0 (size: 0x8)
    class UBPDismantleActionButton_C* BPDismantleActionButton;                        // 0x02B8 (size: 0x8)
    class UBPFamilyPledgingRestrictionOff_C* BPFamilyPledgingRestrictionOff;          // 0x02C0 (size: 0x8)
    class UBPFamilyPledgingRestrictionOn_C* BPFamilyPledgingRestrictionOn;            // 0x02C8 (size: 0x8)
    class UBPGotoSleepActionButton_C* BPGotoSleepActionButton;                        // 0x02D0 (size: 0x8)
    class UBPPledgeToTownActionButton_C* BPPledgeToTownActionButton;                  // 0x02D8 (size: 0x8)
    class UBPPushLadderActionButton_C* BPPushLadderActionButton;                      // 0x02E0 (size: 0x8)
    class UBPRestrictedModeOffActionButton_C* BPRestrictedModeOffActionButton;        // 0x02E8 (size: 0x8)
    class UBPRestrictedModeOnActionButton_C* BPRestrictedModeOnActionButton;          // 0x02F0 (size: 0x8)
    class UBPRetractLadderActionButton_C* BPRetractLadderActionButton;                // 0x02F8 (size: 0x8)
    class UBPReturnToPledgedTownActionButton_C* BPReturnToPledgedTownActionButton;    // 0x0300 (size: 0x8)
    class UBPSetTownNameActionButton_C* BPSetTownNameActionButton;                    // 0x0308 (size: 0x8)
    class UBPUpgradeActionButton_C* BPUpgradeActionButton;                            // 0x0310 (size: 0x8)
    class UBPWithdrawSilverActionButton_C* BPWithdrawSilverActionButton;              // 0x0318 (size: 0x8)

}; // Size: 0x320

#endif
