#ifndef UE4SS_SDK_BPActionStrip_HPP
#define UE4SS_SDK_BPActionStrip_HPP

class UBPActionStrip_C : public UActionStrip
{
    class UBPBaseActionButton_C* Attach;                                              // 0x0280 (size: 0x8)
    class UBPBaseActionButton_C* ClaimBed;                                            // 0x0288 (size: 0x8)
    class UBPBaseActionButton_C* ClaimFamilyArea;                                     // 0x0290 (size: 0x8)
    class UBPBaseActionButton_C* ClaimHouse;                                          // 0x0298 (size: 0x8)
    class UBPBaseActionButton_C* DeployAsMilitia;                                     // 0x02A0 (size: 0x8)
    class UBPBaseActionButton_C* DeployCamp;                                          // 0x02A8 (size: 0x8)
    class UBPBaseActionButton_C* DeployLadder;                                        // 0x02B0 (size: 0x8)
    class UBPBaseActionButton_C* Detach;                                              // 0x02B8 (size: 0x8)
    class UBPBaseActionButton_C* Dismantle;                                           // 0x02C0 (size: 0x8)
    class UBPBaseActionButton_C* DownVote;                                            // 0x02C8 (size: 0x8)
    class UBPBaseActionButton_C* DownVoted;                                           // 0x02D0 (size: 0x8)
    class UBPBaseActionButton_C* EditSignPost;                                        // 0x02D8 (size: 0x8)
    class UBPBaseActionButton_C* ExtendStorehouse;                                    // 0x02E0 (size: 0x8)
    class UBPBaseActionButton_C* FamilyInviteToJoin;                                  // 0x02E8 (size: 0x8)
    class UBPBaseActionButton_C* FamilyLock;                                          // 0x02F0 (size: 0x8)
    class UBPBaseActionButton_C* FamilyRequestJoin;                                   // 0x02F8 (size: 0x8)
    class UBPBaseActionButton_C* FamilyUnlock;                                        // 0x0300 (size: 0x8)
    class UBPBaseActionButton_C* GotoSleep;                                           // 0x0308 (size: 0x8)
    class UBPBaseActionButton_C* PledgeToTown;                                        // 0x0310 (size: 0x8)
    class UBPBaseActionButton_C* PushLadder;                                          // 0x0318 (size: 0x8)
    class UBPBaseActionButton_C* ReinforceStructure;                                  // 0x0320 (size: 0x8)
    class UBPBaseActionButton_C* ReleaseStorehouse;                                   // 0x0328 (size: 0x8)
    class UBPBaseActionButton_C* RentStorehouse;                                      // 0x0330 (size: 0x8)
    class UBPBaseActionButton_C* RestrictedModeOff;                                   // 0x0338 (size: 0x8)
    class UBPBaseActionButton_C* RestrictedModeOn;                                    // 0x0340 (size: 0x8)
    class UBPBaseActionButton_C* RetractLadder;                                       // 0x0348 (size: 0x8)
    class UBPBaseActionButton_C* ReturnToPledgedTown;                                 // 0x0350 (size: 0x8)
    class UBPBaseActionButton_C* SetTownName;                                         // 0x0358 (size: 0x8)
    class UBPBaseActionButton_C* StartPowerMill;                                      // 0x0360 (size: 0x8)
    class UBPBaseActionButton_C* StopPowerMill;                                       // 0x0368 (size: 0x8)
    class UBPBaseActionButton_C* Upgrade;                                             // 0x0370 (size: 0x8)
    class UBPBaseActionButton_C* Upvote;                                              // 0x0378 (size: 0x8)
    class UBPBaseActionButton_C* Upvoted;                                             // 0x0380 (size: 0x8)
    class UBPBaseActionButton_C* WithdrawSilver;                                      // 0x0388 (size: 0x8)

}; // Size: 0x390

#endif
