#ifndef UE4SS_SDK_BPAvatarGroupWidget_HPP
#define UE4SS_SDK_BPAvatarGroupWidget_HPP

class UBPAvatarGroupWidget_C : public UAvatarGroupWidget
{
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget;                            // 0x0280 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_1;                          // 0x0288 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_2;                          // 0x0290 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_3;                          // 0x0298 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_4;                          // 0x02A0 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_5;                          // 0x02A8 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_6;                          // 0x02B0 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_7;                          // 0x02B8 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_8;                          // 0x02C0 (size: 0x8)
    class UBPAvatarProfileWidget_C* BPAvatarProfileWidget_9;                          // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
