#ifndef UE4SS_SDK_BPCentralMarketplaceWidget_HPP
#define UE4SS_SDK_BPCentralMarketplaceWidget_HPP

class UBPCentralMarketplaceWidget_C : public UCentralMarketplaceWidget
{
    class UBPAnvilPanel_C* BPAnvilPanel;                                              // 0x0388 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget; // 0x0390 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget_1; // 0x0398 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget_2; // 0x03A0 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget_3; // 0x03A8 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget_4; // 0x03B0 (size: 0x8)
    class UBPCentralMarketplaceListEntryWidget_C* BPCentralMarketplaceListEntryWidget_5; // 0x03B8 (size: 0x8)
    class UBPFooterContainer_C* BPFooterContainer_C_1;                                // 0x03C0 (size: 0x8)
    class UBPMainAreaContainer_C* BPMainAreaContainer;                                // 0x03C8 (size: 0x8)
    class UTextBlock* PlaceOrderHeader;                                               // 0x03D0 (size: 0x8)
    class UImage* SilverIcon;                                                         // 0x03D8 (size: 0x8)

}; // Size: 0x3E0

#endif
