#ifndef UE4SS_SDK_BPFamilyInviteDialogWidget_HPP
#define UE4SS_SDK_BPFamilyInviteDialogWidget_HPP

class UBPFamilyInviteDialogWidget_C : public UFamilyInviteDialogWidget
{
    class UImage* Background;                                                         // 0x0290 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget; // 0x0298 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_1; // 0x02A0 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_2; // 0x02A8 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_3; // 0x02B0 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_4; // 0x02B8 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_5; // 0x02C0 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_6; // 0x02C8 (size: 0x8)
    class UBPFamilyInviteDialogPlayerListEntryWidget_C* BPFamilyInviteDialogPlayerListEntryWidget_7; // 0x02D0 (size: 0x8)

}; // Size: 0x2D8

#endif
