#ifndef UE4SS_SDK_BPHeatingWindow_HPP
#define UE4SS_SDK_BPHeatingWindow_HPP

class UBPHeatingWindow_C : public UHeatingWindow
{
    class UBPHeaderContainer_C* ActionsHeader;                                        // 0x0308 (size: 0x8)
    class UImage* Arrow_1;                                                            // 0x0310 (size: 0x8)
    class UBPActionStrip_C* BPActionStrip;                                            // 0x0318 (size: 0x8)
    class UBPAnvilPanel_C* BPAnvilPanel;                                              // 0x0320 (size: 0x8)
    class UBPFooterContainer_C* BPFooterContainer;                                    // 0x0328 (size: 0x8)
    class UBPHeaderContainer_C* BPHeaderContainer;                                    // 0x0330 (size: 0x8)
    class UBPSubHeaderContainer_C* BPSubHeaderContainer;                              // 0x0338 (size: 0x8)
    class UBPMainAreaContainer_C* CookingPanel;                                       // 0x0340 (size: 0x8)
    class UBPMainAreaContainer_C* FuelPanel;                                          // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
