#ifndef UE4SS_SDK_BPOptionsScreen_HPP
#define UE4SS_SDK_BPOptionsScreen_HPP

class UBPOptionsScreen_C : public UOptionsScreen
{
    class UBPAnvilButtonWidget_C* AudioButton;                                        // 0x02A8 (size: 0x8)
    class UImage* BlackBG;                                                            // 0x02B0 (size: 0x8)
    class UBPAnvilButtonWidget_C* GameplayButtom;                                     // 0x02B8 (size: 0x8)
    class UImage* Image_50;                                                           // 0x02C0 (size: 0x8)
    class UBPAnvilButtonWidget_C* KeybindsButton;                                     // 0x02C8 (size: 0x8)
    class UBPOptionsMenuAudioWidget_C* OptionsMenu_Audio_Widget;                      // 0x02D0 (size: 0x8)
    class UBPOptionsMenuKeybindWidget_C* OptionsMenu_Keybind_Widget;                  // 0x02D8 (size: 0x8)
    class UBPOptionsMenuVideoWidget_C* OptionsMenu_Video_Widget;                      // 0x02E0 (size: 0x8)
    class UBPOptionsMenuGameplayWidget_C* OptionsMenuGameplayWidget;                  // 0x02E8 (size: 0x8)
    class UBPAnvilButtonWidget_C* VideoButton;                                        // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
