#ifndef UE4SS_SDK_BPOptionsMenuKeybindWidget_HPP
#define UE4SS_SDK_BPOptionsMenuKeybindWidget_HPP

class UBPOptionsMenuKeybindWidget_C : public UOptionsMenuKeybindWidget
{
    class UBPAnvilKeyEntryWidget_C* Action;                                           // 0x02A0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Action_1;                                         // 0x02A8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Aim;                                              // 0x02B0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* BuildMenu;                                        // 0x02B8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* CenterMap;                                        // 0x02C0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* CinematicMode;                                    // 0x02C8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Climb;                                            // 0x02D0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* DisableSnapping;                                  // 0x02D8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Drop;                                             // 0x02E0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* EnterTextChat;                                    // 0x02E8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* EquipLeftHand;                                    // 0x02F0 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* EquipRightHand;                                   // 0x02F8 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Inventory;                                        // 0x0300 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Map;                                              // 0x0308 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Mount;                                            // 0x0310 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MouseInteract;                                    // 0x0318 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MouseSelect;                                      // 0x0320 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MoveBack;                                         // 0x0328 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MoveForward;                                      // 0x0330 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MoveLeft;                                         // 0x0338 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* MoveRight;                                        // 0x0340 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* PushtoTalk;                                       // 0x0348 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Reload;                                           // 0x0350 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* RotateCamera;                                     // 0x0358 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* RotateStructure;                                  // 0x0360 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* Upgrade;                                          // 0x0368 (size: 0x8)
    class UBPAnvilKeyEntryWidget_C* UseInteract;                                      // 0x0370 (size: 0x8)

}; // Size: 0x378

#endif
