#ifndef UE4SS_SDK_BPTownCenterWindow_HPP
#define UE4SS_SDK_BPTownCenterWindow_HPP

class UBPTownCenterWindow_C : public UTownCenterWindow
{
    class UBPActionStrip_C* BPActionStrip_54;                                         // 0x0388 (size: 0x8)
    class UBPAnvilPanel_C* BPAnvilPanelTownCenter;                                    // 0x0390 (size: 0x8)
    class UBPFooterContainer_C* BPFooterContainer;                                    // 0x0398 (size: 0x8)
    class UBPFooterContainer_C* BPFooterContainer_83;                                 // 0x03A0 (size: 0x8)
    class UBPHeaderContainer_C* BPHeaderContainer_168;                                // 0x03A8 (size: 0x8)
    class UBPHeaderContainer_C* BPHeaderContainer_601;                                // 0x03B0 (size: 0x8)
    class UBPMainAreaContainer_C* BPMainAreaContainer_126;                            // 0x03B8 (size: 0x8)
    class UBPMainAreaContainer_C* BPMainAreaContainer_275;                            // 0x03C0 (size: 0x8)
    class UBPSubHeaderContainer_C* BPSubHeaderContainer;                              // 0x03C8 (size: 0x8)
    class UImage* ReserveInventorySubmitImage;                                        // 0x03D0 (size: 0x8)

}; // Size: 0x3D8

#endif
