#ifndef UE4SS_SDK_BPUnderworldDynamicModuleStraight01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleStraight01_HPP

class ABPUnderworldDynamicModuleStraight01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UStaticMeshComponent* BlockIns107;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* BlockIns106;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A22;                        // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A21;                        // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A20;                        // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A19;                        // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A18;                        // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A17;                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A16;                        // 0x0300 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A15;                        // 0x0308 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0310 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0318 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0320 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0328 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0330 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0338 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0340 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0348 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0350 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0358 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A12;                        // 0x0360 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A11;                        // 0x0368 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A10;                        // 0x0370 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A9;                         // 0x0378 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A8;                         // 0x0380 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A7;                         // 0x0388 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A6;                         // 0x0390 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A5;                         // 0x0398 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A4;                         // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A3;                         // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A2;                         // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A1;                         // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x10x20A;                          // 0x03C0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* BlockinCaveBridgeHalf;                                // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* BlockinCaveBridgeFull;                                // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag1;                                     // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag;                                      // 0x03E8 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* LakePlane;                                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* BlockinCaveBridgeHalf1;                               // 0x0400 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag11;                                    // 0x0408 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag2;                                     // 0x0410 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag5;                                     // 0x0418 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag6;                                     // 0x0420 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag7;                                     // 0x0428 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag8;                                     // 0x0430 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag9;                                     // 0x0438 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag4;                                     // 0x0440 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag10;                                    // 0x0448 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag12;                                    // 0x0450 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag13;                                    // 0x0458 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag14;                                    // 0x0460 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag15;                                    // 0x0468 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag16;                                    // 0x0470 (size: 0x8)
    class UStaticMeshComponent* BlockInUWStalag3;                                     // 0x0478 (size: 0x8)
    class UStaticMeshComponent* BlockIns105;                                          // 0x0480 (size: 0x8)
    class UStaticMeshComponent* BlockIns104;                                          // 0x0488 (size: 0x8)
    class UStaticMeshComponent* BlockIns103;                                          // 0x0490 (size: 0x8)
    class UStaticMeshComponent* BlockIns102;                                          // 0x0498 (size: 0x8)
    class UStaticMeshComponent* BlockIns101;                                          // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* BlockIns100;                                          // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* BlockIns99;                                           // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* BlockIns98;                                           // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* BlockIns97;                                           // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* BlockIns96;                                           // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* BlockIns95;                                           // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* BlockIns94;                                           // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* BlockIns70;                                           // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* BlockIns69;                                           // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* BlockIns68;                                           // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* BlockIns67;                                           // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* BlockIns93;                                           // 0x0500 (size: 0x8)
    class UStaticMeshComponent* BlockIns92;                                           // 0x0508 (size: 0x8)
    class UStaticMeshComponent* BlockIns91;                                           // 0x0510 (size: 0x8)
    class UStaticMeshComponent* BlockIns90;                                           // 0x0518 (size: 0x8)
    class UStaticMeshComponent* BlockIns89;                                           // 0x0520 (size: 0x8)
    class UStaticMeshComponent* BlockIns88;                                           // 0x0528 (size: 0x8)
    class UStaticMeshComponent* BlockIns84;                                           // 0x0530 (size: 0x8)
    class UStaticMeshComponent* BlockIns83;                                           // 0x0538 (size: 0x8)
    class UStaticMeshComponent* BlockIns82;                                           // 0x0540 (size: 0x8)
    class UStaticMeshComponent* BlockIns80;                                           // 0x0548 (size: 0x8)
    class UStaticMeshComponent* BlockIns79;                                           // 0x0550 (size: 0x8)
    class UStaticMeshComponent* BlockIns78;                                           // 0x0558 (size: 0x8)
    class UStaticMeshComponent* BlockIns77;                                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* BlockIns76;                                           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* BlockIns75;                                           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* BlockIns74;                                           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* BlockIns51;                                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* BlockIns72;                                           // 0x0588 (size: 0x8)
    class UStaticMeshComponent* BlockIns71;                                           // 0x0590 (size: 0x8)
    class UStaticMeshComponent* BlockIns66;                                           // 0x0598 (size: 0x8)
    class UStaticMeshComponent* BlockIns65;                                           // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* BlockIns64;                                           // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* BlockIns63;                                           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* BlockIns62;                                           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* BlockIns61;                                           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* BlockIns60;                                           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* BlockIns59;                                           // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* BlockIns58;                                           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* BlockIns57;                                           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* BlockIns56;                                           // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* BlockIns55;                                           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* BlockIns54;                                           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* BlockIns53;                                           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* BlockIns52;                                           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* BlockIns50;                                           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* BlockIns49;                                           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* BlockIns48;                                           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* BlockIns47;                                           // 0x0628 (size: 0x8)
    class UStaticMeshComponent* BlockIns46;                                           // 0x0630 (size: 0x8)
    class UStaticMeshComponent* BlockIns45;                                           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* BlockIns44;                                           // 0x0640 (size: 0x8)
    class UStaticMeshComponent* BlockIns43;                                           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* BlockIns42;                                           // 0x0650 (size: 0x8)
    class UStaticMeshComponent* BlockIns41;                                           // 0x0658 (size: 0x8)
    class UStaticMeshComponent* BlockIns40;                                           // 0x0660 (size: 0x8)
    class UStaticMeshComponent* BlockIns39;                                           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* BlockIns38;                                           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* BlockIns37;                                           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* BlockIns36;                                           // 0x0680 (size: 0x8)
    class UStaticMeshComponent* BlockIns35;                                           // 0x0688 (size: 0x8)
    class UStaticMeshComponent* BlockIns34;                                           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* BlockIns33;                                           // 0x0698 (size: 0x8)
    class UStaticMeshComponent* BlockIns32;                                           // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* BlockIns31;                                           // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* BlockIns29;                                           // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* BlockIns28;                                           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* BlockIns27;                                           // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* BlockIns26;                                           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* BlockIns25;                                           // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* BlockIns24;                                           // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* BlockIns23;                                           // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* BlockIns22;                                           // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* BlockIns21;                                           // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* BlockIns20;                                           // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* BlockIns19;                                           // 0x0700 (size: 0x8)
    class UStaticMeshComponent* BlockIns18;                                           // 0x0708 (size: 0x8)
    class UStaticMeshComponent* BlockIns17;                                           // 0x0710 (size: 0x8)
    class UStaticMeshComponent* BlockIns15;                                           // 0x0718 (size: 0x8)
    class UStaticMeshComponent* BlockIns12;                                           // 0x0720 (size: 0x8)
    class UStaticMeshComponent* BlockIns11;                                           // 0x0728 (size: 0x8)
    class UStaticMeshComponent* BlockIns10;                                           // 0x0730 (size: 0x8)
    class UStaticMeshComponent* BlockIns9;                                            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* BlockIns8;                                            // 0x0740 (size: 0x8)
    class UStaticMeshComponent* BlockIns7;                                            // 0x0748 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0750 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0760 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0768 (size: 0x8)

}; // Size: 0x770

#endif
