#ifndef UE4SS_SDK_BPUnderworldDynamicModuleEnd02_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleEnd02_HPP

class ABPUnderworldDynamicModuleEnd02_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UPointLightComponent* PointLight4;                                          // 0x02B0 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x02B8 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x02C0 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x02C8 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A102;                       // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A101;                       // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A100;                       // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A99;                        // 0x02F0 (size: 0x8)
    class UDecalComponent* DirtDecal020;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Stalag011;                                            // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Stalag010;                                            // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Stalag09;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Stalag08;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Stalag07;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Stalag06;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt028;                                     // 0x0330 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt027;                                     // 0x0338 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt026;                                     // 0x0340 (size: 0x8)
    class UChildActorComponent* PropActor07;                                          // 0x0348 (size: 0x8)
    class UChildActorComponent* PropActor06;                                          // 0x0350 (size: 0x8)
    class UChildActorComponent* PropActor05;                                          // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Prop013;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Prop012;                                              // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Prop011;                                              // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Prop010;                                              // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Prop09;                                               // 0x0380 (size: 0x8)
    class UChildActorComponent* PropActor04;                                          // 0x0388 (size: 0x8)
    class UChildActorComponent* PropActor03;                                          // 0x0390 (size: 0x8)
    class UChildActorComponent* PropActor02;                                          // 0x0398 (size: 0x8)
    class UChildActorComponent* PropActor01;                                          // 0x03A0 (size: 0x8)
    class UDecalComponent* DirtDecal019;                                              // 0x03A8 (size: 0x8)
    class UDecalComponent* DirtDecal018;                                              // 0x03B0 (size: 0x8)
    class UDecalComponent* DirtDecal017;                                              // 0x03B8 (size: 0x8)
    class UDecalComponent* DirtDecal016;                                              // 0x03C0 (size: 0x8)
    class UDecalComponent* DirtDecal015;                                              // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x43;                      // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x42;                      // 0x03D8 (size: 0x8)
    class UDecalComponent* WaterDecal01;                                              // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Prop08;                                               // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Prop07;                                               // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Prop06;                                               // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Prop05;                                               // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Prop04;                                               // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Prop03;                                               // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Stalag05;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Stalag04;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Stalag03;                                             // 0x0428 (size: 0x8)
    class UDecalComponent* DirtDecal014;                                              // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Prop02;                                               // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Prop01;                                               // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Stalag02;                                             // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Stalag01;                                             // 0x0450 (size: 0x8)
    class UDecalComponent* DirtDecal013;                                              // 0x0458 (size: 0x8)
    class UDecalComponent* DirtDecal012;                                              // 0x0460 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A98;                        // 0x0468 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A97;                        // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A96;                        // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A95;                        // 0x0480 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A94;                        // 0x0488 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A93;                        // 0x0490 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x41;                      // 0x0498 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x40;                      // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt025;                                     // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform16;                         // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt024;                                     // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt023;                                     // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt022;                                     // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt021;                                     // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt020;                                     // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt019;                                     // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt018;                                     // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt017;                                     // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt016;                                     // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt015;                                     // 0x0500 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt014;                                     // 0x0508 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt013;                                     // 0x0510 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A92;                        // 0x0518 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A91;                        // 0x0520 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A90;                        // 0x0528 (size: 0x8)
    class UDecalComponent* DirtDecal011;                                              // 0x0530 (size: 0x8)
    class UDecalComponent* DirtDecal010;                                              // 0x0538 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x39;                      // 0x0540 (size: 0x8)
    class UDecalComponent* DirtDecal09;                                               // 0x0548 (size: 0x8)
    class UDecalComponent* DirtDecal08;                                               // 0x0550 (size: 0x8)
    class UDecalComponent* DirtDecal07;                                               // 0x0558 (size: 0x8)
    class UDecalComponent* DirtDecal06;                                               // 0x0560 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x38;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x37;                      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x36;                      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt012;                                     // 0x0580 (size: 0x8)
    class UDecalComponent* DirtDecal05;                                               // 0x0588 (size: 0x8)
    class UDecalComponent* DirtDecal04;                                               // 0x0590 (size: 0x8)
    class UDecalComponent* DirtDecal03;                                               // 0x0598 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt011;                                     // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt010;                                     // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt09;                                      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt08;                                      // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt07;                                      // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt06;                                      // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt05;                                      // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt04;                                      // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt03;                                      // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt02;                                      // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* RockWallSkirt01;                                      // 0x05F0 (size: 0x8)
    class UDecalComponent* DirtDecal02;                                               // 0x05F8 (size: 0x8)
    class UDecalComponent* DirtDecal01;                                               // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Grass017;                                             // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Grass016;                                             // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Grass015;                                             // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Grass014;                                             // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Grass013;                                             // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Grass012;                                             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Grass011;                                             // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Grass010;                                             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Grass09;                                              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Grass08;                                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Grass07;                                              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Grass06;                                              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Grass05;                                              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Grass04;                                              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Grass03;                                              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Grass02;                                              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Grass01;                                              // 0x0688 (size: 0x8)
    class UDecalComponent* GrassDecal13;                                              // 0x0690 (size: 0x8)
    class UDecalComponent* GrassDecal12;                                              // 0x0698 (size: 0x8)
    class UDecalComponent* GrassDecal11;                                              // 0x06A0 (size: 0x8)
    class UDecalComponent* GrassDecal10;                                              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A89;                        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A88;                        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15;                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform14;                         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform13;                         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform12;                         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform11;                         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform10;                         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform9;                          // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform8;                          // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A87;                        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x35;                      // 0x0708 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x34;                      // 0x0710 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x33;                      // 0x0718 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x32;                      // 0x0720 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x31;                      // 0x0728 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x30;                      // 0x0730 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x29;                      // 0x0738 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x28;                      // 0x0740 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x27;                      // 0x0748 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x26;                      // 0x0750 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x25;                      // 0x0758 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A86;                        // 0x0760 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A85;                        // 0x0768 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A84;                        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A83;                        // 0x0778 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A82;                        // 0x0780 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A81;                        // 0x0788 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A80;                        // 0x0790 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A79;                        // 0x0798 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A78;                        // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A77;                        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A76;                        // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A75;                        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A74;                        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A73;                        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A72;                        // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A71;                        // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A70;                        // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform7;                          // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A69;                        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A68;                        // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A67;                        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A66;                        // 0x0808 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A65;                        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A64;                        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A63;                        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A62;                        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A61;                        // 0x0830 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A60;                        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A59;                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A58;                        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A57;                        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A56;                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A55;                        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A54;                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A53;                        // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A52;                        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A51;                        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A50;                        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A49;                        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A48;                        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A47;                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A46;                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A45;                        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A44;                        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A43;                        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A42;                        // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A41;                        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A40;                        // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A39;                        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A38;                        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A37;                        // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A36;                        // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A35;                        // 0x0900 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A34;                        // 0x0908 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A33;                        // 0x0910 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A32;                        // 0x0918 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A30;                        // 0x0920 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A29;                        // 0x0928 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A28;                        // 0x0930 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A27;                        // 0x0938 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A26;                        // 0x0940 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A25;                        // 0x0948 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A24;                        // 0x0950 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A23;                        // 0x0958 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A22;                        // 0x0960 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A21;                        // 0x0968 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A20;                        // 0x0970 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A19;                        // 0x0978 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A18;                        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A17;                        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A16;                        // 0x0990 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A15;                        // 0x0998 (size: 0x8)
    class UDecalComponent* GrassDecal9;                                               // 0x09A0 (size: 0x8)
    class UDecalComponent* GrassDecal8;                                               // 0x09A8 (size: 0x8)
    class UDecalComponent* GrassDecal7;                                               // 0x09B0 (size: 0x8)
    class UDecalComponent* GrassDecal6;                                               // 0x09B8 (size: 0x8)
    class UDecalComponent* GrassDecal5;                                               // 0x09C0 (size: 0x8)
    class UDecalComponent* GrassDecal4;                                               // 0x09C8 (size: 0x8)
    class UDecalComponent* GrassDecal3;                                               // 0x09D0 (size: 0x8)
    class UDecalComponent* GrassDecal2;                                               // 0x09D8 (size: 0x8)
    class UDecalComponent* GrassDecal1;                                               // 0x09E0 (size: 0x8)
    class UDecalComponent* GrassDecal;                                                // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform6;                          // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform5;                          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform4;                          // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform3;                          // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A14;                        // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A13;                        // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A12;                        // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A11;                        // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A10;                        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A9;                         // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A8;                         // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A7;                         // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A6;                         // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A5;                         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A4;                         // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A3;                         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A2;                         // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A1;                         // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x60x60A;                          // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform2;                          // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform1;                          // 0x0A90 (size: 0x8)
    class URectLightComponent* RectLight;                                             // 0x0A98 (size: 0x8)
    class UChildActorComponent* ChildActorWorldEntrance;                              // 0x0AA0 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0AA8 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0AB0 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0AB8 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0AC0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0AC8 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0AD0 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0AD8 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0AE0 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0AE8 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0AF0 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0AF8 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0B08 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0B10 (size: 0x8)

}; // Size: 0xB18

#endif
