#ifndef UE4SS_SDK_BPUnderworldDynamicModuleCorner01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleCorner01_HPP

class ABPUnderworldDynamicModuleCorner01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UDecalComponent* Decal054;                                                  // 0x02B0 (size: 0x8)
    class UDecalComponent* Decal053;                                                  // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x47;                      // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Props015;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Props034;                                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Props033;                                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Props048;                                             // 0x02E0 (size: 0x8)
    class UDecalComponent* Decal052;                                                  // 0x02E8 (size: 0x8)
    class UDecalComponent* Decal051;                                                  // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Props047;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Props046;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Props045;                                             // 0x0308 (size: 0x8)
    class UChildActorComponent* Prop016;                                              // 0x0310 (size: 0x8)
    class UDecalComponent* Decal050;                                                  // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Props044;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Props043;                                             // 0x0328 (size: 0x8)
    class UDecalComponent* Decal049;                                                  // 0x0330 (size: 0x8)
    class UDecalComponent* Decal048;                                                  // 0x0338 (size: 0x8)
    class UDecalComponent* Decal047;                                                  // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Props042;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Props041;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Props040;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Props039;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Props038;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Props037;                                             // 0x0370 (size: 0x8)
    class UDecalComponent* Decal046;                                                  // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Props036;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Props035;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Props032;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Props031;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Props030;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Props029;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Props028;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Props027;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Props026;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Props025;                                             // 0x03C8 (size: 0x8)
    class UDecalComponent* Decal045;                                                  // 0x03D0 (size: 0x8)
    class UDecalComponent* Decal044;                                                  // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x46;                      // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x45;                      // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x42;                      // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Props024;                                             // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Props023;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Props022;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Props021;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Props020;                                             // 0x0418 (size: 0x8)
    class UChildActorComponent* Prop015;                                              // 0x0420 (size: 0x8)
    class UDecalComponent* Decal043;                                                  // 0x0428 (size: 0x8)
    class UDecalComponent* Decal042;                                                  // 0x0430 (size: 0x8)
    class UChildActorComponent* Prop014;                                              // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Props019;                                             // 0x0440 (size: 0x8)
    class UChildActorComponent* Prop013;                                              // 0x0448 (size: 0x8)
    class UChildActorComponent* Prop012;                                              // 0x0450 (size: 0x8)
    class UChildActorComponent* Prop011;                                              // 0x0458 (size: 0x8)
    class UChildActorComponent* Prop010;                                              // 0x0460 (size: 0x8)
    class UChildActorComponent* Prop09;                                               // 0x0468 (size: 0x8)
    class UChildActorComponent* Prop08;                                               // 0x0470 (size: 0x8)
    class UChildActorComponent* Prop07;                                               // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Props017;                                             // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Props014;                                             // 0x0488 (size: 0x8)
    class UDecalComponent* Decal01;                                                   // 0x0490 (size: 0x8)
    class UDecalComponent* Decal041;                                                  // 0x0498 (size: 0x8)
    class UDecalComponent* Decal040;                                                  // 0x04A0 (size: 0x8)
    class UDecalComponent* Decal039;                                                  // 0x04A8 (size: 0x8)
    class UDecalComponent* Decal038;                                                  // 0x04B0 (size: 0x8)
    class UDecalComponent* Decal037;                                                  // 0x04B8 (size: 0x8)
    class UDecalComponent* Decal036;                                                  // 0x04C0 (size: 0x8)
    class UDecalComponent* Decal035;                                                  // 0x04C8 (size: 0x8)
    class UDecalComponent* Decal034;                                                  // 0x04D0 (size: 0x8)
    class UDecalComponent* Decal033;                                                  // 0x04D8 (size: 0x8)
    class UDecalComponent* Decal032;                                                  // 0x04E0 (size: 0x8)
    class UDecalComponent* Decal031;                                                  // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Props012;                                             // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Props011;                                             // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Props010;                                             // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Props09;                                              // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Props08;                                              // 0x0510 (size: 0x8)
    class UStaticMeshComponent* Props07;                                              // 0x0518 (size: 0x8)
    class UStaticMeshComponent* Props06;                                              // 0x0520 (size: 0x8)
    class UChildActorComponent* Prop06;                                               // 0x0528 (size: 0x8)
    class UChildActorComponent* Prop05;                                               // 0x0530 (size: 0x8)
    class UChildActorComponent* Prop04;                                               // 0x0538 (size: 0x8)
    class UChildActorComponent* Prop03;                                               // 0x0540 (size: 0x8)
    class UChildActorComponent* Prop02;                                               // 0x0548 (size: 0x8)
    class UChildActorComponent* Prop01;                                               // 0x0550 (size: 0x8)
    class UDecalComponent* Decal030;                                                  // 0x0558 (size: 0x8)
    class UDecalComponent* Decal029;                                                  // 0x0560 (size: 0x8)
    class UDecalComponent* Decal028;                                                  // 0x0568 (size: 0x8)
    class UDecalComponent* Decal027;                                                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Walls0138;                                            // 0x0578 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x44;                      // 0x0580 (size: 0x8)
    class UDecalComponent* Decal026;                                                  // 0x0588 (size: 0x8)
    class UDecalComponent* Decal025;                                                  // 0x0590 (size: 0x8)
    class UDecalComponent* Decal024;                                                  // 0x0598 (size: 0x8)
    class UDecalComponent* Decal023;                                                  // 0x05A0 (size: 0x8)
    class UDecalComponent* Decal022;                                                  // 0x05A8 (size: 0x8)
    class UDecalComponent* Decal021;                                                  // 0x05B0 (size: 0x8)
    class UDecalComponent* Decal020;                                                  // 0x05B8 (size: 0x8)
    class UDecalComponent* Decal019;                                                  // 0x05C0 (size: 0x8)
    class UDecalComponent* Decal018;                                                  // 0x05C8 (size: 0x8)
    class UDecalComponent* Decal017;                                                  // 0x05D0 (size: 0x8)
    class UDecalComponent* Decal016;                                                  // 0x05D8 (size: 0x8)
    class UDecalComponent* Decal015;                                                  // 0x05E0 (size: 0x8)
    class UDecalComponent* Decal014;                                                  // 0x05E8 (size: 0x8)
    class UDecalComponent* Decal013;                                                  // 0x05F0 (size: 0x8)
    class UDecalComponent* Decal012;                                                  // 0x05F8 (size: 0x8)
    class UDecalComponent* Decal011;                                                  // 0x0600 (size: 0x8)
    class UDecalComponent* Decal010;                                                  // 0x0608 (size: 0x8)
    class UDecalComponent* Decal09;                                                   // 0x0610 (size: 0x8)
    class UDecalComponent* Decal08;                                                   // 0x0618 (size: 0x8)
    class UDecalComponent* Decal07;                                                   // 0x0620 (size: 0x8)
    class UDecalComponent* Decal06;                                                   // 0x0628 (size: 0x8)
    class UDecalComponent* Decal05;                                                   // 0x0630 (size: 0x8)
    class UDecalComponent* Decal04;                                                   // 0x0638 (size: 0x8)
    class UDecalComponent* Decal03;                                                   // 0x0640 (size: 0x8)
    class UDecalComponent* Decal02;                                                   // 0x0648 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x43;                      // 0x0650 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x0658 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x0660 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x0668 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Walls0137;                                            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Walls0136;                                            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Walls0135;                                            // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Walls0134;                                            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Walls0133;                                            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Walls0132;                                            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Walls0131;                                            // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Walls0130;                                            // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Walls0129;                                            // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Walls0128;                                            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* Walls0127;                                            // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* Walls0126;                                            // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* Walls0125;                                            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* Walls0124;                                            // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* Walls0123;                                            // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* Walls0122;                                            // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Walls0121;                                            // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Walls0120;                                            // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Walls0119;                                            // 0x0708 (size: 0x8)
    class UStaticMeshComponent* Walls0118;                                            // 0x0710 (size: 0x8)
    class UStaticMeshComponent* Walls0117;                                            // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Walls0116;                                            // 0x0720 (size: 0x8)
    class UStaticMeshComponent* Walls0115;                                            // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Walls0114;                                            // 0x0730 (size: 0x8)
    class UStaticMeshComponent* Walls0113;                                            // 0x0738 (size: 0x8)
    class UStaticMeshComponent* Walls0112;                                            // 0x0740 (size: 0x8)
    class UStaticMeshComponent* Walls0111;                                            // 0x0748 (size: 0x8)
    class UStaticMeshComponent* Walls0110;                                            // 0x0750 (size: 0x8)
    class UStaticMeshComponent* Walls0109;                                            // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Walls0108;                                            // 0x0760 (size: 0x8)
    class UStaticMeshComponent* Walls0107;                                            // 0x0768 (size: 0x8)
    class UStaticMeshComponent* Walls0106;                                            // 0x0770 (size: 0x8)
    class UStaticMeshComponent* Walls0105;                                            // 0x0778 (size: 0x8)
    class UStaticMeshComponent* Walls0104;                                            // 0x0780 (size: 0x8)
    class UStaticMeshComponent* Walls0103;                                            // 0x0788 (size: 0x8)
    class UStaticMeshComponent* Walls0102;                                            // 0x0790 (size: 0x8)
    class UStaticMeshComponent* Walls0101;                                            // 0x0798 (size: 0x8)
    class UStaticMeshComponent* Walls0100;                                            // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Walls099;                                             // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* Walls098;                                             // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* Walls097;                                             // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Walls096;                                             // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Walls095;                                             // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* Walls094;                                             // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* Walls093;                                             // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* Walls092;                                             // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* Walls091;                                             // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* Walls090;                                             // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Walls089;                                             // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Walls088;                                             // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Walls087;                                             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* Walls086;                                             // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Walls085;                                             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* Walls084;                                             // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Walls083;                                             // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Walls082;                                             // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Walls081;                                             // 0x0838 (size: 0x8)
    class UStaticMeshComponent* Walls080;                                             // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Walls079;                                             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Walls078;                                             // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Walls077;                                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Walls076;                                             // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Walls075;                                             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Props013;                                             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x41;                      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x40;                      // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Walls074;                                             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Walls073;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Walls072;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Walls071;                                             // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Walls070;                                             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Walls069;                                             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Walls068;                                             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Walls067;                                             // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Walls066;                                             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* Walls065;                                             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Walls064;                                             // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Walls063;                                             // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* Walls062;                                             // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* Walls061;                                             // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* Walls060;                                             // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* Walls059;                                             // 0x0900 (size: 0x8)
    class UStaticMeshComponent* Walls058;                                             // 0x0908 (size: 0x8)
    class UStaticMeshComponent* Walls057;                                             // 0x0910 (size: 0x8)
    class UStaticMeshComponent* Walls056;                                             // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Walls055;                                             // 0x0920 (size: 0x8)
    class UStaticMeshComponent* Walls054;                                             // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Walls053;                                             // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Walls052;                                             // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Walls051;                                             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Walls050;                                             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Walls049;                                             // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Walls048;                                             // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Walls047;                                             // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Walls046;                                             // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Walls045;                                             // 0x0970 (size: 0x8)
    class UStaticMeshComponent* Walls044;                                             // 0x0978 (size: 0x8)
    class UStaticMeshComponent* Walls043;                                             // 0x0980 (size: 0x8)
    class UStaticMeshComponent* Walls042;                                             // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Walls041;                                             // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Walls040;                                             // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Walls039;                                             // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Walls038;                                             // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Walls037;                                             // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Walls036;                                             // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Walls035;                                             // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Walls034;                                             // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Walls033;                                             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Walls032;                                             // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Walls031;                                             // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Walls030;                                             // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Walls029;                                             // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Walls028;                                             // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Walls027;                                             // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Walls026;                                             // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Walls025;                                             // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x39;                      // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x38;                      // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* Walls024;                                             // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* Walls023;                                             // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Walls022;                                             // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* Walls021;                                             // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* Walls020;                                             // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* Walls019;                                             // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* Walls018;                                             // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* Walls017;                                             // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* Walls016;                                             // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* Walls015;                                             // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* Walls014;                                             // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* Walls013;                                             // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* Walls012;                                             // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* Walls011;                                             // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* Walls010;                                             // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* Walls09;                                              // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* Walls08;                                              // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* Walls07;                                              // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* Walls06;                                              // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* Walls05;                                              // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* Walls04;                                              // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* Walls03;                                              // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* Walls02;                                              // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* Walls01;                                              // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x37;                      // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x36;                      // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x35;                      // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x34;                      // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x33;                      // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x32;                      // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x31;                      // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x30;                      // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* Water01;                                              // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x29;                      // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x28;                      // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x27;                      // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x26;                      // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x25;                      // 0x0B50 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0B58 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0B60 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0B68 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0B70 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0B78 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0B80 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0B88 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0B90 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0B98 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x0BA0 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0BA8 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0BB0 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0BC0 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0BC8 (size: 0x8)

}; // Size: 0xBD0

#endif
