#ifndef UE4SS_SDK_BPUnderworldDynamicModuleEnd01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleEnd01_HPP

class ABPUnderworldDynamicModuleEnd01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UChildActorComponent* LatticeMineIron1;                                     // 0x02B0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x02B8 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x02C0 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike7;                             // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike6;                             // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike5;                             // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike4;                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike3;                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike2;                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike1;                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* RockFloor017;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* RockFloor016;                                         // 0x0310 (size: 0x8)
    class UStaticMeshComponent* RockFloor015;                                         // 0x0318 (size: 0x8)
    class UStaticMeshComponent* RockFloor014;                                         // 0x0320 (size: 0x8)
    class UStaticMeshComponent* RockFloor013;                                         // 0x0328 (size: 0x8)
    class UStaticMeshComponent* RockFloor012;                                         // 0x0330 (size: 0x8)
    class UStaticMeshComponent* RockFloor011;                                         // 0x0338 (size: 0x8)
    class UStaticMeshComponent* RockFloor010;                                         // 0x0340 (size: 0x8)
    class UStaticMeshComponent* RockFloor09;                                          // 0x0348 (size: 0x8)
    class UStaticMeshComponent* RockFloor08;                                          // 0x0350 (size: 0x8)
    class UStaticMeshComponent* RockFloor07;                                          // 0x0358 (size: 0x8)
    class UStaticMeshComponent* RockFloor06;                                          // 0x0360 (size: 0x8)
    class UStaticMeshComponent* RockFloor05;                                          // 0x0368 (size: 0x8)
    class UStaticMeshComponent* RockFloor04;                                          // 0x0370 (size: 0x8)
    class UStaticMeshComponent* RockFloor03;                                          // 0x0378 (size: 0x8)
    class UStaticMeshComponent* RockFloor02;                                          // 0x0380 (size: 0x8)
    class UStaticMeshComponent* RockFloor01;                                          // 0x0388 (size: 0x8)
    class UStaticMeshComponent* RockWall078;                                          // 0x0390 (size: 0x8)
    class UStaticMeshComponent* RockWall077;                                          // 0x0398 (size: 0x8)
    class UStaticMeshComponent* RockWall076;                                          // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* RockWall075;                                          // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* RockWall074;                                          // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* RockWall073;                                          // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* RockWall072;                                          // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* RockWall071;                                          // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* RockWall070;                                          // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* RockWall069;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* RockWall068;                                          // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* RockWall067;                                          // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* RockWall066;                                          // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* RockWall065;                                          // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* RockWall064;                                          // 0x0400 (size: 0x8)
    class UStaticMeshComponent* RockWall063;                                          // 0x0408 (size: 0x8)
    class UStaticMeshComponent* RockWall062;                                          // 0x0410 (size: 0x8)
    class UStaticMeshComponent* RockWall061;                                          // 0x0418 (size: 0x8)
    class UStaticMeshComponent* RockWall060;                                          // 0x0420 (size: 0x8)
    class UStaticMeshComponent* RockWall059;                                          // 0x0428 (size: 0x8)
    class UStaticMeshComponent* RockWall058;                                          // 0x0430 (size: 0x8)
    class UStaticMeshComponent* RockWall057;                                          // 0x0438 (size: 0x8)
    class UStaticMeshComponent* RockWall056;                                          // 0x0440 (size: 0x8)
    class UStaticMeshComponent* RockWall055;                                          // 0x0448 (size: 0x8)
    class UStaticMeshComponent* RockWall054;                                          // 0x0450 (size: 0x8)
    class UStaticMeshComponent* RockWall053;                                          // 0x0458 (size: 0x8)
    class UStaticMeshComponent* RockWall052;                                          // 0x0460 (size: 0x8)
    class UStaticMeshComponent* RockWall051;                                          // 0x0468 (size: 0x8)
    class UStaticMeshComponent* RockWall050;                                          // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RockWall049;                                          // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RockWall048;                                          // 0x0480 (size: 0x8)
    class UStaticMeshComponent* RockWall047;                                          // 0x0488 (size: 0x8)
    class UStaticMeshComponent* RockWall046;                                          // 0x0490 (size: 0x8)
    class UStaticMeshComponent* RockWall045;                                          // 0x0498 (size: 0x8)
    class UStaticMeshComponent* RockWall044;                                          // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* RockWall043;                                          // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* RockWall042;                                          // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* RockWall041;                                          // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RockWall040;                                          // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* RockWall039;                                          // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RockWall038;                                          // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RockWall037;                                          // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RockWall036;                                          // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RockWall035;                                          // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* RockWall034;                                          // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* RockWall033;                                          // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* RockWall032;                                          // 0x0500 (size: 0x8)
    class UStaticMeshComponent* RockWall031;                                          // 0x0508 (size: 0x8)
    class UStaticMeshComponent* RockWall030;                                          // 0x0510 (size: 0x8)
    class UStaticMeshComponent* RockWall029;                                          // 0x0518 (size: 0x8)
    class UStaticMeshComponent* RockWall028;                                          // 0x0520 (size: 0x8)
    class UStaticMeshComponent* RockWall027;                                          // 0x0528 (size: 0x8)
    class UStaticMeshComponent* RockWall026;                                          // 0x0530 (size: 0x8)
    class UStaticMeshComponent* RockWall025;                                          // 0x0538 (size: 0x8)
    class UStaticMeshComponent* RockWall024;                                          // 0x0540 (size: 0x8)
    class UStaticMeshComponent* RockWall023;                                          // 0x0548 (size: 0x8)
    class UStaticMeshComponent* RockWall022;                                          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* RockWall021;                                          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* RockWall020;                                          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* RockWall019;                                          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* RockWall018;                                          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* RockWall017;                                          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* RockWall016;                                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* RockWall015;                                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* RockWall014;                                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* RockWall013;                                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* RockWall012;                                          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* RockWall011;                                          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* RockWall010;                                          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* RockWall09;                                           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* RockWall08;                                           // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* RockWall07;                                           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* RockWall06;                                           // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* RockWall05;                                           // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* RockWall04;                                           // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* RockWall03;                                           // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* RockWall02;                                           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* RockWall01;                                           // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Entrance01;                                           // 0x0600 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform2;                          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform1;                          // 0x0610 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0618 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0620 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0628 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0630 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0638 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0640 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0648 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0650 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0658 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0660 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0668 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0678 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0680 (size: 0x8)

}; // Size: 0x688

#endif
