#ifndef UE4SS_SDK_BPUnderworldDynamicModuleCorner02_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleCorner02_HPP

class ABPUnderworldDynamicModuleCorner02_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UDecalComponent* Decal055;                                                  // 0x02B0 (size: 0x8)
    class UDecalComponent* Decal054;                                                  // 0x02B8 (size: 0x8)
    class UDecalComponent* Decal053;                                                  // 0x02C0 (size: 0x8)
    class UDecalComponent* Decal052;                                                  // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A128;                       // 0x02D0 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal01;                                    // 0x02D8 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x02E0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x02E8 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk017;                                        // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk016;                                        // 0x0300 (size: 0x8)
    class UChildActorComponent* ChildActorBat;                                        // 0x0308 (size: 0x8)
    class UChildActorComponent* ChildActorIronPile;                                   // 0x0310 (size: 0x8)
    class UChildActorComponent* ChildActorStonePile;                                  // 0x0318 (size: 0x8)
    class UChildActorComponent* ChildActorWolfElite;                                  // 0x0320 (size: 0x8)
    class UBoxComponent* EntranceCollision;                                           // 0x0328 (size: 0x8)
    class UStaticMeshComponent* FloorChunk015;                                        // 0x0330 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A127;                       // 0x0338 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A126;                       // 0x0340 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A125;                       // 0x0348 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A124;                       // 0x0350 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A123;                       // 0x0358 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A122;                       // 0x0360 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A121;                       // 0x0368 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A120;                       // 0x0370 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A119;                       // 0x0378 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A118;                       // 0x0380 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A117;                       // 0x0388 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A116;                       // 0x0390 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A115;                       // 0x0398 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A114;                       // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A113;                       // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A112;                       // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A111;                       // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A110;                       // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A109;                       // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A108;                       // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A107;                       // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A106;                       // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A105;                       // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A104;                       // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A103;                       // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A102;                       // 0x0400 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A101;                       // 0x0408 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A100;                       // 0x0410 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A99;                        // 0x0418 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A98;                        // 0x0420 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A97;                        // 0x0428 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A96;                        // 0x0430 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A95;                        // 0x0438 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A94;                        // 0x0440 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A93;                        // 0x0448 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A92;                        // 0x0450 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A91;                        // 0x0458 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A90;                        // 0x0460 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A89;                        // 0x0468 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A88;                        // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A87;                        // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A86;                        // 0x0480 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A85;                        // 0x0488 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A84;                        // 0x0490 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A83;                        // 0x0498 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A82;                        // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A81;                        // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A80;                        // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A79;                        // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A78;                        // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A77;                        // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A76;                        // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A75;                        // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A74;                        // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A70;                        // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A73;                        // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A72;                        // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A71;                        // 0x0500 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A69;                        // 0x0508 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A68;                        // 0x0510 (size: 0x8)
    class UStaticMeshComponent* FloorChunk014;                                        // 0x0518 (size: 0x8)
    class UStaticMeshComponent* FloorChunk013;                                        // 0x0520 (size: 0x8)
    class UStaticMeshComponent* FloorChunk012;                                        // 0x0528 (size: 0x8)
    class UStaticMeshComponent* FloorChunk011;                                        // 0x0530 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0538 (size: 0x8)
    class USpotLightComponent* Key Light;                                             // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Exterior Light Plane;                                 // 0x0548 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A67;                        // 0x0550 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A66;                        // 0x0558 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A65;                        // 0x0560 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A64;                        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A63;                        // 0x0570 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A62;                        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* FloorChunk010;                                        // 0x0580 (size: 0x8)
    class UChildActorComponent* ChildActorWorldEntrance;                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A61;                        // 0x0590 (size: 0x8)
    class UDecalComponent* Decal051;                                                  // 0x0598 (size: 0x8)
    class UStaticMeshComponent* FloorChunk09;                                         // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk08;                                         // 0x05A8 (size: 0x8)
    class UDecalComponent* Decal050;                                                  // 0x05B0 (size: 0x8)
    class UDecalComponent* Decal048;                                                  // 0x05B8 (size: 0x8)
    class UDecalComponent* Decal049;                                                  // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk07;                                         // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk06;                                         // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk05;                                         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk04;                                         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk03;                                         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk02;                                         // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk01;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A60;                        // 0x0600 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A59;                        // 0x0608 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A58;                        // 0x0610 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A57;                        // 0x0618 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A56;                        // 0x0620 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A55;                        // 0x0628 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A54;                        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A53;                        // 0x0638 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A52;                        // 0x0640 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A51;                        // 0x0648 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A50;                        // 0x0650 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A49;                        // 0x0658 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A48;                        // 0x0660 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A47;                        // 0x0668 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A46;                        // 0x0670 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A45;                        // 0x0678 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A44;                        // 0x0680 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A43;                        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A42;                        // 0x0690 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A41;                        // 0x0698 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A40;                        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A39;                        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A38;                        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A37;                        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A36;                        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A35;                        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A34;                        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A33;                        // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A32;                        // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A31;                        // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A30;                        // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A29;                        // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A28;                        // 0x0700 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A27;                        // 0x0708 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A26;                        // 0x0710 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A25;                        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A24;                        // 0x0720 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A23;                        // 0x0728 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A22;                        // 0x0730 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A21;                        // 0x0738 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A20;                        // 0x0740 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A19;                        // 0x0748 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A18;                        // 0x0750 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A17;                        // 0x0758 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A16;                        // 0x0760 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A15;                        // 0x0768 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A14;                        // 0x0770 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A13;                        // 0x0778 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A12;                        // 0x0780 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A11;                        // 0x0788 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A10;                        // 0x0790 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A9;                         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A8;                         // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A7;                         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A6;                         // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A5;                         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A4;                         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A3;                         // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A2;                         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A1;                         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A;                          // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x07E8 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x07F0 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x07F8 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0800 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0808 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0810 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0818 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0820 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0828 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0830 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x0838 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0840 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0848 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0858 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0860 (size: 0x8)

}; // Size: 0x868

#endif
