#ifndef UE4SS_SDK_BPUnderworldDynamicModuleCorner01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleCorner01_HPP

class ABPUnderworldDynamicModuleCorner01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UChildActorComponent* LatticeMineIron3;                                     // 0x02B0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x02B8 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x02C0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x42;                      // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x41;                      // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x40;                      // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Walls074;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Walls073;                                             // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Walls072;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Walls071;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Walls070;                                             // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Walls069;                                             // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Walls068;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Walls067;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Walls066;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Walls065;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Walls064;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Walls063;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Walls062;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Walls061;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Walls060;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Walls059;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Walls058;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Walls057;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Walls056;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Walls055;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Walls054;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Walls053;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Walls052;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Walls051;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Walls050;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Walls049;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Walls048;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Walls047;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Walls046;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Walls045;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Walls044;                                             // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Walls043;                                             // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Walls042;                                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Walls041;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Walls040;                                             // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Walls039;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Walls038;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Walls037;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Walls036;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Walls035;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Walls034;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Walls033;                                             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Walls032;                                             // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Walls031;                                             // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Walls030;                                             // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Walls029;                                             // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Walls028;                                             // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Walls027;                                             // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Walls026;                                             // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Walls025;                                             // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x39;                      // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x38;                      // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Walls024;                                             // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Walls023;                                             // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Walls022;                                             // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Walls021;                                             // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* Walls020;                                             // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* Walls019;                                             // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Walls018;                                             // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Walls017;                                             // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Walls016;                                             // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Walls015;                                             // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Walls014;                                             // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Walls013;                                             // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Walls012;                                             // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Walls011;                                             // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Walls010;                                             // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Walls09;                                              // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Walls08;                                              // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Walls07;                                              // 0x0510 (size: 0x8)
    class UStaticMeshComponent* Walls06;                                              // 0x0518 (size: 0x8)
    class UStaticMeshComponent* Walls05;                                              // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Walls04;                                              // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Walls03;                                              // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Walls02;                                              // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Walls01;                                              // 0x0540 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x37;                      // 0x0548 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x36;                      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x35;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x34;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x33;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x32;                      // 0x0570 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x31;                      // 0x0578 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x30;                      // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Water01;                                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x29;                      // 0x0590 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x28;                      // 0x0598 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x27;                      // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x26;                      // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x25;                      // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Entrance02;                                           // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Entrance01;                                           // 0x05C0 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x05C8 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x05D0 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x05D8 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x05E0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x05E8 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x05F0 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x05F8 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0600 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0608 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x0610 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0618 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0620 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0630 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0638 (size: 0x8)

}; // Size: 0x640

#endif
