#ifndef UE4SS_SDK_BPUnderworldDynamicModuleCross01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleCross01_HPP

class ABPUnderworldDynamicModuleCross01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UChildActorComponent* LatticeMineIron1;                                     // 0x02B0 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x02B8 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x02C0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Wall072;                                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Wall071;                                              // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Wall070;                                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* Wall069;                                              // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* Wall068;                                              // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Wall067;                                              // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Wall066;                                              // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Wall065;                                              // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Wall064;                                              // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Wall063;                                              // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Wall062;                                              // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Wall061;                                              // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Wall060;                                              // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Wall059;                                              // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Wall058;                                              // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Wall057;                                              // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Wall056;                                              // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Wall055;                                              // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Wall054;                                              // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Wall053;                                              // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Wall052;                                              // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Wall051;                                              // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Wall050;                                              // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Wall049;                                              // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Wall048;                                              // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Wall047;                                              // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Wall046;                                              // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Wall045;                                              // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Wall044;                                              // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Wall043;                                              // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Wall042;                                              // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Wall041;                                              // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Wall040;                                              // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Wall039;                                              // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Wall038;                                              // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Wall037;                                              // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Wall036;                                              // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Wall035;                                              // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Wall034;                                              // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Wall033;                                              // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Wall032;                                              // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Wall031;                                              // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Wall030;                                              // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Wall029;                                              // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Wall028;                                              // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Wall027;                                              // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Wall026;                                              // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Wall025;                                              // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Wall024;                                              // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Wall023;                                              // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Wall022;                                              // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Wall021;                                              // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Wall020;                                              // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Wall019;                                              // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Wall018;                                              // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Wall017;                                              // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Wall016;                                              // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Wall015;                                              // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Wall014;                                              // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* Wall013;                                              // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* Wall012;                                              // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Wall011;                                              // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Wall010;                                              // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Wall09;                                               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Wall08;                                               // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Wall07;                                               // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Wall06;                                               // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Wall05;                                               // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Wall04;                                               // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Wall03;                                               // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Wall02;                                               // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Wall01;                                               // 0x0508 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x36;                      // 0x0510 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x35;                      // 0x0518 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x34;                      // 0x0520 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x33;                      // 0x0528 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x32;                      // 0x0530 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x31;                      // 0x0538 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x30;                      // 0x0540 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x29;                      // 0x0548 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x28;                      // 0x0550 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x27;                      // 0x0558 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x25;                      // 0x0560 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform15x26;                      // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Entrance04;                                           // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Entrance03;                                           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Entrance02;                                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Entrance01;                                           // 0x0588 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0590 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0598 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x05A0 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x05A8 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x05B0 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x05B8 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x05C0 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x05C8 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x05D0 (size: 0x8)
    class UArrowComponent* -X Marker;                                                 // 0x05D8 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x05E0 (size: 0x8)
    class UArrowComponent* +Y Marker;                                                 // 0x05E8 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x05F0 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x05F8 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0608 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0610 (size: 0x8)

}; // Size: 0x618

#endif
