#ifndef UE4SS_SDK_BPUnderworldDynamicModuleEnd01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleEnd01_HPP

class ABPUnderworldDynamicModuleEnd01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UChildActorComponent* LoreStatue;                                           // 0x02B0 (size: 0x8)
    class UVisLoreVolumeComponent* VisLoreVolume;                                     // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike15;                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike14;                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike13;                            // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike12;                            // 0x02D8 (size: 0x8)
    class UNiagaraComponent* GraveThrush2;                                            // 0x02E0 (size: 0x8)
    class UNiagaraComponent* GraveThrush1;                                            // 0x02E8 (size: 0x8)
    class UNiagaraComponent* GraveThrush;                                             // 0x02F0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue1;                                  // 0x02F8 (size: 0x8)
    class UPointLightComponent* Fill Light 013;                                       // 0x0300 (size: 0x8)
    class UAudioComponent* GraveThrushIdle01;                                         // 0x0308 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x0310 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x0318 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x0320 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x0328 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Props084;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Props083;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Props082;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Props081;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Props080;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Props079;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Props078;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Props077;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Props076;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Props075;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Props074;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Props073;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Props072;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Props071;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Props070;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Props069;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Props040;                                             // 0x03B8 (size: 0x8)
    class UPointLightComponent* Fill Light 012;                                       // 0x03C0 (size: 0x8)
    class UPointLightComponent* Fill Light 011;                                       // 0x03C8 (size: 0x8)
    class UPointLightComponent* Fill Light 010;                                       // 0x03D0 (size: 0x8)
    class UPointLightComponent* Fill Light 09;                                        // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* RockFloor030;                                         // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* RockFloor029;                                         // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike11;                            // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike10;                            // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike9;                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike8;                             // 0x0408 (size: 0x8)
    class UCustomNavmeshVolumeComponent* CustomNavmeshVolume;                         // 0x0410 (size: 0x8)
    class UDecalComponent* Decal049;                                                  // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Props068;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Props067;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Props066;                                             // 0x0430 (size: 0x8)
    class UDecalComponent* Decal048;                                                  // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Props065;                                             // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Props064;                                             // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Props063;                                             // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Props062;                                             // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Props061;                                             // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Props060;                                             // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Props059;                                             // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Props058;                                             // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Props057;                                             // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Props056;                                             // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Props055;                                             // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Props054;                                             // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Props053;                                             // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* Props052;                                             // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* Props051;                                             // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Props050;                                             // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Props049;                                             // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Props048;                                             // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Props047;                                             // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Props046;                                             // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Props044;                                             // 0x04E0 (size: 0x8)
    class UChildActorComponent* Props045;                                             // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Props043;                                             // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Props042;                                             // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Props041;                                             // 0x0500 (size: 0x8)
    class UDecalComponent* Decal047;                                                  // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Props039;                                             // 0x0510 (size: 0x8)
    class UStaticMeshComponent* Props038;                                             // 0x0518 (size: 0x8)
    class UStaticMeshComponent* Props037;                                             // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Props036;                                             // 0x0528 (size: 0x8)
    class UChildActorComponent* Props035;                                             // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Props034;                                             // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Props033;                                             // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Props032;                                             // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Props031;                                             // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Props030;                                             // 0x0558 (size: 0x8)
    class UChildActorComponent* Props029;                                             // 0x0560 (size: 0x8)
    class UChildActorComponent* Props028;                                             // 0x0568 (size: 0x8)
    class UChildActorComponent* Props027;                                             // 0x0570 (size: 0x8)
    class UChildActorComponent* Props026;                                             // 0x0578 (size: 0x8)
    class UChildActorComponent* Props025;                                             // 0x0580 (size: 0x8)
    class UChildActorComponent* Props024;                                             // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Props023;                                             // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Props022;                                             // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Props021;                                             // 0x05A0 (size: 0x8)
    class UDecalComponent* Decal046;                                                  // 0x05A8 (size: 0x8)
    class UChildActorComponent* Props020;                                             // 0x05B0 (size: 0x8)
    class UChildActorComponent* Props019;                                             // 0x05B8 (size: 0x8)
    class UChildActorComponent* Props018;                                             // 0x05C0 (size: 0x8)
    class UChildActorComponent* Props017;                                             // 0x05C8 (size: 0x8)
    class UChildActorComponent* Props016;                                             // 0x05D0 (size: 0x8)
    class UChildActorComponent* Props015;                                             // 0x05D8 (size: 0x8)
    class UChildActorComponent* Props014;                                             // 0x05E0 (size: 0x8)
    class UChildActorComponent* Props013;                                             // 0x05E8 (size: 0x8)
    class UChildActorComponent* Props012;                                             // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Props011;                                             // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Props010;                                             // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Props09;                                              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Props08;                                              // 0x0610 (size: 0x8)
    class UDecalComponent* Decal045;                                                  // 0x0618 (size: 0x8)
    class UDecalComponent* Decal044;                                                  // 0x0620 (size: 0x8)
    class UDecalComponent* Decal043;                                                  // 0x0628 (size: 0x8)
    class UDecalComponent* Decal042;                                                  // 0x0630 (size: 0x8)
    class UDecalComponent* Decal041;                                                  // 0x0638 (size: 0x8)
    class UDecalComponent* Decal040;                                                  // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Props07;                                              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Props06;                                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Props05;                                              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Props04;                                              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Props03;                                              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* RockWall0143;                                         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* RockWall0142;                                         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* RockWall0141;                                         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* RockWall0140;                                         // 0x0688 (size: 0x8)
    class UStaticMeshComponent* RockWall0139;                                         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* RockWall0138;                                         // 0x0698 (size: 0x8)
    class UStaticMeshComponent* RockWall0137;                                         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* RockWall0136;                                         // 0x06A8 (size: 0x8)
    class UDecalComponent* Decal039;                                                  // 0x06B0 (size: 0x8)
    class UDecalComponent* Decal038;                                                  // 0x06B8 (size: 0x8)
    class UDecalComponent* Decal037;                                                  // 0x06C0 (size: 0x8)
    class UDecalComponent* Decal036;                                                  // 0x06C8 (size: 0x8)
    class UDecalComponent* Decal035;                                                  // 0x06D0 (size: 0x8)
    class UDecalComponent* Decal034;                                                  // 0x06D8 (size: 0x8)
    class UDecalComponent* Decal033;                                                  // 0x06E0 (size: 0x8)
    class UDecalComponent* Decal032;                                                  // 0x06E8 (size: 0x8)
    class UDecalComponent* Decal031;                                                  // 0x06F0 (size: 0x8)
    class UDecalComponent* Decal030;                                                  // 0x06F8 (size: 0x8)
    class UDecalComponent* Decal029;                                                  // 0x0700 (size: 0x8)
    class UDecalComponent* Decal028;                                                  // 0x0708 (size: 0x8)
    class UDecalComponent* Decal027;                                                  // 0x0710 (size: 0x8)
    class UDecalComponent* Decal026;                                                  // 0x0718 (size: 0x8)
    class UDecalComponent* Decal025;                                                  // 0x0720 (size: 0x8)
    class UDecalComponent* Decal024;                                                  // 0x0728 (size: 0x8)
    class UDecalComponent* Decal023;                                                  // 0x0730 (size: 0x8)
    class UDecalComponent* Decal022;                                                  // 0x0738 (size: 0x8)
    class UDecalComponent* Decal021;                                                  // 0x0740 (size: 0x8)
    class UDecalComponent* Decal020;                                                  // 0x0748 (size: 0x8)
    class UDecalComponent* Decal019;                                                  // 0x0750 (size: 0x8)
    class UDecalComponent* Decal018;                                                  // 0x0758 (size: 0x8)
    class UDecalComponent* Decal017;                                                  // 0x0760 (size: 0x8)
    class UDecalComponent* Decal016;                                                  // 0x0768 (size: 0x8)
    class UStaticMeshComponent* RockFloor028;                                         // 0x0770 (size: 0x8)
    class UDecalComponent* Decal015;                                                  // 0x0778 (size: 0x8)
    class UDecalComponent* Decal014;                                                  // 0x0780 (size: 0x8)
    class UDecalComponent* Decal013;                                                  // 0x0788 (size: 0x8)
    class UDecalComponent* Decal012;                                                  // 0x0790 (size: 0x8)
    class UDecalComponent* Decal011;                                                  // 0x0798 (size: 0x8)
    class UDecalComponent* Decal010;                                                  // 0x07A0 (size: 0x8)
    class UDecalComponent* Decal09;                                                   // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* Props02;                                              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* Props01;                                              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* RockFloor027;                                         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* RockFloor026;                                         // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* RockFloor025;                                         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* RockFloor024;                                         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* RockFloor023;                                         // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* RockFloor022;                                         // 0x07E8 (size: 0x8)
    class UDecalComponent* Decal08;                                                   // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* RockFloor021;                                         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* RockFloor020;                                         // 0x0800 (size: 0x8)
    class UDecalComponent* Decal07;                                                   // 0x0808 (size: 0x8)
    class UDecalComponent* Decal06;                                                   // 0x0810 (size: 0x8)
    class UDecalComponent* Decal05;                                                   // 0x0818 (size: 0x8)
    class UDecalComponent* Decal04;                                                   // 0x0820 (size: 0x8)
    class UDecalComponent* Decal03;                                                   // 0x0828 (size: 0x8)
    class UDecalComponent* Decal02;                                                   // 0x0830 (size: 0x8)
    class UDecalComponent* Decal01;                                                   // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RockWall0135;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* RockWall0134;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* RockWall0133;                                         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RockWall0132;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* RockWall0131;                                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* RockWall0130;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* RockWall0129;                                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RockWall0128;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* RockWall0127;                                         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* RockWall0126;                                         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* RockWall0125;                                         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* RockWall0124;                                         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* RockWall0123;                                         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* RockWall0122;                                         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* RockWall0121;                                         // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* RockWall0120;                                         // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* RockWall0119;                                         // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* RockWall0118;                                         // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* RockWall0117;                                         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* RockWall0116;                                         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* RockWall0115;                                         // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* RockWall0114;                                         // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* RockWall0113;                                         // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* RockWall0112;                                         // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* RockWall0111;                                         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* RockWall0110;                                         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* RockWall0109;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* RockWall0108;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* RockWall0107;                                         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* RockWall0106;                                         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* RockWall0105;                                         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* RockWall0104;                                         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* RockWall0103;                                         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform3;                          // 0x0948 (size: 0x8)
    class UStaticMeshComponent* RockWall0102;                                         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* RockWall0101;                                         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* RockWall0100;                                         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* RockWall099;                                          // 0x0968 (size: 0x8)
    class UStaticMeshComponent* RockWall098;                                          // 0x0970 (size: 0x8)
    class UStaticMeshComponent* RockWall097;                                          // 0x0978 (size: 0x8)
    class UStaticMeshComponent* RockWall096;                                          // 0x0980 (size: 0x8)
    class UStaticMeshComponent* RockWall095;                                          // 0x0988 (size: 0x8)
    class UStaticMeshComponent* RockWall094;                                          // 0x0990 (size: 0x8)
    class UStaticMeshComponent* RockWall093;                                          // 0x0998 (size: 0x8)
    class UStaticMeshComponent* RockWall092;                                          // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* RockWall091;                                          // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* RockWall090;                                          // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* RockWall089;                                          // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* RockWall088;                                          // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* RockWall087;                                          // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* RockWall086;                                          // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* RockWall085;                                          // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* RockWall084;                                          // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* RockWall083;                                          // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* RockWall082;                                          // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* RockWall081;                                          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* RockWall080;                                          // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* RockFloor019;                                         // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* RockFloor018;                                         // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* RockWall079;                                          // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike7;                             // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike6;                             // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike5;                             // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike4;                             // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike3;                             // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike2;                             // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldSpike1;                             // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* RockFloor017;                                         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* RockFloor016;                                         // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* RockFloor015;                                         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* RockFloor014;                                         // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* RockFloor013;                                         // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* RockFloor012;                                         // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* RockFloor011;                                         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* RockFloor010;                                         // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* RockFloor09;                                          // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* RockFloor08;                                          // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* RockFloor07;                                          // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* RockFloor06;                                          // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* RockFloor05;                                          // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* RockFloor04;                                          // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* RockFloor03;                                          // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* RockFloor02;                                          // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* RockFloor01;                                          // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* RockWall078;                                          // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* RockWall077;                                          // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* RockWall076;                                          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* RockWall075;                                          // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* RockWall074;                                          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* RockWall073;                                          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* RockWall072;                                          // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* RockWall071;                                          // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* RockWall070;                                          // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* RockWall069;                                          // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* RockWall068;                                          // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* RockWall067;                                          // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* RockWall066;                                          // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* RockWall065;                                          // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* RockWall064;                                          // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* RockWall063;                                          // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* RockWall062;                                          // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* RockWall061;                                          // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* RockWall060;                                          // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* RockWall059;                                          // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* RockWall058;                                          // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* RockWall057;                                          // 0x0B88 (size: 0x8)
    class UStaticMeshComponent* RockWall056;                                          // 0x0B90 (size: 0x8)
    class UStaticMeshComponent* RockWall055;                                          // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* RockWall054;                                          // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* RockWall053;                                          // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* RockWall052;                                          // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* RockWall051;                                          // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* RockWall050;                                          // 0x0BC0 (size: 0x8)
    class UStaticMeshComponent* RockWall049;                                          // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* RockWall048;                                          // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* RockWall047;                                          // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* RockWall046;                                          // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* RockWall045;                                          // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* RockWall044;                                          // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* RockWall043;                                          // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* RockWall042;                                          // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* RockWall041;                                          // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* RockWall040;                                          // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* RockWall039;                                          // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* RockWall038;                                          // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* RockWall037;                                          // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* RockWall036;                                          // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* RockWall035;                                          // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* RockWall034;                                          // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* RockWall033;                                          // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* RockWall032;                                          // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* RockWall031;                                          // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* RockWall030;                                          // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* RockWall029;                                          // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* RockWall028;                                          // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* RockWall027;                                          // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* RockWall026;                                          // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* RockWall025;                                          // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* RockWall024;                                          // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* RockWall023;                                          // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* RockWall022;                                          // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* RockWall021;                                          // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* RockWall020;                                          // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* RockWall019;                                          // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* RockWall018;                                          // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* RockWall017;                                          // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* RockWall016;                                          // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* RockWall015;                                          // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* RockWall014;                                          // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* RockWall013;                                          // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* RockWall012;                                          // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* RockWall011;                                          // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* RockWall010;                                          // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* RockWall09;                                           // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* RockWall08;                                           // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* RockWall07;                                           // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* RockWall06;                                           // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* RockWall05;                                           // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* RockWall04;                                           // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* RockWall03;                                           // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* RockWall02;                                           // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* RockWall01;                                           // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform2;                          // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform1;                          // 0x0D58 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0D60 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0D68 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0D70 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0D78 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0D80 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0D88 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0D90 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0D98 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0DA0 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0DA8 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0DB0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0DB8 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0DC0 (size: 0x8)

}; // Size: 0xDC8

#endif
