#ifndef UE4SS_SDK_BPUnderworldDynamicModuleCorner02_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleCorner02_HPP

class ABPUnderworldDynamicModuleCorner02_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UStaticMeshComponent* Props034;                                             // 0x02B0 (size: 0x8)
    class UChildActorComponent* Props037;                                             // 0x02B8 (size: 0x8)
    class UChildActorComponent* Props036;                                             // 0x02C0 (size: 0x8)
    class UChildActorComponent* Props035;                                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A139;                       // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A138;                       // 0x02D8 (size: 0x8)
    class UDecalComponent* Decal089;                                                  // 0x02E0 (size: 0x8)
    class UDecalComponent* Decal088;                                                  // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk034;                                        // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* Props033;                                             // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Props032;                                             // 0x0300 (size: 0x8)
    class UStaticMeshComponent* Props031;                                             // 0x0308 (size: 0x8)
    class UDecalComponent* Decal087;                                                  // 0x0310 (size: 0x8)
    class UStaticMeshComponent* Props030;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Props029;                                             // 0x0320 (size: 0x8)
    class UStaticMeshComponent* Props028;                                             // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Props027;                                             // 0x0330 (size: 0x8)
    class UDecalComponent* Decal086;                                                  // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Props026;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Props025;                                             // 0x0348 (size: 0x8)
    class UDecalComponent* Decal085;                                                  // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Props024;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Props023;                                             // 0x0360 (size: 0x8)
    class UDecalComponent* Decal084;                                                  // 0x0368 (size: 0x8)
    class UDecalComponent* Decal083;                                                  // 0x0370 (size: 0x8)
    class UDecalComponent* Decal082;                                                  // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Props022;                                             // 0x0380 (size: 0x8)
    class UDecalComponent* Decal081;                                                  // 0x0388 (size: 0x8)
    class UDecalComponent* Decal080;                                                  // 0x0390 (size: 0x8)
    class UDecalComponent* Decal079;                                                  // 0x0398 (size: 0x8)
    class UDecalComponent* Decal078;                                                  // 0x03A0 (size: 0x8)
    class UDecalComponent* Decal077;                                                  // 0x03A8 (size: 0x8)
    class UDecalComponent* Decal076;                                                  // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Props021;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Props020;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Props019;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Props018;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Props017;                                             // 0x03D8 (size: 0x8)
    class UDecalComponent* Decal075;                                                  // 0x03E0 (size: 0x8)
    class UDecalComponent* Decal074;                                                  // 0x03E8 (size: 0x8)
    class UDecalComponent* Decal073;                                                  // 0x03F0 (size: 0x8)
    class UDecalComponent* Decal072;                                                  // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Props016;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Props015;                                             // 0x0408 (size: 0x8)
    class UDecalComponent* Decal071;                                                  // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Gobo02;                                               // 0x0418 (size: 0x8)
    class USpotLightComponent* Support Light2;                                        // 0x0420 (size: 0x8)
    class UDecalComponent* Decal070;                                                  // 0x0428 (size: 0x8)
    class UDecalComponent* Decal069;                                                  // 0x0430 (size: 0x8)
    class UDecalComponent* Decal068;                                                  // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Props014;                                             // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Props013;                                             // 0x0448 (size: 0x8)
    class UDecalComponent* Decal067;                                                  // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Props012;                                             // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Props011;                                             // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Props010;                                             // 0x0468 (size: 0x8)
    class UPointLightComponent* Fill Light 07;                                        // 0x0470 (size: 0x8)
    class UPointLightComponent* Fill Light 08;                                        // 0x0478 (size: 0x8)
    class UPointLightComponent* Fill Light 05;                                        // 0x0480 (size: 0x8)
    class UPointLightComponent* Fill Light 09;                                        // 0x0488 (size: 0x8)
    class UPointLightComponent* Fill Light 06;                                        // 0x0490 (size: 0x8)
    class UPointLightComponent* Fill Light 04;                                        // 0x0498 (size: 0x8)
    class UPointLightComponent* Fill Light 02;                                        // 0x04A0 (size: 0x8)
    class UPointLightComponent* Fill Light 03;                                        // 0x04A8 (size: 0x8)
    class UPointLightComponent* Fill Light 010;                                       // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A137;                       // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A136;                       // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A135;                       // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A134;                       // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A133;                       // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A132;                       // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A131;                       // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A130;                       // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A42;                        // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A129;                       // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Gobo01;                                               // 0x0508 (size: 0x8)
    class USpotLightComponent* Support Light;                                         // 0x0510 (size: 0x8)
    class UStaticMeshComponent* FloorChunk033;                                        // 0x0518 (size: 0x8)
    class UStaticMeshComponent* FloorChunk032;                                        // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Props09;                                              // 0x0528 (size: 0x8)
    class UDecalComponent* Decal066;                                                  // 0x0530 (size: 0x8)
    class UDecalComponent* Decal065;                                                  // 0x0538 (size: 0x8)
    class UDecalComponent* Decal064;                                                  // 0x0540 (size: 0x8)
    class UDecalComponent* Decal063;                                                  // 0x0548 (size: 0x8)
    class UDecalComponent* Decal062;                                                  // 0x0550 (size: 0x8)
    class UDecalComponent* Decal061;                                                  // 0x0558 (size: 0x8)
    class UDecalComponent* Decal060;                                                  // 0x0560 (size: 0x8)
    class UStaticMeshComponent* FloorChunk031;                                        // 0x0568 (size: 0x8)
    class UStaticMeshComponent* FloorChunk030;                                        // 0x0570 (size: 0x8)
    class UStaticMeshComponent* FloorChunk029;                                        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* FloorChunk028;                                        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* FloorChunk027;                                        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* FloorChunk026;                                        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* FloorChunk025;                                        // 0x0598 (size: 0x8)
    class UStaticMeshComponent* FloorChunk024;                                        // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk023;                                        // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk022;                                        // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk021;                                        // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk020;                                        // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk019;                                        // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk018;                                        // 0x05D0 (size: 0x8)
    class UDecalComponent* Decal059;                                                  // 0x05D8 (size: 0x8)
    class UDecalComponent* Decal058;                                                  // 0x05E0 (size: 0x8)
    class UDecalComponent* Decal057;                                                  // 0x05E8 (size: 0x8)
    class UDecalComponent* Decal056;                                                  // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* Props08;                                              // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Props07;                                              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Props06;                                              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Props05;                                              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Props04;                                              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Props03;                                              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Props02;                                              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Props01;                                              // 0x0630 (size: 0x8)
    class UCustomNavmeshVolumeComponent* CustomNavmeshVolume;                         // 0x0638 (size: 0x8)
    class UDecalComponent* Decal055;                                                  // 0x0640 (size: 0x8)
    class UDecalComponent* Decal054;                                                  // 0x0648 (size: 0x8)
    class UDecalComponent* Decal053;                                                  // 0x0650 (size: 0x8)
    class UDecalComponent* Decal052;                                                  // 0x0658 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A128;                       // 0x0660 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal01;                                    // 0x0668 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x0670 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x0678 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x0680 (size: 0x8)
    class UStaticMeshComponent* FloorChunk017;                                        // 0x0688 (size: 0x8)
    class UStaticMeshComponent* FloorChunk016;                                        // 0x0690 (size: 0x8)
    class UChildActorComponent* ChildActorBat;                                        // 0x0698 (size: 0x8)
    class UChildActorComponent* ChildActorIronPile;                                   // 0x06A0 (size: 0x8)
    class UChildActorComponent* ChildActorStonePile;                                  // 0x06A8 (size: 0x8)
    class UChildActorComponent* ChildActorWolfElite;                                  // 0x06B0 (size: 0x8)
    class UBoxComponent* EntranceCollision;                                           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk015;                                        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A127;                       // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A126;                       // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A125;                       // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A124;                       // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A123;                       // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A122;                       // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A121;                       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A120;                       // 0x0700 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A119;                       // 0x0708 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A118;                       // 0x0710 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A117;                       // 0x0718 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A116;                       // 0x0720 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A115;                       // 0x0728 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A114;                       // 0x0730 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A113;                       // 0x0738 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A112;                       // 0x0740 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A111;                       // 0x0748 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A110;                       // 0x0750 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A109;                       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A108;                       // 0x0760 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A107;                       // 0x0768 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A106;                       // 0x0770 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A105;                       // 0x0778 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A104;                       // 0x0780 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A103;                       // 0x0788 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A102;                       // 0x0790 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A101;                       // 0x0798 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A100;                       // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A99;                        // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A98;                        // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A97;                        // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A96;                        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A95;                        // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A94;                        // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A93;                        // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A92;                        // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A91;                        // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A90;                        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A89;                        // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A88;                        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A87;                        // 0x0808 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A86;                        // 0x0810 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A85;                        // 0x0818 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A84;                        // 0x0820 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A83;                        // 0x0828 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A82;                        // 0x0830 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A81;                        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A80;                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A79;                        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A78;                        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A77;                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A76;                        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A75;                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A74;                        // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A70;                        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A73;                        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A72;                        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A71;                        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A69;                        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A68;                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk014;                                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk013;                                        // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* FloorChunk012;                                        // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* FloorChunk011;                                        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x08C8 (size: 0x8)
    class USpotLightComponent* Key Light;                                             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Exterior Light Plane;                                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A67;                        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A66;                        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A65;                        // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A64;                        // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A63;                        // 0x0900 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A62;                        // 0x0908 (size: 0x8)
    class UStaticMeshComponent* FloorChunk010;                                        // 0x0910 (size: 0x8)
    class UChildActorComponent* ChildActorWorldEntrance;                              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A61;                        // 0x0920 (size: 0x8)
    class UDecalComponent* Decal051;                                                  // 0x0928 (size: 0x8)
    class UStaticMeshComponent* FloorChunk09;                                         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* FloorChunk08;                                         // 0x0938 (size: 0x8)
    class UDecalComponent* Decal050;                                                  // 0x0940 (size: 0x8)
    class UDecalComponent* Decal048;                                                  // 0x0948 (size: 0x8)
    class UDecalComponent* Decal049;                                                  // 0x0950 (size: 0x8)
    class UStaticMeshComponent* FloorChunk07;                                         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* FloorChunk06;                                         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* FloorChunk05;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* FloorChunk04;                                         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* FloorChunk03;                                         // 0x0978 (size: 0x8)
    class UStaticMeshComponent* FloorChunk02;                                         // 0x0980 (size: 0x8)
    class UStaticMeshComponent* FloorChunk01;                                         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A60;                        // 0x0990 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A59;                        // 0x0998 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A58;                        // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A57;                        // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A56;                        // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A55;                        // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A54;                        // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A53;                        // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A52;                        // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A51;                        // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A50;                        // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A49;                        // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A48;                        // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A47;                        // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A46;                        // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A45;                        // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A44;                        // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A43;                        // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A41;                        // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A40;                        // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A39;                        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A38;                        // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A37;                        // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A36;                        // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A35;                        // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A34;                        // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A33;                        // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A32;                        // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A31;                        // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A30;                        // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A29;                        // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A28;                        // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A27;                        // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A26;                        // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A25;                        // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A24;                        // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A23;                        // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A22;                        // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A21;                        // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A20;                        // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A19;                        // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A18;                        // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A17;                        // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A16;                        // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A15;                        // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A14;                        // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A13;                        // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A12;                        // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A11;                        // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A10;                        // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A9;                         // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A8;                         // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A7;                         // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A6;                         // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A5;                         // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A4;                         // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A3;                         // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A2;                         // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A1;                         // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworld10x20x60A;                          // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0B70 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0B78 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0B80 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0B88 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0B90 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0B98 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0BA0 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0BA8 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0BB0 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0BB8 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x0BC0 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0BC8 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0BD0 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0BD8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0BE0 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0BE8 (size: 0x8)

}; // Size: 0xBF0

#endif
