#ifndef UE4SS_SDK_BPUnderworldDynamicModuleEnd02_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleEnd02_HPP

class ABPUnderworldDynamicModuleEnd02_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UDecalComponent* DirtDecal06;                                               // 0x02B0 (size: 0x8)
    class UDecalComponent* DirtDecal05;                                               // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Wall0136;                                             // 0x02C0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron4;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Wall0135;                                             // 0x02D0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x02D8 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x02E0 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x02E8 (size: 0x8)
    class UChildActorComponent* ChildActorIronPile;                                   // 0x02F0 (size: 0x8)
    class UChildActorComponent* ChildActorBat;                                        // 0x02F8 (size: 0x8)
    class UChildActorComponent* ChildActorStonePile;                                  // 0x0300 (size: 0x8)
    class UChildActorComponent* ChildActorWolfElite;                                  // 0x0308 (size: 0x8)
    class UDecalComponent* DirtDecal04;                                               // 0x0310 (size: 0x8)
    class UDecalComponent* DirtDecal03;                                               // 0x0318 (size: 0x8)
    class UDecalComponent* DirtDecal02;                                               // 0x0320 (size: 0x8)
    class UDecalComponent* DirtDecal01;                                               // 0x0328 (size: 0x8)
    class UStaticMeshComponent* Wall0134;                                             // 0x0330 (size: 0x8)
    class UStaticMeshComponent* Wall0133;                                             // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Wall0132;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Wall0131;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Wall0130;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Wall0129;                                             // 0x0358 (size: 0x8)
    class UStaticMeshComponent* Wall0128;                                             // 0x0360 (size: 0x8)
    class UStaticMeshComponent* Wall0127;                                             // 0x0368 (size: 0x8)
    class UStaticMeshComponent* Wall0126;                                             // 0x0370 (size: 0x8)
    class UStaticMeshComponent* Wall0125;                                             // 0x0378 (size: 0x8)
    class UStaticMeshComponent* Wall0124;                                             // 0x0380 (size: 0x8)
    class UStaticMeshComponent* Wall0123;                                             // 0x0388 (size: 0x8)
    class UStaticMeshComponent* Wall0122;                                             // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Wall0121;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Wall0120;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Wall0119;                                             // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* Wall0118;                                             // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Wall0117;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* Wall0116;                                             // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* Wall0115;                                             // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* Wall0114;                                             // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* Wall0113;                                             // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* Wall0112;                                             // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* Wall0111;                                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* Wall0110;                                             // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* Wall0109;                                             // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* Wall0108;                                             // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Wall0107;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Wall0106;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Wall0105;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Wall0104;                                             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Wall0103;                                             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Wall0102;                                             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Wall0101;                                             // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Wall0100;                                             // 0x0440 (size: 0x8)
    class UStaticMeshComponent* Wall099;                                              // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Wall098;                                              // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Wall097;                                              // 0x0458 (size: 0x8)
    class UStaticMeshComponent* Wall096;                                              // 0x0460 (size: 0x8)
    class UStaticMeshComponent* Wall095;                                              // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Wall094;                                              // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Wall093;                                              // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Wall092;                                              // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Wall091;                                              // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Wall090;                                              // 0x0490 (size: 0x8)
    class UStaticMeshComponent* Wall089;                                              // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Wall088;                                              // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* Wall087;                                              // 0x04A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* Wall086;                                              // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Exterior Light Plane;                                 // 0x04C0 (size: 0x8)
    class USpotLightComponent* Key Light;                                             // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Wall085;                                              // 0x04D0 (size: 0x8)
    class UBoxComponent* EntranceCollision;                                           // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Wall084;                                              // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* Wall083;                                              // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Wall082;                                              // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* Wall081;                                              // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Wall080;                                              // 0x0500 (size: 0x8)
    class UStaticMeshComponent* Wall079;                                              // 0x0508 (size: 0x8)
    class UStaticMeshComponent* Wall078;                                              // 0x0510 (size: 0x8)
    class UStaticMeshComponent* Wall077;                                              // 0x0518 (size: 0x8)
    class UStaticMeshComponent* Wall076;                                              // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Wall075;                                              // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Wall074;                                              // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Wall073;                                              // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Wall072;                                              // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Wall071;                                              // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Wall070;                                              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* Wall069;                                              // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Wall068;                                              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Wall067;                                              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Wall066;                                              // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Wall065;                                              // 0x0578 (size: 0x8)
    class UStaticMeshComponent* Wall064;                                              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Wall063;                                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Wall062;                                              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* Wall061;                                              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* Wall060;                                              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* Wall059;                                              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Wall058;                                              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Wall057;                                              // 0x05B8 (size: 0x8)
    class UChildActorComponent* ChildActorWorldEntrance;                              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform8;                          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform7;                          // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform6;                          // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform5;                          // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform4;                          // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform3;                          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* RockWallUnderworldPlatform2;                          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* Wall056;                                              // 0x0600 (size: 0x8)
    class UStaticMeshComponent* Wall055;                                              // 0x0608 (size: 0x8)
    class UStaticMeshComponent* Wall054;                                              // 0x0610 (size: 0x8)
    class UStaticMeshComponent* Wall053;                                              // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Wall052;                                              // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Wall051;                                              // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Wall050;                                              // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Wall049;                                              // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Wall048;                                              // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Wall047;                                              // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Wall046;                                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Wall045;                                              // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Wall044;                                              // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Wall043;                                              // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Wall042;                                              // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Wall041;                                              // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Wall040;                                              // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Wall039;                                              // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Wall038;                                              // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Wall037;                                              // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Wall036;                                              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Wall035;                                              // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Wall034;                                              // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Wall033;                                              // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Wall032;                                              // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* Wall031;                                              // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* Wall030;                                              // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* Wall029;                                              // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* Wall028;                                              // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* Wall027;                                              // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* Wall026;                                              // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Wall025;                                              // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Wall024;                                              // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Wall023;                                              // 0x0708 (size: 0x8)
    class UStaticMeshComponent* Wall022;                                              // 0x0710 (size: 0x8)
    class UStaticMeshComponent* Wall021;                                              // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Wall020;                                              // 0x0720 (size: 0x8)
    class UStaticMeshComponent* Wall019;                                              // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Wall017;                                              // 0x0730 (size: 0x8)
    class UStaticMeshComponent* Wall016;                                              // 0x0738 (size: 0x8)
    class UStaticMeshComponent* Wall015;                                              // 0x0740 (size: 0x8)
    class UStaticMeshComponent* Wall014;                                              // 0x0748 (size: 0x8)
    class UStaticMeshComponent* Wall013;                                              // 0x0750 (size: 0x8)
    class UStaticMeshComponent* Wall012;                                              // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Wall011;                                              // 0x0760 (size: 0x8)
    class UStaticMeshComponent* Wall010;                                              // 0x0768 (size: 0x8)
    class UStaticMeshComponent* Wall09;                                               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* Wall08;                                               // 0x0778 (size: 0x8)
    class UStaticMeshComponent* Wall07;                                               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* Wall06;                                               // 0x0788 (size: 0x8)
    class UStaticMeshComponent* Wall05;                                               // 0x0790 (size: 0x8)
    class UStaticMeshComponent* Wall04;                                               // 0x0798 (size: 0x8)
    class UStaticMeshComponent* Wall03;                                               // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Wall02;                                               // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* Wall01;                                               // 0x07B0 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x07B8 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x07C0 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x07C8 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x07D0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x07D8 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x07E0 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x07E8 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x07F0 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x07F8 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0800 (size: 0x8)
    class UBoxComponent* NavigationModifierBox;                                       // 0x0808 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0818 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0820 (size: 0x8)

}; // Size: 0x828

#endif
