#ifndef UE4SS_SDK_BPUnderworldDynamicModuleBranch01_HPP
#define UE4SS_SDK_BPUnderworldDynamicModuleBranch01_HPP

class ABPUnderworldDynamicModuleBranch01_C : public ABPUnderworldModuleDynamicPrefab_C
{
    class UChildActorComponent* ChildActorWolfElite;                                  // 0x02B0 (size: 0x8)
    class UChildActorComponent* ChildActorStonePile;                                  // 0x02B8 (size: 0x8)
    class UChildActorComponent* ChildActorIronPile;                                   // 0x02C0 (size: 0x8)
    class UChildActorComponent* ChildActorBat;                                        // 0x02C8 (size: 0x8)
    class UCustomNavmeshVolumeComponent* CustomNavmeshVolume;                         // 0x02D0 (size: 0x8)
    class UDecalComponent* Decal42;                                                   // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x02E0 (size: 0x8)
    class UDecalComponent* Decal41;                                                   // 0x02E8 (size: 0x8)
    class UDecalComponent* Decal40;                                                   // 0x02F0 (size: 0x8)
    class UDecalComponent* Decal39;                                                   // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* Props050;                                             // 0x0300 (size: 0x8)
    class UChildActorComponent* Props049;                                             // 0x0308 (size: 0x8)
    class UChildActorComponent* Props048;                                             // 0x0310 (size: 0x8)
    class UChildActorComponent* Props047;                                             // 0x0318 (size: 0x8)
    class UStaticMeshComponent* Props046;                                             // 0x0320 (size: 0x8)
    class UChildActorComponent* Props045;                                             // 0x0328 (size: 0x8)
    class UDecalComponent* Decal38;                                                   // 0x0330 (size: 0x8)
    class UDecalComponent* Decal37;                                                   // 0x0338 (size: 0x8)
    class UStaticMeshComponent* Props044;                                             // 0x0340 (size: 0x8)
    class UStaticMeshComponent* Props043;                                             // 0x0348 (size: 0x8)
    class UStaticMeshComponent* Props042;                                             // 0x0350 (size: 0x8)
    class UStaticMeshComponent* Props041;                                             // 0x0358 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x0360 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x0368 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0378 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x0380 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x0388 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x0390 (size: 0x8)
    class UStaticMeshComponent* Props040;                                             // 0x0398 (size: 0x8)
    class UStaticMeshComponent* Props039;                                             // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* Props038;                                             // 0x03A8 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* Props037;                                             // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x03D0 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x03D8 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x03E0 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x03E8 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x03F0 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x03F8 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0400 (size: 0x8)
    class UStaticMeshComponent* Props036;                                             // 0x0408 (size: 0x8)
    class UStaticMeshComponent* Props035;                                             // 0x0410 (size: 0x8)
    class UStaticMeshComponent* Props034;                                             // 0x0418 (size: 0x8)
    class UStaticMeshComponent* Props033;                                             // 0x0420 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Props032;                                             // 0x0430 (size: 0x8)
    class UChildActorComponent* Props031;                                             // 0x0438 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x0440 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x0448 (size: 0x8)
    class UStaticMeshComponent* Props030;                                             // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Props029;                                             // 0x0458 (size: 0x8)
    class UChildActorComponent* Props028;                                             // 0x0460 (size: 0x8)
    class UChildActorComponent* Props027;                                             // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Props026;                                             // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Wall0141;                                             // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Props025;                                             // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Props024;                                             // 0x0488 (size: 0x8)
    class UStaticMeshComponent* Props023;                                             // 0x0490 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0498 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x04A8 (size: 0x8)
    class UChildActorComponent* Props022;                                             // 0x04B0 (size: 0x8)
    class UChildActorComponent* Props021;                                             // 0x04B8 (size: 0x8)
    class UChildActorComponent* Props020;                                             // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Props019;                                             // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Props018;                                             // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Props017;                                             // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Props016;                                             // 0x04E0 (size: 0x8)
    class UChildActorComponent* Props015;                                             // 0x04E8 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x04F0 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x04F8 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0500 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0508 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0510 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0518 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0520 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Props014;                                             // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Props013;                                             // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Props012;                                             // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Props011;                                             // 0x0548 (size: 0x8)
    class UChildActorComponent* Props010;                                             // 0x0550 (size: 0x8)
    class UChildActorComponent* Props09;                                              // 0x0558 (size: 0x8)
    class UChildActorComponent* Props08;                                              // 0x0560 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0568 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0570 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0578 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Props07;                                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* Props06;                                              // 0x0590 (size: 0x8)
    class UChildActorComponent* Props05;                                              // 0x0598 (size: 0x8)
    class UChildActorComponent* Props04;                                              // 0x05A0 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* Props03;                                              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* Props02;                                              // 0x05B8 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Props01;                                              // 0x05C8 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x05D8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x05E0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x05E8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x05F0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x05F8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0600 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0608 (size: 0x8)
    class UChildActorComponent* LatticeMineIron1;                                     // 0x0610 (size: 0x8)
    class UChildActorComponent* LatticeMineIron2;                                     // 0x0618 (size: 0x8)
    class UChildActorComponent* LatticeMineIron3;                                     // 0x0620 (size: 0x8)
    class UChildActorComponent* LatticeMineCoal1;                                     // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Wall0140;                                             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Wall0139;                                             // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Wall0138;                                             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Wall0137;                                             // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Wall0136;                                             // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Wall0135;                                             // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Wall0134;                                             // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Wall0133;                                             // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Wall0132;                                             // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Wall0131;                                             // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Wall0130;                                             // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Wall0129;                                             // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Wall0128;                                             // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Wall0127;                                             // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Wall0126;                                             // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Wall0125;                                             // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Wall0124;                                             // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Wall0123;                                             // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Wall0122;                                             // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* Wall0121;                                             // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* Wall0120;                                             // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* Wall0119;                                             // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* Wall0118;                                             // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* Wall0117;                                             // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* Wall0116;                                             // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* Wall0115;                                             // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Wall0114;                                             // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Wall0113;                                             // 0x0708 (size: 0x8)
    class UStaticMeshComponent* Wall0112;                                             // 0x0710 (size: 0x8)
    class UStaticMeshComponent* Wall0111;                                             // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Wall0110;                                             // 0x0720 (size: 0x8)
    class UStaticMeshComponent* Wall0109;                                             // 0x0728 (size: 0x8)
    class UStaticMeshComponent* Wall0108;                                             // 0x0730 (size: 0x8)
    class UStaticMeshComponent* Wall0107;                                             // 0x0738 (size: 0x8)
    class UStaticMeshComponent* Wall0106;                                             // 0x0740 (size: 0x8)
    class UStaticMeshComponent* Wall0105;                                             // 0x0748 (size: 0x8)
    class UStaticMeshComponent* Wall0104;                                             // 0x0750 (size: 0x8)
    class UStaticMeshComponent* Wall0103;                                             // 0x0758 (size: 0x8)
    class UStaticMeshComponent* Wall0102;                                             // 0x0760 (size: 0x8)
    class UStaticMeshComponent* Wall0101;                                             // 0x0768 (size: 0x8)
    class UStaticMeshComponent* Wall0100;                                             // 0x0770 (size: 0x8)
    class UStaticMeshComponent* Wall099;                                              // 0x0778 (size: 0x8)
    class UStaticMeshComponent* Wall098;                                              // 0x0780 (size: 0x8)
    class UStaticMeshComponent* Wall097;                                              // 0x0788 (size: 0x8)
    class UStaticMeshComponent* Wall096;                                              // 0x0790 (size: 0x8)
    class UStaticMeshComponent* Wall095;                                              // 0x0798 (size: 0x8)
    class UStaticMeshComponent* Wall094;                                              // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Wall093;                                              // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* Wall092;                                              // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* Wall091;                                              // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Wall090;                                              // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Wall089;                                              // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* Wall035;                                              // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* Wall034;                                              // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* Wall015;                                              // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* Wall088;                                              // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* Wall087;                                              // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Wall086;                                              // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Wall085;                                              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Wall084;                                              // 0x0808 (size: 0x8)
    class UStaticMeshComponent* Wall083;                                              // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Wall082;                                              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* Wall081;                                              // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Wall080;                                              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Wall079;                                              // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Wall078;                                              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* Wall077;                                              // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Wall076;                                              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Wall075;                                              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Wall074;                                              // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Wall073;                                              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Wall072;                                              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Wall071;                                              // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Wall070;                                              // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Wall069;                                              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Wall068;                                              // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Wall067;                                              // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Wall066;                                              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Wall065;                                              // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Wall064;                                              // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Wall063;                                              // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Wall062;                                              // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Wall061;                                              // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Wall060;                                              // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* Wall059;                                              // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Wall058;                                              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Wall057;                                              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* Wall056;                                              // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* Wall055;                                              // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* Wall054;                                              // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* Wall053;                                              // 0x0900 (size: 0x8)
    class UStaticMeshComponent* Wall052;                                              // 0x0908 (size: 0x8)
    class UStaticMeshComponent* Wall051;                                              // 0x0910 (size: 0x8)
    class UStaticMeshComponent* Wall050;                                              // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Wall049;                                              // 0x0920 (size: 0x8)
    class UStaticMeshComponent* Wall048;                                              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Wall047;                                              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Wall046;                                              // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Wall045;                                              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Wall044;                                              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Wall043;                                              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Wall042;                                              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Wall041;                                              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Wall040;                                              // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Wall039;                                              // 0x0970 (size: 0x8)
    class UStaticMeshComponent* Wall038;                                              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* Wall037;                                              // 0x0980 (size: 0x8)
    class UStaticMeshComponent* Wall036;                                              // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Wall033;                                              // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Wall032;                                              // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Wall031;                                              // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Wall030;                                              // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Wall029;                                              // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Wall028;                                              // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Wall027;                                              // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Wall026;                                              // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Wall025;                                              // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Wall024;                                              // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Wall023;                                              // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Wall022;                                              // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Wall021;                                              // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Wall020;                                              // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Wall019;                                              // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Wall018;                                              // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Wall017;                                              // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Wall016;                                              // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* Wall014;                                              // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* Wall013;                                              // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* Wall012;                                              // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Wall011;                                              // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* Wall010;                                              // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* Wall09;                                               // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* Wall08;                                               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* Wall07;                                               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* Wall06;                                               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* Wall05;                                               // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* Wall04;                                               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* Wall03;                                               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* Wall02;                                               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* Wall01;                                               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0AD0 (size: 0x8)
    class USceneComponent* Water;                                                     // 0x0AD8 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0AE0 (size: 0x8)
    class USceneComponent* Walls;                                                     // 0x0AE8 (size: 0x8)
    class USceneComponent* Custom Components;                                         // 0x0AF0 (size: 0x8)
    class UAudioComponent* AmbientUnderworld01_cue;                                   // 0x0AF8 (size: 0x8)
    class USceneComponent* Audio;                                                     // 0x0B00 (size: 0x8)
    class UNiagaraComponent* Dust;                                                    // 0x0B08 (size: 0x8)
    class USceneComponent* Visual FX;                                                 // 0x0B10 (size: 0x8)
    class USceneComponent* Static Meshes;                                             // 0x0B18 (size: 0x8)
    class UArrowComponent* -X Marker;                                                 // 0x0B20 (size: 0x8)
    class UArrowComponent* +X Marker;                                                 // 0x0B28 (size: 0x8)
    class UArrowComponent* -Y Marker;                                                 // 0x0B30 (size: 0x8)
    class UCustomHeightmapComponent* CustomHeightmap;                                 // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0B40 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0B48 (size: 0x8)

}; // Size: 0xB50

#endif
