#ifndef UE4SS_SDK_BPVisGridFoundationHalfRampDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationHalfRampDiagonal_T2_HPP

class ABPVisGridFoundationHalfRampDiagonal_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0560 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0568 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0570 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0578 (size: 0x8)

}; // Size: 0x580

#endif
