#ifndef UE4SS_SDK_BPVisGridFoundationQuarterFloorDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterFloorDiagonal_T2_HPP

class ABPVisGridFoundationQuarterFloorDiagonal_T2_C : public AVisStructure
{
    class UPoseableMeshComponent* PoseableMesh;                                       // 0x0560 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking1;                                       // 0x0568 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking3;                                       // 0x0570 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking2;                                       // 0x0578 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x0580 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0590 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x0598 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05A0 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x05A8 (size: 0x8)

}; // Size: 0x5B0

#endif
