#ifndef UE4SS_SDK_BPVisResourceStockpileT1_HPP
#define UE4SS_SDK_BPVisResourceStockpileT1_HPP

class ABPVisResourceStockpileT1_C : public AVisStructure
{
    class UInstancedStaticMeshComponent* ResourceChickenEgg;                          // 0x0480 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceFibre;                               // 0x0488 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceFeathers;                            // 0x0490 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedCoal;                               // 0x0498 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedSteel;                              // 0x04A0 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceClay;                                // 0x04A8 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceWoodAsh;                             // 0x04B0 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedAnimalFeed;                         // 0x04B8 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceManure;                              // 0x04C0 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceCoal;                                // 0x04C8 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceWood03;                              // 0x04D0 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceWood01;                              // 0x04D8 (size: 0x8)
    class UInstancedStaticMeshComponent* ReinforcedWood;                              // 0x04E0 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedClay;                               // 0x04E8 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceBranches;                            // 0x04F0 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedIron;                               // 0x04F8 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedStone;                              // 0x0500 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceWood02;                              // 0x0508 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceStone;                               // 0x0510 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceIronOre;                             // 0x0518 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceIronFragments;                       // 0x0520 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceWoodFragments;                       // 0x0528 (size: 0x8)
    class UInstancedStaticMeshComponent* ResourceStoneFragments;                      // 0x0530 (size: 0x8)
    class UInstancedStaticMeshComponent* ProcessedWood;                               // 0x0538 (size: 0x8)
    class UVisStockpileComponent* VisStockpile;                                       // 0x0540 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0550 (size: 0x8)

}; // Size: 0x558

#endif
