#ifndef UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayStraight_T2_HPP
#define UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayStraight_T2_HPP

class ABPVisFamilyCenterBridgeWalkwayStraight_T2_C : public AVisStructure
{
    class UStaticMeshComponent* Pillar2;                                              // 0x0520 (size: 0x8)
    class UStaticMeshComponent* Pillar1;                                              // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Pillar;                                               // 0x0530 (size: 0x8)
    class UStaticMeshComponent* Pillar3;                                              // 0x0538 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0540 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0550 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0558 (size: 0x8)

}; // Size: 0x560

#endif
