#ifndef UE4SS_SDK_BPVisHenhouseT1_HPP
#define UE4SS_SDK_BPVisHenhouseT1_HPP

class ABPVisHenhouseT1_C : public AVisLivestockStructure
{
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile2;                                   // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile1;                                   // 0x04F0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile;                                    // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* Egg1;                                              // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* Egg2;                                              // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* Egg3;                                              // 0x0518 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0528 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0530 (size: 0x8)

}; // Size: 0x538

#endif
