#ifndef UE4SS_SDK_BPVisRavenDen_HPP
#define UE4SS_SDK_BPVisRavenDen_HPP

class ABPVisRavenDen_C : public AVisResource
{
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh13;               // 0x0458 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh12;               // 0x0460 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh11;               // 0x0468 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh10;               // 0x0470 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh9;                // 0x0478 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh8;                // 0x0480 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh7;                // 0x0488 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh6;                // 0x0490 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh5;                // 0x0498 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh4;                // 0x04A0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh3;                // 0x04A8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh2;                // 0x04B0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh1;                // 0x04B8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh;                 // 0x04C0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x04C8 (size: 0x8)

}; // Size: 0x4D0

#endif
