#ifndef UE4SS_SDK_BPVisWeaponStockpileT1_HPP
#define UE4SS_SDK_BPVisWeaponStockpileT1_HPP

class ABPVisWeaponStockpileT1_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x0520 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x0528 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x0530 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x0538 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x0540 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x0548 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0558 (size: 0x8)

}; // Size: 0x560

#endif
