#ifndef UE4SS_SDK_BPVisFoundationGateT3_HPP
#define UE4SS_SDK_BPVisFoundationGateT3_HPP

class ABPVisFoundationGateT3_C : public AVisGate
{
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* Arch;                                              // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* Arch1;                                             // 0x04A0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x04A8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x04B0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x04B8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh9;                           // 0x04C0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* Scaffolding;                                          // 0x0500 (size: 0x8)

}; // Size: 0x508

#endif
