#ifndef UE4SS_SDK_BPVisHouseT3_HPP
#define UE4SS_SDK_BPVisHouseT3_HPP

class ABPVisHouseT3_C : public AVisStructure
{
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0518 (size: 0x8)
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh_Roof;                                // 0x0528 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0530 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x0538 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0548 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0550 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0558 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0560 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0568 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0570 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0578 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect3;                                      // 0x0580 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0588 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0590 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0598 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x05A0 (size: 0x8)
    class UAudioComponent* Audio;                                                     // 0x05A8 (size: 0x8)
    class UNiagaraComponent* Chimney Smoke;                                           // 0x05B0 (size: 0x8)

}; // Size: 0x5B8

#endif
