#ifndef UE4SS_SDK_BPVisGridFoundationCrenellationRoundDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationCrenellationRoundDiagonal_T2_HPP

class ABPVisGridFoundationCrenellationRoundDiagonal_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x0550 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor1;      // 0x0558 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor;       // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x0578 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x0580 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0590 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0598 (size: 0x8)

}; // Size: 0x5A0

#endif
