#ifndef UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP
#define UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP

class ABPVisRelicRoofCoverMedium_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x0418 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare19_StaticMeshComponent0;             // 0x0420 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare18_StaticMeshComponent0;             // 0x0428 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare20_StaticMeshComponent0;             // 0x0430 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare17_StaticMeshComponent0;             // 0x0438 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge2_StaticMeshComponent0;                   // 0x0440 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0448 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0450 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0458 (size: 0x8)

}; // Size: 0x460

#endif
