#ifndef UE4SS_SDK_BPVisAqueductStraight_HPP
#define UE4SS_SDK_BPVisAqueductStraight_HPP

class ABPVisAqueductStraight_C : public AVisStructure
{
    class UVisStaticMeshComponent* BalljointBase;                                     // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* RightTrim;                                         // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* LeftTrim;                                          // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* BalljointTrim;                                     // 0x0578 (size: 0x8)
    class UVisBalljointComponent* VisBalljointEnd;                                    // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* RightTrim1;                                        // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* BalljointBase1;                                    // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* BalljointTrim1;                                    // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* LeftTrim1;                                         // 0x05A0 (size: 0x8)
    class UVisBalljointComponent* VisBalljointStart;                                  // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* EndMesh;                                              // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* StartMesh;                                            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* MidMesh;                                              // 0x05C0 (size: 0x8)
    class UVisCanalWaterControllerComponent* VisCanalWaterController;                 // 0x05C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x05D0 (size: 0x8)

}; // Size: 0x5D8

#endif
