#ifndef UE4SS_SDK_BPVisGridFoundationQuarterWallInclineDiagonal_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterWallInclineDiagonal_HPP

class ABPVisGridFoundationQuarterWallInclineDiagonal_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0578 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0580 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0588 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0590 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0598 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05A0 (size: 0x8)

}; // Size: 0x5A8

#endif
