#ifndef UE4SS_SDK_BPVisFoundationT2_90turn_3x3x9_HPP
#define UE4SS_SDK_BPVisFoundationT2_90turn_3x3x9_HPP

class ABPVisFoundationT2_90turn_3x3x9_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh13;                          // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh9;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x04F0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh5;                           // 0x04F8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh4;                           // 0x0500 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x0508 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x0510 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x0518 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0528 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0530 (size: 0x8)

}; // Size: 0x538

#endif
