#ifndef UE4SS_SDK_BPVisGridFoundationWallFlatStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationWallFlatStraight_T2_HPP

class ABPVisGridFoundationWallFlatStraight_T2_C : public AVisStructure
{
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference1; // 0x0558 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference; // 0x0560 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0568 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0570 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0578 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0588 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
