#ifndef UE4SS_SDK_BPVisMarketplaceShopT2_HPP
#define UE4SS_SDK_BPVisMarketplaceShopT2_HPP

class ABPVisMarketplaceShopT2_C : public AVisRefinery
{
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes1;                                      // 0x0528 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes;                                       // 0x0530 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0540 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0548 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0550 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0558 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0560 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0568 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0570 (size: 0x8)

}; // Size: 0x578

#endif
