#ifndef UE4SS_SDK_BPVisFoundationT2_octagon_3x8x9_HPP
#define UE4SS_SDK_BPVisFoundationT2_octagon_3x8x9_HPP

class ABPVisFoundationT2_octagon_3x8x9_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh17;                          // 0x0480 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh16;                          // 0x0488 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh15;                          // 0x0490 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh14;                          // 0x0498 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x04A0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh6;                           // 0x04A8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh5;                           // 0x04B0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh4;                           // 0x04B8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh13;                          // 0x04C0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04F0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0508 (size: 0x8)

}; // Size: 0x510

#endif
