#ifndef UE4SS_SDK_BPVisRavenDen_HPP
#define UE4SS_SDK_BPVisRavenDen_HPP

class ABPVisRavenDen_C : public AVisResource
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x04A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x04A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x04B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x04B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x04C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x04C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x04D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor6;                          // 0x04D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor5;                          // 0x04E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor4;                          // 0x04E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x04F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x04F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x0500 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x0508 (size: 0x8)
    class USceneComponent* Decors;                                                    // 0x0510 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0518 (size: 0x8)

}; // Size: 0x520

#endif
