#ifndef UE4SS_SDK_BPVisColumnsWithRoofCover_HPP
#define UE4SS_SDK_BPVisColumnsWithRoofCover_HPP

class ABPVisColumnsWithRoofCover_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* Block-in_Square11_StaticMeshComponent0;               // 0x0418 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c24_StaticMeshComponent0;                // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square10_StaticMeshComponent0;               // 0x0428 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c22_StaticMeshComponent0;                // 0x0430 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c17_StaticMeshComponent0;                // 0x0438 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c23_StaticMeshComponent0;                // 0x0440 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c20_StaticMeshComponent0;                // 0x0448 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c18_StaticMeshComponent0;                // 0x0450 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c19_StaticMeshComponent0;                // 0x0458 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c21_StaticMeshComponent0;                // 0x0460 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0468 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0470 (size: 0x8)

}; // Size: 0x478

#endif
