#ifndef UE4SS_SDK_BPVisGridFoundationSquareStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationSquareStraight_T2_HPP

class ABPVisGridFoundationSquareStraight_T2_C : public AVisStructure
{
    class UVisRandomMeshComponent* VisRandomMeshBricks;                               // 0x0560 (size: 0x8)
    class UVisStaticMeshComponentBase* Rubble;                                        // 0x0568 (size: 0x8)
    class UVisStaticMeshComponentBase* TopMeshCollapsed;                              // 0x0570 (size: 0x8)
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x0578 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge01;                       // 0x0580 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* TopMesh;                                              // 0x0590 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x0598 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor7;          // 0x05A0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x05A8 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* BottomMesh;                         // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge03;                       // 0x05B8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge02;                       // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge04;                       // 0x05C8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05D0 (size: 0x8)

}; // Size: 0x5D8

#endif
