#ifndef UE4SS_SDK_BPVisGridFoundationHalfCrenellationStraight_HPP
#define UE4SS_SDK_BPVisGridFoundationHalfCrenellationStraight_HPP

class ABPVisGridFoundationHalfCrenellationStraight_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0580 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0588 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor;       // 0x0590 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor1;      // 0x0598 (size: 0x8)

}; // Size: 0x5A0

#endif
