#ifndef UE4SS_SDK_BPVisGridFoundationTriangularDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationTriangularDiagonal_T2_HPP

class ABPVisGridFoundationTriangularDiagonal_T2_C : public AVisStructure
{
    class UVisStaticMeshComponentBase* Rubble;                                        // 0x0558 (size: 0x8)
    class UVisStaticMeshComponentBase* TopMeshCollapsed;                              // 0x0560 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference8; // 0x0568 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference7; // 0x0570 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference9; // 0x0578 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference1; // 0x0580 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference2; // 0x0588 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference3; // 0x0590 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference; // 0x0598 (size: 0x8)
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking2;                                       // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking3;                                       // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking;                                        // 0x05B8 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* BottomMesh;                         // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* TopMesh;                                              // 0x05D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x05D8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x05E0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x05E8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x05F0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x05F8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0600 (size: 0x8)

}; // Size: 0x608

#endif
