#ifndef UE4SS_SDK_BPVisTownCraftingFood_HPP
#define UE4SS_SDK_BPVisTownCraftingFood_HPP

class ABPVisTownCraftingFood_C : public AVisRefinery
{
    class UVisStaticMeshComponent* OvenMesh;                                          // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureCollapsedMesh;                        // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureMesh;                                 // 0x05A0 (size: 0x8)

}; // Size: 0x5A8

#endif
