#ifndef UE4SS_SDK_BPVisGridFoundationArchStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationArchStraight_T2_HPP

class ABPVisGridFoundationArchStraight_T2_C : public AVisStructure
{
    class UVisStaticMeshComponentBase* TopMeshCollapsed;                              // 0x0560 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference11; // 0x0568 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference10; // 0x0570 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference9; // 0x0578 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference8; // 0x0580 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference6; // 0x0588 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference4; // 0x0590 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference5; // 0x0598 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference7; // 0x05A0 (size: 0x8)
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x05A8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor10;         // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor9;          // 0x05B8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor11;         // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor7;          // 0x05C8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x05D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x05D8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x05E0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor8;          // 0x05E8 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* BottomMesh1;                        // 0x05F0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor15;         // 0x05F8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor12;         // 0x0600 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor13;         // 0x0608 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor14;         // 0x0610 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* BottomMesh2;                        // 0x0618 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0620 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x0628 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x0630 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0638 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0640 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x0648 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0650 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0658 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x0660 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0668 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x0670 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0678 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x0680 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x0688 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x0690 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x0698 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x06A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x06A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x06B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor32;                         // 0x06B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x06C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x06C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x06D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x06D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x06E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x06E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x06F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x06F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor38;                         // 0x0700 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor39;                         // 0x0708 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0710 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0718 (size: 0x8)
    class UStaticMeshComponent* TopMesh;                                              // 0x0720 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0728 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0730 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0738 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor60;                         // 0x0740 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor59;                         // 0x0748 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor58;                         // 0x0750 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor61;                         // 0x0758 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x0760 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor57;                         // 0x0768 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor56;                         // 0x0770 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor55;                         // 0x0778 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor54;                         // 0x0780 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor68;                         // 0x0788 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor67;                         // 0x0790 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor66;                         // 0x0798 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor62;                         // 0x07A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor65;                         // 0x07A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor64;                         // 0x07B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor63;                         // 0x07B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor53;                         // 0x07C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor44;                         // 0x07C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor43;                         // 0x07D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor42;                         // 0x07D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor41;                         // 0x07E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x07E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor45;                         // 0x07F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor52;                         // 0x07F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor46;                         // 0x0800 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor51;                         // 0x0808 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor50;                         // 0x0810 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor49;                         // 0x0818 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor48;                         // 0x0820 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor47;                         // 0x0828 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor40;                         // 0x0830 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0838 (size: 0x8)

}; // Size: 0x840

#endif
