#ifndef UE4SS_SDK_BPVisMeatRack_HPP
#define UE4SS_SDK_BPVisMeatRack_HPP

class ABPVisMeatRack_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x04C8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x04D0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x04D8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x04E0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x04E8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x04F0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x04F8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x0500 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0510 (size: 0x8)

}; // Size: 0x518

#endif
