#ifndef UE4SS_SDK_BPVisWeaponStockpileT1_HPP
#define UE4SS_SDK_BPVisWeaponStockpileT1_HPP

class ABPVisWeaponStockpileT1_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x0560 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x0568 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x0570 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x0578 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x0580 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x0588 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0598 (size: 0x8)

}; // Size: 0x5A0

#endif
