#ifndef UE4SS_SDK_BPVisCookshopT3_HPP
#define UE4SS_SDK_BPVisCookshopT3_HPP

class ABPVisCookshopT3_C : public AVisRefinery
{
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x04F0 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* MainMesh;                                          // 0x0500 (size: 0x8)
    class UNiagaraComponent* BakerySmoke;                                             // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* OvenMesh;                                          // 0x0518 (size: 0x8)

}; // Size: 0x520

#endif
