#ifndef UE4SS_SDK_BPVisCanalBuildSite_HPP
#define UE4SS_SDK_BPVisCanalBuildSite_HPP

class ABPVisCanalBuildSite_C : public AVisSplineBuildSite
{
    class UStaticMeshComponent* SlopeArrowDown;                                       // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseEnd;                                     // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightEnd;                                    // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftEnd;                                     // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* AngleBaseEnd;                                         // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimEnd;                                     // 0x04F0 (size: 0x8)
    class USceneComponent* OffsetBase;                                                // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* SlopeArrowUp;                                         // 0x0500 (size: 0x8)
    class USceneComponent* BalljointEnd;                                              // 0x0508 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightStart;                                  // 0x0510 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftStart;                                   // 0x0518 (size: 0x8)
    class UStaticMeshComponent* AngleBaseStart;                                       // 0x0520 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimStart;                                   // 0x0528 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseStart;                                   // 0x0530 (size: 0x8)
    class USceneComponent* BalljointStart;                                            // 0x0538 (size: 0x8)

}; // Size: 0x540

#endif
