#ifndef UE4SS_SDK_BPVisFortGateT1_HPP
#define UE4SS_SDK_BPVisFortGateT1_HPP

class ABPVisFortGateT1_C : public AVisGate
{
    class UVisStaticMeshComponent* GroundPropMesh3;                                   // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* GroundPropMesh2;                                   // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* GroundPropMesh1;                                   // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0500 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0508 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect10;                                     // 0x0510 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0518 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0520 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0528 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0530 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0538 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0540 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0548 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0550 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect3;                                      // 0x0558 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0560 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0578 (size: 0x8)

}; // Size: 0x580

#endif
