#ifndef UE4SS_SDK_BPVisRelicSite_HPP
#define UE4SS_SDK_BPVisRelicSite_HPP

class ABPVisRelicSite_C : public AVisRelicSite
{
    class UVisTeamSkeletalMeshComponent* VisTeamSkeletalMesh;                         // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh15;                                   // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh14;                                   // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh13;                                   // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh12;                                   // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh11;                                   // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh9;                                    // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x05B8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x05C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x05C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x05D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x05D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform025;                                     // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform024;                                     // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform023;                                     // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform022;                                     // 0x0600 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0608 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0610 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform015;                                     // 0x0618 (size: 0x8)
    class UStaticMeshComponent* RuinsPlatform014;                                     // 0x0620 (size: 0x8)
    class USceneComponent* Meshes;                                                    // 0x0628 (size: 0x8)

}; // Size: 0x630

#endif
