#ifndef UE4SS_SDK_BPVisIndustryFoundation_6x6_HPP
#define UE4SS_SDK_BPVisIndustryFoundation_6x6_HPP

class ABPVisIndustryFoundation_6x6_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* Pillar04;                                          // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* Pillar03;                                          // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* Pillar02;                                          // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* Pillar01;                                          // 0x0500 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh_Roof;                                // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0518 (size: 0x8)

}; // Size: 0x520

#endif
