#ifndef UE4SS_SDK_BPVisHenhouseT3_HPP
#define UE4SS_SDK_BPVisHenhouseT3_HPP

class ABPVisHenhouseT3_C : public AVisLivestockStructure
{
    class UDecalComponent* Decal2;                                                    // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile;                                    // 0x04A0 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile1;                                   // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile2;                                   // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* Egg6;                                              // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* Egg5;                                              // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* Egg1;                                              // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* Egg4;                                              // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* Egg3;                                              // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* Egg2;                                              // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04F0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x04F8 (size: 0x8)

}; // Size: 0x500

#endif
