#ifndef UE4SS_SDK_BPVisWeaponStockpileT1_HPP
#define UE4SS_SDK_BPVisWeaponStockpileT1_HPP

class ABPVisWeaponStockpileT1_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x0480 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x0488 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x0490 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x0498 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x04A0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x04A8 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04B8 (size: 0x8)

}; // Size: 0x4C0

#endif
