#ifndef UE4SS_SDK_BPVisCanalBuildSite_HPP
#define UE4SS_SDK_BPVisCanalBuildSite_HPP

class ABPVisCanalBuildSite_C : public AVisSplineBuildSite
{
    class UStaticMeshComponent* SlopeArrowDown;                                       // 0x0528 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseEnd;                                     // 0x0530 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightEnd;                                    // 0x0538 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftEnd;                                     // 0x0540 (size: 0x8)
    class UStaticMeshComponent* AngleBaseEnd;                                         // 0x0548 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimEnd;                                     // 0x0550 (size: 0x8)
    class USceneComponent* OffsetBase;                                                // 0x0558 (size: 0x8)
    class UStaticMeshComponent* SlopeArrowUp;                                         // 0x0560 (size: 0x8)
    class USceneComponent* BalljointEnd;                                              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightStart;                                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftStart;                                   // 0x0578 (size: 0x8)
    class UStaticMeshComponent* AngleBaseStart;                                       // 0x0580 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimStart;                                   // 0x0588 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseStart;                                   // 0x0590 (size: 0x8)
    class USceneComponent* BalljointStart;                                            // 0x0598 (size: 0x8)

}; // Size: 0x5A0

#endif
