#ifndef UE4SS_SDK_BPVisTownPlayerStorage_HPP
#define UE4SS_SDK_BPVisTownPlayerStorage_HPP

class ABPVisTownPlayerStorage_C : public AVisStorehouse
{
    class UVisStaticMeshComponent* MainStructureCollapsed;                            // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x0580 (size: 0x8)
    class UNiagaraComponent* SmokeStack;                                              // 0x0588 (size: 0x8)
    class UStaticMeshComponent* OwnerFlagMesh;                                        // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0598 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* MainStructure;                                     // 0x05B0 (size: 0x8)

}; // Size: 0x5B8

#endif
