#ifndef UE4SS_SDK_BPVisCentralMarketplace_HPP
#define UE4SS_SDK_BPVisCentralMarketplace_HPP

class ABPVisCentralMarketplace_C : public AVisCentralMarketplace
{
    class UVisStaticMeshComponent* StructureCollapsed;                                // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh20;                                   // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh26;                                   // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh25;                                   // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes;                                       // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes1;                                      // 0x0588 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* Structure;                                         // 0x0598 (size: 0x8)

}; // Size: 0x5A0

#endif
