#ifndef UE4SS_SDK_BPVisStorehouse_HPP
#define UE4SS_SDK_BPVisStorehouse_HPP

class ABPVisStorehouse_C : public AVisStorehouse
{
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0588 (size: 0x8)

}; // Size: 0x590

#endif
