#ifndef UE4SS_SDK_BPVisCanalBuildSite_HPP
#define UE4SS_SDK_BPVisCanalBuildSite_HPP

class ABPVisCanalBuildSite_C : public AVisSplineBuildSite
{
    class UStaticMeshComponent* SlopeArrowDown;                                       // 0x0470 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseEnd;                                     // 0x0478 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightEnd;                                    // 0x0480 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftEnd;                                     // 0x0488 (size: 0x8)
    class UStaticMeshComponent* AngleBaseEnd;                                         // 0x0490 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimEnd;                                     // 0x0498 (size: 0x8)
    class USceneComponent* OffsetBase;                                                // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* SlopeArrowUp;                                         // 0x04A8 (size: 0x8)
    class USceneComponent* BalljointEnd;                                              // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* AngleTrimRightStart;                                  // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* AngleTrimLeftStart;                                   // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* AngleBaseStart;                                       // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* BalljointTrimStart;                                   // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* BalljointBaseStart;                                   // 0x04D8 (size: 0x8)
    class USceneComponent* BalljointStart;                                            // 0x04E0 (size: 0x8)

}; // Size: 0x4E8

#endif
