#ifndef UE4SS_SDK_BPVisFoodTable_HPP
#define UE4SS_SDK_BPVisFoodTable_HPP

class ABPVisFoodTable_C : public AVisStructure
{
    class UNiagaraComponent* WorkshopFire;                                            // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* TableCloth1;                                       // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* TableCloth;                                        // 0x0570 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile11;                 // 0x0578 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile10;                 // 0x0580 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile9;                  // 0x0588 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x0590 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x0598 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x05A0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x05A8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x05B0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x05B8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x05C0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x05C8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x05D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x05D8 (size: 0x8)

}; // Size: 0x5E0

#endif
