#ifndef UE4SS_SDK_BPVisPantry_HPP
#define UE4SS_SDK_BPVisPantry_HPP

class ABPVisPantry_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x0480 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x0488 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x0490 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x0498 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x04A0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x04A8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x04B0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x04B8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04C8 (size: 0x8)

}; // Size: 0x4D0

#endif
