#ifndef UE4SS_SDK_BPVisRoofOverhead_HPP
#define UE4SS_SDK_BPVisRoofOverhead_HPP

class ABPVisRoofOverhead_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* BlockInCylinder3_StaticMeshComponent0;                // 0x0460 (size: 0x8)
    class UStaticMeshComponent* BlockInCylinder2_StaticMeshComponent0;                // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent0;               // 0x0470 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent0;               // 0x0478 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent1;               // 0x0480 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent1;               // 0x0488 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x0490 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge2_StaticMeshComponent0;                   // 0x0498 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square18_StaticMeshComponent0;               // 0x04A0 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04A8 (size: 0x8)

}; // Size: 0x4B0

#endif
