#ifndef UE4SS_SDK_BPVisHenhouseT2_HPP
#define UE4SS_SDK_BPVisHenhouseT2_HPP

class ABPVisHenhouseT2_C : public AVisLivestockStructure
{
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0538 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile2;                                   // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile1;                                   // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* AnimalFeedPile;                                    // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* Egg2;                                              // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* Egg4;                                              // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* Egg3;                                              // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* Egg1;                                              // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0588 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
