#ifndef UE4SS_SDK_BPVisGridFoundationHalfSquareStraight_HPP
#define UE4SS_SDK_BPVisGridFoundationHalfSquareStraight_HPP

class ABPVisGridFoundationHalfSquareStraight_C : public AVisStructure
{
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x0558 (size: 0x8)
    class UVisRandomMeshDecorComponent* Rubble;                                       // 0x0560 (size: 0x8)
    class UVisStaticMeshComponentBase* TopMeshCollapsed;                              // 0x0568 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference5; // 0x0570 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference6; // 0x0578 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference7; // 0x0580 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference4; // 0x0588 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference; // 0x0590 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference1; // 0x0598 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference2; // 0x05A0 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference3; // 0x05A8 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* BottomMesh;                         // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge08;                       // 0x05B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge05;                       // 0x05C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor4;                          // 0x05D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge06;                       // 0x05D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x05E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x05E8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge09;                       // 0x05F0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x05F8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x0600 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor7;          // 0x0608 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x0610 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x0618 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor5;                          // 0x0620 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x0628 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x0630 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x0638 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor6;                          // 0x0640 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x0648 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x0650 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x0658 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0660 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x0668 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* TopMesh;                                              // 0x0678 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0680 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0688 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0690 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0698 (size: 0x8)

}; // Size: 0x6A0

#endif
