#ifndef UE4SS_SDK_BPVisColumnsWithRoofCover_HPP
#define UE4SS_SDK_BPVisColumnsWithRoofCover_HPP

class ABPVisColumnsWithRoofCover_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* Block-in_Square11_StaticMeshComponent0;               // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c24_StaticMeshComponent0;                // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square10_StaticMeshComponent0;               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c22_StaticMeshComponent0;                // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c17_StaticMeshComponent0;                // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c23_StaticMeshComponent0;                // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c20_StaticMeshComponent0;                // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c18_StaticMeshComponent0;                // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c19_StaticMeshComponent0;                // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c21_StaticMeshComponent0;                // 0x0500 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0508 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0510 (size: 0x8)

}; // Size: 0x518

#endif
