#ifndef UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP
#define UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP

class ABPVisRelicRoofCoverMedium_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* RelicPillarSquare20_StaticMeshComponent1;             // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare18_StaticMeshComponent1;             // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare19_StaticMeshComponent0;             // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare18_StaticMeshComponent0;             // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare20_StaticMeshComponent0;             // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare17_StaticMeshComponent0;             // 0x04E8 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04F0 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x04F8 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x0500 (size: 0x8)

}; // Size: 0x508

#endif
