#ifndef UE4SS_SDK_BPVisCookshopT3_HPP
#define UE4SS_SDK_BPVisCookshopT3_HPP

class ABPVisCookshopT3_C : public AVisRefinery
{
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x04A0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x04B0 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* MainMesh;                                          // 0x04C0 (size: 0x8)
    class UNiagaraComponent* BakerySmoke;                                             // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* OvenMesh;                                          // 0x04D8 (size: 0x8)

}; // Size: 0x4E0

#endif
