#ifndef UE4SS_SDK_BpVisTownCenterKeep_HPP
#define UE4SS_SDK_BpVisTownCenterKeep_HPP

class ABpVisTownCenterKeep_C : public AVisTownCenter
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0528 (size: 0x8)
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x0530 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0538 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0540 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0558 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0568 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0570 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x05A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor46;                         // 0x05A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor39;                         // 0x05B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor38;                         // 0x05B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor40;                         // 0x05C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor43;                         // 0x05C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor44;                         // 0x05D0 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh1;                                        // 0x05D8 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh2;                                        // 0x05E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor50;                         // 0x05E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor51;                         // 0x05F0 (size: 0x8)
    class UChildActorComponent* ChildActor81;                                         // 0x05F8 (size: 0x8)
    class UChildActorComponent* ChildActor80;                                         // 0x0600 (size: 0x8)
    class UChildActorComponent* ChildActor79;                                         // 0x0608 (size: 0x8)
    class UChildActorComponent* ChildActor78;                                         // 0x0610 (size: 0x8)
    class UChildActorComponent* ChildActor77;                                         // 0x0618 (size: 0x8)
    class UChildActorComponent* ChildActor76;                                         // 0x0620 (size: 0x8)
    class UChildActorComponent* ChildActor75;                                         // 0x0628 (size: 0x8)
    class UChildActorComponent* ChildActor74;                                         // 0x0630 (size: 0x8)
    class UChildActorComponent* ChildActor73;                                         // 0x0638 (size: 0x8)
    class UChildActorComponent* ChildActor72;                                         // 0x0640 (size: 0x8)
    class UChildActorComponent* ChildActor71;                                         // 0x0648 (size: 0x8)
    class UChildActorComponent* ChildActor70;                                         // 0x0650 (size: 0x8)
    class UChildActorComponent* ChildActor69;                                         // 0x0658 (size: 0x8)
    class UChildActorComponent* ChildActor68;                                         // 0x0660 (size: 0x8)
    class UChildActorComponent* ChildActor67;                                         // 0x0668 (size: 0x8)
    class UChildActorComponent* ChildActor66;                                         // 0x0670 (size: 0x8)
    class UChildActorComponent* ChildActor65;                                         // 0x0678 (size: 0x8)
    class UChildActorComponent* ChildActor64;                                         // 0x0680 (size: 0x8)
    class UChildActorComponent* ChildActor60;                                         // 0x0688 (size: 0x8)
    class UChildActorComponent* ChildActor63;                                         // 0x0690 (size: 0x8)
    class UChildActorComponent* ChildActor62;                                         // 0x0698 (size: 0x8)
    class UChildActorComponent* ChildActor61;                                         // 0x06A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor53;                         // 0x06A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor52;                         // 0x06B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor49;                         // 0x06B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor48;                         // 0x06C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor47;                         // 0x06C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor45;                         // 0x06D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor42;                         // 0x06D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor41;                         // 0x06E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x06E8 (size: 0x8)
    class UChildActorComponent* ChildActor59;                                         // 0x06F0 (size: 0x8)
    class UChildActorComponent* ChildActor58;                                         // 0x06F8 (size: 0x8)
    class UChildActorComponent* ChildActor57;                                         // 0x0700 (size: 0x8)
    class UChildActorComponent* ChildActor56;                                         // 0x0708 (size: 0x8)
    class UChildActorComponent* ChildActor55;                                         // 0x0710 (size: 0x8)
    class UChildActorComponent* ChildActor54;                                         // 0x0718 (size: 0x8)
    class UChildActorComponent* ChildActor53;                                         // 0x0720 (size: 0x8)
    class UChildActorComponent* ChildActor52;                                         // 0x0728 (size: 0x8)
    class UChildActorComponent* ChildActor51;                                         // 0x0730 (size: 0x8)
    class UChildActorComponent* ChildActor50;                                         // 0x0738 (size: 0x8)
    class UChildActorComponent* ChildActor49;                                         // 0x0740 (size: 0x8)
    class UChildActorComponent* ChildActor48;                                         // 0x0748 (size: 0x8)
    class UChildActorComponent* ChildActor47;                                         // 0x0750 (size: 0x8)
    class UChildActorComponent* ChildActor46;                                         // 0x0758 (size: 0x8)
    class UChildActorComponent* ChildActor45;                                         // 0x0760 (size: 0x8)
    class UChildActorComponent* ChildActor44;                                         // 0x0768 (size: 0x8)
    class UChildActorComponent* ChildActor43;                                         // 0x0770 (size: 0x8)
    class UChildActorComponent* ChildActor42;                                         // 0x0778 (size: 0x8)
    class UChildActorComponent* ChildActor41;                                         // 0x0780 (size: 0x8)
    class UChildActorComponent* ChildActor40;                                         // 0x0788 (size: 0x8)
    class UChildActorComponent* ChildActor39;                                         // 0x0790 (size: 0x8)
    class UChildActorComponent* ChildActor38;                                         // 0x0798 (size: 0x8)
    class UChildActorComponent* ChildActor37;                                         // 0x07A0 (size: 0x8)
    class UChildActorComponent* ChildActor36;                                         // 0x07A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x07B0 (size: 0x8)
    class UChildActorComponent* ChildActor35;                                         // 0x07B8 (size: 0x8)
    class UChildActorComponent* ChildActor34;                                         // 0x07C0 (size: 0x8)
    class UChildActorComponent* ChildActor33;                                         // 0x07C8 (size: 0x8)
    class UChildActorComponent* ChildActor32;                                         // 0x07D0 (size: 0x8)
    class UChildActorComponent* ChildActor31;                                         // 0x07D8 (size: 0x8)
    class UChildActorComponent* ChildActor30;                                         // 0x07E0 (size: 0x8)
    class UChildActorComponent* ChildActor29;                                         // 0x07E8 (size: 0x8)
    class UChildActorComponent* ChildActor28;                                         // 0x07F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x07F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0800 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x0808 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor32;                         // 0x0810 (size: 0x8)
    class UChildActorComponent* ChildActor27;                                         // 0x0818 (size: 0x8)
    class UChildActorComponent* ChildActor26;                                         // 0x0820 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x0828 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x0830 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x0838 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x0840 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0848 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x0850 (size: 0x8)
    class UChildActorComponent* ChildActor25;                                         // 0x0858 (size: 0x8)
    class UChildActorComponent* ChildActor24;                                         // 0x0860 (size: 0x8)
    class UChildActorComponent* ChildActor23;                                         // 0x0868 (size: 0x8)
    class UChildActorComponent* ChildActor22;                                         // 0x0870 (size: 0x8)
    class UChildActorComponent* ChildActor21;                                         // 0x0878 (size: 0x8)
    class UChildActorComponent* ChildActor20;                                         // 0x0880 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x0888 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x0890 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0898 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x08A0 (size: 0x8)
    class UChildActorComponent* ChildActor19;                                         // 0x08A8 (size: 0x8)
    class UChildActorComponent* ChildActor18;                                         // 0x08B0 (size: 0x8)
    class UChildActorComponent* ChildActor17;                                         // 0x08B8 (size: 0x8)
    class UChildActorComponent* ChildActor16;                                         // 0x08C0 (size: 0x8)
    class UChildActorComponent* ChildActor15;                                         // 0x08C8 (size: 0x8)
    class UChildActorComponent* ChildActor14;                                         // 0x08D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x08D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x08E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x08E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x08F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x08F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x0900 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0908 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0910 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0918 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x0920 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0928 (size: 0x8)
    class UChildActorComponent* ChildActor13;                                         // 0x0930 (size: 0x8)
    class UChildActorComponent* ChildActor12;                                         // 0x0938 (size: 0x8)
    class UChildActorComponent* ChildActor11;                                         // 0x0940 (size: 0x8)
    class UChildActorComponent* ChildActor10;                                         // 0x0948 (size: 0x8)
    class UChildActorComponent* ChildActor9;                                          // 0x0950 (size: 0x8)
    class UChildActorComponent* ChildActor8;                                          // 0x0958 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x0960 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x0968 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x0970 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x0978 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x0980 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor6;                          // 0x0988 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor5;                          // 0x0990 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor4;                          // 0x0998 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x09A0 (size: 0x8)
    class UChildActorComponent* ChildActor7;                                          // 0x09A8 (size: 0x8)
    class UChildActorComponent* ChildActor6;                                          // 0x09B0 (size: 0x8)
    class UChildActorComponent* ChildActor5;                                          // 0x09B8 (size: 0x8)
    class UChildActorComponent* ChildActor4;                                          // 0x09C0 (size: 0x8)
    class UChildActorComponent* ChildActor3;                                          // 0x09C8 (size: 0x8)
    class UChildActorComponent* ChildActor2;                                          // 0x09D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x09D8 (size: 0x8)
    class UChildActorComponent* ChildActor1;                                          // 0x09E0 (size: 0x8)
    class UChildActorComponent* ChildActor;                                           // 0x09E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x09F0 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh4;                                        // 0x09F8 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh3;                                        // 0x0A00 (size: 0x8)
    class UVisStaticMeshComponent* Roof;                                              // 0x0A08 (size: 0x8)
    class UVisStaticMeshComponent* Stairs;                                            // 0x0A10 (size: 0x8)
    class UVisStaticMeshComponent* FF;                                                // 0x0A18 (size: 0x8)
    class UVisStaticMeshComponent* Skirt;                                             // 0x0A20 (size: 0x8)
    class UVisStaticMeshComponent* SF;                                                // 0x0A28 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0A30 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0A38 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0A40 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0A48 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0A50 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0A58 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0A60 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* DebugSphere;                                          // 0x0A70 (size: 0x8)

    void ReceiveTick(float DeltaSeconds);
    void ExecuteUbergraph_BpVisTownCenterKeep(int32 EntryPoint);
}; // Size: 0xA78

#endif
