#ifndef UE4SS_SDK_BPVisAnimalDenWolf_HPP
#define UE4SS_SDK_BPVisAnimalDenWolf_HPP

class ABPVisAnimalDenWolf_C : public AVisMine
{
    class UDecalComponent* Blood;                                                     // 0x04C8 (size: 0x8)
    class UDecalComponent* Blood1;                                                    // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x04D8 (size: 0x8)
    class UDecalComponent* BaseDecal;                                                 // 0x04E0 (size: 0x8)
    class UDecalComponent* Animal Bones;                                              // 0x04E8 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04F8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0500 (size: 0x8)

}; // Size: 0x508

#endif
