#ifndef UE4SS_SDK_BPVisTownCraftingLeather_HPP
#define UE4SS_SDK_BPVisTownCraftingLeather_HPP

class ABPVisTownCraftingLeather_C : public AVisRefinery
{
    class USceneComponent* ExtraProps;                                                // 0x0568 (size: 0x8)
    class UAudioComponent* Audio;                                                     // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a4;                                        // 0x0578 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a3;                                        // 0x0580 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a2;                                        // 0x0588 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a5;                                        // 0x0590 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a1;                                        // 0x0598 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* SM_Torch_01a;                                         // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureCollapsedMesh;                        // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* PropsRefining;                                     // 0x05B8 (size: 0x8)
    class UVisStaticMeshComponent* Props;                                             // 0x05C0 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureMesh;                                 // 0x05C8 (size: 0x8)
    class UNiagaraComponent* Niagara1;                                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0618 (size: 0x8)

}; // Size: 0x620

#endif
