#ifndef UE4SS_SDK_BPVisLeatherRefinery_HPP
#define UE4SS_SDK_BPVisLeatherRefinery_HPP

class ABPVisLeatherRefinery_C : public AVisRefinery
{
    class UVisStaticMeshComponent* VisStaticMeshActive;                               // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0498 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect10;                                     // 0x04A0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect11;                                     // 0x04A8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x04B0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x04B8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x04C0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x04C8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x04D0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x04D8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x04E0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect3;                                      // 0x04E8 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x04F0 (size: 0x8)

}; // Size: 0x4F8

#endif
