#ifndef UE4SS_SDK_BPVisAnimalDenWolf_HPP
#define UE4SS_SDK_BPVisAnimalDenWolf_HPP

class ABPVisAnimalDenWolf_C : public AVisMine
{
    class UDecalComponent* Blood;                                                     // 0x0558 (size: 0x8)
    class UDecalComponent* Blood1;                                                    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0568 (size: 0x8)
    class UDecalComponent* BaseDecal;                                                 // 0x0570 (size: 0x8)
    class UDecalComponent* Animal Bones;                                              // 0x0578 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0588 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
