#ifndef UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_HPP
#define UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_HPP

class ABPVisGridFoundationWallFlatDiagonal_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor38;                         // 0x0518 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor32;                         // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x0558 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0578 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x0580 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0588 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0590 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x0598 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x05A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x05A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x05B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x05B8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x05C8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x05D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x05D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x05E8 (size: 0x8)

}; // Size: 0x5F0

#endif
