#ifndef UE4SS_SDK_BPVisWorldEntranceCave_HPP
#define UE4SS_SDK_BPVisWorldEntranceCave_HPP

class ABPVisWorldEntranceCave_C : public AVisWorldEntrance
{
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* flatstones1;                                       // 0x04C0 (size: 0x8)
    class UBoxComponent* EntranceVisualizer;                                          // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* rockmed4;                                          // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* rockmed3;                                          // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* rock3;                                             // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* rock5;                                             // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* rockbig1;                                          // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* flatstones2;                                       // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* rock2;                                             // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* rocksflat1;                                        // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* rockmed1;                                          // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* rock1;                                             // 0x0518 (size: 0x8)
    class UVisStaticMeshComponent* grass4;                                            // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* grass1;                                            // 0x0528 (size: 0x8)
    class UVisStaticMeshComponent* W;                                                 // 0x0530 (size: 0x8)
    class UVisStaticMeshComponent* Grass;                                             // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* grass2;                                            // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* shrub4;                                            // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* shrub3;                                            // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* shrub2;                                            // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* shrub1;                                            // 0x0560 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0570 (size: 0x8)

}; // Size: 0x578

#endif
