#ifndef UE4SS_SDK_BPVisGridFoundationRampStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationRampStraight_T2_HPP

class ABPVisGridFoundationRampStraight_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor46;                         // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor44;                         // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor43;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor42;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor45;                         // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0558 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor39;                         // 0x0578 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor38;                         // 0x0580 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor40;                         // 0x0588 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x0590 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor41;                         // 0x0598 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x05A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x05B8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05C0 (size: 0x8)

}; // Size: 0x5C8

#endif
