#ifndef UE4SS_SDK_BPVisFoundationGateBuildSite_HPP
#define UE4SS_SDK_BPVisFoundationGateBuildSite_HPP

class ABPVisFoundationGateBuildSite_C : public AVisBuildSite
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04C0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh9;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04F0 (size: 0x8)
    class USkeletalMeshComponent* SkeletalMesh;                                       // 0x04F8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x0500 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* Arch;                                              // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* Arch1;                                             // 0x0518 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0520 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x0528 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0530 (size: 0x8)

}; // Size: 0x538

#endif
