#ifndef UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayDiagonal_T2_HPP
#define UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayDiagonal_T2_HPP

class ABPVisFamilyCenterBridgeWalkwayDiagonal_T2_C : public AVisStructure
{
    class UStaticMeshComponent* Pillar2;                                              // 0x0538 (size: 0x8)
    class UStaticMeshComponent* Pillar3;                                              // 0x0540 (size: 0x8)
    class UStaticMeshComponent* Pillar;                                               // 0x0548 (size: 0x8)
    class UStaticMeshComponent* Pillar1;                                              // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0558 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0568 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0570 (size: 0x8)

}; // Size: 0x578

#endif
