#ifndef UE4SS_SDK_BPVisFoundationT3_SideStaircase_6x3x3_HPP
#define UE4SS_SDK_BPVisFoundationT3_SideStaircase_6x3x3_HPP

class ABPVisFoundationT3_SideStaircase_6x3x3_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh6;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04F0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh5;                           // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0508 (size: 0x8)

}; // Size: 0x510

#endif
