#ifndef UE4SS_SDK_BPVisGridFoundationCrenellationRoundStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationCrenellationRoundStraight_T2_HPP

class ABPVisGridFoundationCrenellationRoundStraight_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor6;                          // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x0578 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x0580 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor5;                          // 0x0588 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0590 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecorINNER2;                     // 0x0598 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x05A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x05A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecorINNER;                      // 0x05B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecorINNER1;                     // 0x05B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecorINNER3;                     // 0x05C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x05C8 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor;       // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x05D8 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor1;      // 0x05E0 (size: 0x8)
    class USceneComponent* Scene1;                                                    // 0x05E8 (size: 0x8)

}; // Size: 0x5F0

#endif
