#ifndef UE4SS_SDK_BPVisFoundationT3_octagon_3x8x9_HPP
#define UE4SS_SDK_BPVisFoundationT3_octagon_3x8x9_HPP

class ABPVisFoundationT3_octagon_3x8x9_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh17;                          // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh16;                          // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh15;                          // 0x04D8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh14;                          // 0x04E0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x04E8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh6;                           // 0x04F0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh5;                           // 0x04F8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh4;                           // 0x0500 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh13;                          // 0x0508 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x0510 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x0518 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x0520 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x0528 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x0530 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x0538 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0550 (size: 0x8)

}; // Size: 0x558

#endif
