#ifndef UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_T2_HPP

class ABPVisGridFoundationWallFlatDiagonal_T2_C : public AVisStructure
{
    class UChildActorComponent* ChildActor4;                                          // 0x0538 (size: 0x8)
    class UChildActorComponent* ChildActor3;                                          // 0x0540 (size: 0x8)
    class UChildActorComponent* ChildActor2;                                          // 0x0548 (size: 0x8)
    class UChildActorComponent* ChildActor1;                                          // 0x0550 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0558 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0560 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0568 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0570 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0578 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0580 (size: 0x8)

}; // Size: 0x588

#endif
