#ifndef UE4SS_SDK_BPVisAnimalDenWolf_HPP
#define UE4SS_SDK_BPVisAnimalDenWolf_HPP

class ABPVisAnimalDenWolf_C : public AVisMine
{
    class UDecalComponent* Blood;                                                     // 0x0480 (size: 0x8)
    class UDecalComponent* Blood1;                                                    // 0x0488 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0490 (size: 0x8)
    class UDecalComponent* BaseDecal;                                                 // 0x0498 (size: 0x8)
    class UDecalComponent* Animal Bones;                                              // 0x04A0 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04B0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x04B8 (size: 0x8)

}; // Size: 0x4C0

#endif
