#ifndef UE4SS_SDK_BPVisCraftingTableT1_HPP
#define UE4SS_SDK_BPVisCraftingTableT1_HPP

class ABPVisCraftingTableT1_C : public AVisRefinery
{
    class UVisStaticMeshComponent* VisStaticMesh11;                                   // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x04A0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh9;                                    // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04E0 (size: 0x8)
    class UAudioComponent* RefineSound;                                               // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04F0 (size: 0x8)

}; // Size: 0x4F8

#endif
