#ifndef UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP
#define UE4SS_SDK_BPVisRelicRoofCoverMedium_HPP

class ABPVisRelicRoofCoverMedium_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x0460 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare19_StaticMeshComponent0;             // 0x0468 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare18_StaticMeshComponent0;             // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare20_StaticMeshComponent0;             // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RelicPillarSquare17_StaticMeshComponent0;             // 0x0480 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge2_StaticMeshComponent0;                   // 0x0488 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0490 (size: 0x8)
    class USceneComponent* Pivot;                                                     // 0x0498 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x04A0 (size: 0x8)

}; // Size: 0x4A8

#endif
