#ifndef UE4SS_SDK_BPVisStoneRefineryT2_HPP
#define UE4SS_SDK_BPVisStoneRefineryT2_HPP

class ABPVisStoneRefineryT2_C : public AVisRefinery
{
    class UAudioComponent* Audio;                                                     // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x0528 (size: 0x8)
    class USceneComponent* Populated;                                                 // 0x0530 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh11;                                   // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0540 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0548 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0550 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0558 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0560 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0568 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0570 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0578 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect3;                                      // 0x0580 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0588 (size: 0x8)
    class USceneComponent* Refining;                                                  // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
