#ifndef UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayStraight_T1_HPP
#define UE4SS_SDK_BPVisFamilyCenterBridgeWalkwayStraight_T1_HPP

class ABPVisFamilyCenterBridgeWalkwayStraight_T1_C : public AVisStructure
{
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0558 (size: 0x8)
    class UStaticMeshComponent* Pillar2;                                              // 0x0560 (size: 0x8)
    class UStaticMeshComponent* Pillar3;                                              // 0x0568 (size: 0x8)
    class UStaticMeshComponent* Pillar;                                               // 0x0570 (size: 0x8)
    class UStaticMeshComponent* Pillar1;                                              // 0x0578 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0580 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0588 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
