#ifndef UE4SS_SDK_BPVisCentralMarketplace_HPP
#define UE4SS_SDK_BPVisCentralMarketplace_HPP

class ABPVisCentralMarketplace_C : public AVisCentralMarketplace
{
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh9;                                    // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh20;                                   // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh27;                                   // 0x04E8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh18;                                   // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh34;                                   // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* Pickaxe;                                           // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* Bow;                                               // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh26;                                   // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh25;                                   // 0x0518 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes;                                       // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* PropsMeshes1;                                      // 0x0528 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh24;                                   // 0x0530 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh32;                                   // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh30;                                   // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* Boxes;                                             // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh28;                                   // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh23;                                   // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh22;                                   // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh12;                                   // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh13;                                   // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh11;                                   // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* WeapoNRack;                                        // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh19;                                   // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh17;                                   // 0x05B0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x05B8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x05C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh16;                                   // 0x05C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh15;                                   // 0x05D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh14;                                   // 0x05D8 (size: 0x8)
    class UVisStaticMeshComponent* Cart;                                              // 0x05E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x05E8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x05F0 (size: 0x8)
    class UVisStaticMeshComponent* BigBoxes;                                          // 0x05F8 (size: 0x8)
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0600 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0608 (size: 0x8)
    class UVisStaticMeshComponent* Structure;                                         // 0x0610 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0618 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0620 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0628 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x0630 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0638 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0640 (size: 0x8)

}; // Size: 0x648

#endif
