#ifndef UE4SS_SDK_BPVisAnimalDenBear_HPP
#define UE4SS_SDK_BPVisAnimalDenBear_HPP

class ABPVisAnimalDenBear_C : public AVisMine
{
    class UDecalComponent* Blood;                                                     // 0x0520 (size: 0x8)
    class UDecalComponent* Blood1;                                                    // 0x0528 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0530 (size: 0x8)
    class UDecalComponent* BaseDecal;                                                 // 0x0538 (size: 0x8)
    class UDecalComponent* Animal Bones;                                              // 0x0540 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0550 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0558 (size: 0x8)

}; // Size: 0x560

#endif
