#ifndef UE4SS_SDK_BPVisTownCraftingMetal_HPP
#define UE4SS_SDK_BPVisTownCraftingMetal_HPP

class ABPVisTownCraftingMetal_C : public AVisRefinery
{
    class UVisStaticMeshComponent* BarrelsMesh;                                       // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* AnvilSubmesh;                                      // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* AnvilMesh;                                         // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* WoodPile3Mesh;                                     // 0x0580 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* SmelterSubmesh;                                    // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* SmelterMesh;                                       // 0x0598 (size: 0x8)
    class UAudioComponent* Audio;                                                     // 0x05A0 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureCollapsedMesh;                        // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureMesh;                                 // 0x05B8 (size: 0x8)

}; // Size: 0x5C0

#endif
