#ifndef UE4SS_SDK_BPVisHouseT1_HPP
#define UE4SS_SDK_BPVisHouseT1_HPP

class ABPVisHouseT1_C : public AVisHouse
{
    class UVisStaticMeshComponent* HouseAreaFenceCollision;                           // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence9;                                   // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence4;                                   // 0x04A0 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence8;                                   // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence7;                                   // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence5;                                   // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence6;                                   // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence3;                                   // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence2;                                   // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* HouseAreaFence1;                                   // 0x04D8 (size: 0x8)
    class UDecalComponent* HouseAreaDecal;                                            // 0x04E0 (size: 0x8)
    class UGrassRemovalVolumeComponent* HouseAreaGrassRemoval;                        // 0x04E8 (size: 0x8)
    class UAudioComponent* Audio;                                                     // 0x04F0 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x04F8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x0500 (size: 0x8)
    class UStaticMeshComponent* OwnerFlagMesh;                                        // 0x0508 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x0510 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x0518 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x0528 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0530 (size: 0x8)
    class UNiagaraComponent* Chimney Smoke;                                           // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x0540 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x0550 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0560 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0568 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0570 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0578 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0580 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0588 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0590 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0598 (size: 0x8)
    class USceneComponent* Populated;                                                 // 0x05A0 (size: 0x8)

}; // Size: 0x5A8

#endif
