#ifndef UE4SS_SDK_BPVisTownCraftingWood_HPP
#define UE4SS_SDK_BPVisTownCraftingWood_HPP

class ABPVisTownCraftingWood_C : public AVisRefinery
{
    class UVisStaticMeshComponent* VisStaticMesh15;                                   // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh14;                                   // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh16;                                   // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* SharpeningWheelMesh;                               // 0x0580 (size: 0x8)
    class UAudioComponent* RefineSound;                                               // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* WoodPile3Mesh;                                     // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh9;                                    // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* SawbuckMesh;                                       // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* WoodPile2Mesh;                                     // 0x05B8 (size: 0x8)
    class UVisStaticMeshComponent* WoodPile1Mesh;                                     // 0x05C0 (size: 0x8)
    class UNiagaraComponent* Niagara1;                                                // 0x05C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh13;                                   // 0x05D0 (size: 0x8)
    class UVisStaticMeshComponent* FirepirtMesh;                                      // 0x05D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh8;                                    // 0x05E0 (size: 0x8)
    class USceneComponent* ExtraProps;                                                // 0x05E8 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureCollapsedMesh;                        // 0x05F0 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureMesh;                                 // 0x05F8 (size: 0x8)

}; // Size: 0x600

#endif
