#ifndef UE4SS_SDK_BPVisGridFoundationQuarterWallInclineDiagonal_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterWallInclineDiagonal_HPP

class ABPVisGridFoundationQuarterWallInclineDiagonal_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0520 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0538 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0540 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0558 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0560 (size: 0x8)

}; // Size: 0x568

#endif
