#ifndef UE4SS_SDK_BPVisGridFoundationQuarterDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterDiagonal_T2_HPP

class ABPVisGridFoundationQuarterDiagonal_T2_C : public AVisStructure
{
    class UChildActorComponent* ChildActor7;                                          // 0x0518 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor4;                          // 0x0520 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge08;                       // 0x0528 (size: 0x8)
    class UChildActorComponent* ChildActor5;                                          // 0x0530 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge05;                       // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x0540 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VerticalEdge06;                       // 0x0548 (size: 0x8)
    class UChildActorComponent* ChildActor6;                                          // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x0558 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* VisFoundationBottomMeshDecor;       // 0x0560 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0568 (size: 0x8)
    class UChildActorComponent* ChildActor;                                           // 0x0570 (size: 0x8)
    class UChildActorComponent* ChildActor1;                                          // 0x0578 (size: 0x8)
    class UChildActorComponent* ChildActor3;                                          // 0x0580 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0588 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0598 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05A0 (size: 0x8)

}; // Size: 0x5A8

#endif
