#ifndef UE4SS_SDK_BPVisRoofOverhead_HPP
#define UE4SS_SDK_BPVisRoofOverhead_HPP

class ABPVisRoofOverhead_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* BlockInCylinder3_StaticMeshComponent0;                // 0x04B0 (size: 0x8)
    class UStaticMeshComponent* BlockInCylinder2_StaticMeshComponent0;                // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent0;               // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent0;               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent1;               // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent1;               // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge2_StaticMeshComponent0;                   // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square18_StaticMeshComponent0;               // 0x04F0 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04F8 (size: 0x8)

}; // Size: 0x500

#endif
