#ifndef UE4SS_SDK_BPVisFortGateT3_HPP
#define UE4SS_SDK_BPVisFortGateT3_HPP

class ABPVisFortGateT3_C : public AVisGate
{
    class UScorchEffectComponent* ScorchEffect10;                                     // 0x0490 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0498 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x04A0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x04A8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x04B0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x04B8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x04C0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect3;                                      // 0x04C8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x04D0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x04D8 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x04E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x04F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x04F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0500 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0508 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0510 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0518 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0520 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0528 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0530 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0538 (size: 0x8)

}; // Size: 0x540

#endif
