#ifndef UE4SS_SDK_BPVisGridFoundationWallFlatStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationWallFlatStraight_T2_HPP

class ABPVisGridFoundationWallFlatStraight_T2_C : public AVisStructure
{
    class UChildActorComponent* ChildActor1;                                          // 0x0520 (size: 0x8)
    class UChildActorComponent* ChildActor2;                                          // 0x0528 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0530 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0538 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0540 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0548 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0550 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0558 (size: 0x8)

}; // Size: 0x560

#endif
