#ifndef UE4SS_SDK_BPVisFoodTent_HPP
#define UE4SS_SDK_BPVisFoodTent_HPP

class ABPVisFoodTent_C : public AVisStructure
{
    class UStaticMeshComponent* 1UnitSphere_1_SM10;                                   // 0x0518 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM9;                                    // 0x0520 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM8;                                    // 0x0528 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM7;                                    // 0x0530 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM6;                                    // 0x0538 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM5;                                    // 0x0540 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM4;                                    // 0x0548 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM3;                                    // 0x0550 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM2;                                    // 0x0558 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM1;                                    // 0x0560 (size: 0x8)
    class UStaticMeshComponent* 1UnitSphere_1_SM;                                     // 0x0568 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x0570 (size: 0x8)
    class UStaticMeshComponent* SeatOrganic_04;                                       // 0x0578 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x0580 (size: 0x8)
    class UStaticMeshComponent* Barrels04;                                            // 0x0588 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile10;                 // 0x0590 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x0598 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x05A0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x05A8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x05B0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile9;                  // 0x05B8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x05C0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x05C8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Table02;                                              // 0x05D8 (size: 0x8)
    class UNiagaraComponent* WorkshopFire;                                            // 0x05E0 (size: 0x8)
    class UVisStaticMeshComponent* TableCloth1;                                       // 0x05E8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile11;                 // 0x05F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x05F8 (size: 0x8)

}; // Size: 0x600

#endif
