#ifndef UE4SS_SDK_BPVisTownFamilyCenterT2_HPP
#define UE4SS_SDK_BPVisTownFamilyCenterT2_HPP

class ABPVisTownFamilyCenterT2_C : public AVisFamilyCenter
{
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* ResourceStockpileMesh;                             // 0x0590 (size: 0x8)
    class UVisMultiItemStockpileComponent* VisMultiItemStockpile;                     // 0x0598 (size: 0x8)
    class UBoxComponent* VisibilityToggleDebugBox2;                                   // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* RoofMeshCollapsed;                                 // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* RoofMesh;                                          // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* FamilyCenterSecondFloor;                           // 0x05B8 (size: 0x8)
    class UVisFamilyMeshComponent* VisFamilyMesh;                                     // 0x05C0 (size: 0x8)
    class UVisStaticMeshComponent* StairsMesh;                                        // 0x05C8 (size: 0x8)
    class UBoxComponent* VisibilityToggleDebugBox;                                    // 0x05D0 (size: 0x8)
    class UVisStaticMeshComponent* FamilyCenterMesh;                                  // 0x05D8 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x05E0 (size: 0x8)

}; // Size: 0x5E8

#endif
