#ifndef UE4SS_SDK_BPVisGridFoundationWallRoundDiagonal_HPP
#define UE4SS_SDK_BPVisGridFoundationWallRoundDiagonal_HPP

class ABPVisGridFoundationWallRoundDiagonal_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor41;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x0550 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor32;                         // 0x0558 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x0560 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x0568 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0570 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x0578 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x0580 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x0588 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0590 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x0598 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x05A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x05A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x05B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x05B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x05C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x05C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x05D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor39;                         // 0x05D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x05E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x05E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x05F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x05F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor40;                         // 0x0600 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0610 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0618 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0620 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0628 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0630 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0638 (size: 0x8)

}; // Size: 0x640

#endif
