#ifndef UE4SS_SDK_BPVisGridFoundationQuarterDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterDiagonal_T2_HPP

class ABPVisGridFoundationQuarterDiagonal_T2_C : public AVisStructure
{
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x0538 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking2;                                       // 0x0540 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking3;                                       // 0x0548 (size: 0x8)
    class UStaticMeshComponent* FloorPlanking1;                                       // 0x0550 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x0558 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x0560 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x0568 (size: 0x8)
    class UChildActorComponent* ChildActor7;                                          // 0x0570 (size: 0x8)
    class UChildActorComponent* ChildActor5;                                          // 0x0578 (size: 0x8)
    class UChildActorComponent* ChildActor6;                                          // 0x0580 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* VisFoundationBottomMeshDecor;       // 0x0588 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0590 (size: 0x8)
    class UChildActorComponent* ChildActor;                                           // 0x0598 (size: 0x8)
    class UChildActorComponent* ChildActor1;                                          // 0x05A0 (size: 0x8)
    class UChildActorComponent* ChildActor3;                                          // 0x05A8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x05C0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05C8 (size: 0x8)

}; // Size: 0x5D0

#endif
