#ifndef UE4SS_SDK_BPVisColumnsWithRoofCover_HPP
#define UE4SS_SDK_BPVisColumnsWithRoofCover_HPP

class ABPVisColumnsWithRoofCover_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* Block-in_Square11_StaticMeshComponent0;               // 0x0460 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c24_StaticMeshComponent0;                // 0x0468 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square10_StaticMeshComponent0;               // 0x0470 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c22_StaticMeshComponent0;                // 0x0478 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c17_StaticMeshComponent0;                // 0x0480 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c23_StaticMeshComponent0;                // 0x0488 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c20_StaticMeshComponent0;                // 0x0490 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c18_StaticMeshComponent0;                // 0x0498 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c19_StaticMeshComponent0;                // 0x04A0 (size: 0x8)
    class UStaticMeshComponent* RelicColumn02c21_StaticMeshComponent0;                // 0x04A8 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04B0 (size: 0x8)
    class USceneComponent* Root;                                                      // 0x04B8 (size: 0x8)

}; // Size: 0x4C0

#endif
