#ifndef UE4SS_SDK_BPVisRoofOverhead_HPP
#define UE4SS_SDK_BPVisRoofOverhead_HPP

class ABPVisRoofOverhead_C : public AVisEntityPrefab
{
    class UStaticMeshComponent* BlockInCylinder3_StaticMeshComponent0;                // 0x0418 (size: 0x8)
    class UStaticMeshComponent* BlockInCylinder2_StaticMeshComponent0;                // 0x0420 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent0;               // 0x0428 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent0;               // 0x0430 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square20_StaticMeshComponent1;               // 0x0438 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square19_StaticMeshComponent1;               // 0x0440 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge_StaticMeshComponent0;                    // 0x0448 (size: 0x8)
    class UStaticMeshComponent* BlockInWedge2_StaticMeshComponent0;                   // 0x0450 (size: 0x8)
    class UStaticMeshComponent* Block-in_Square18_StaticMeshComponent0;               // 0x0458 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0460 (size: 0x8)

}; // Size: 0x468

#endif
