#ifndef UE4SS_SDK_BPVisFoundationGateBuildSite_HPP
#define UE4SS_SDK_BPVisFoundationGateBuildSite_HPP

class ABPVisFoundationGateBuildSite_C : public AVisBuildSite
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x0468 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x0470 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x0478 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh7;                           // 0x0480 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x0488 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh9;                           // 0x0490 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x0498 (size: 0x8)
    class USkeletalMeshComponent* SkeletalMesh;                                       // 0x04A0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x04A8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* Arch;                                              // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* Arch1;                                             // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x04D8 (size: 0x8)

}; // Size: 0x4E0

#endif
