#ifndef UE4SS_SDK_BPVisTownBlacksmith_HPP
#define UE4SS_SDK_BPVisTownBlacksmith_HPP

class ABPVisTownBlacksmith_C : public AVisStructure
{
    class UVisStaticMeshComponent* RoofMeshCollapsed;                                 // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* StairsMesh1;                                       // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* StairsMesh;                                        // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithBase5;                                   // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithBase4;                                   // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithBase3;                                   // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithBase2;                                   // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithBase1;                                   // 0x0598 (size: 0x8)
    class UBoxComponent* VisibilityToggleDebugBox;                                    // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* RoofMesh;                                          // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* BlacksmithMesh;                                    // 0x05B0 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x05B8 (size: 0x8)

}; // Size: 0x5C0

#endif
