#ifndef UE4SS_SDK_BPVisFoodRefineryT1_HPP
#define UE4SS_SDK_BPVisFoodRefineryT1_HPP

class ABPVisFoodRefineryT1_C : public AVisRefinery
{
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0488 (size: 0x8)
    class UNiagaraComponent* Niagara3;                                                // 0x0490 (size: 0x8)
    class UNiagaraComponent* Niagara2;                                                // 0x0498 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh7;                                    // 0x04A0 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh5;                                    // 0x04B8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh4;                                    // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh3;                                    // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh2;                                    // 0x04D0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04E0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x04E8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x04F0 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect7;                                      // 0x04F8 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect8;                                      // 0x0500 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0508 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0510 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0518 (size: 0x8)

}; // Size: 0x520

#endif
