#ifndef UE4SS_SDK_BPVisPantry_HPP
#define UE4SS_SDK_BPVisPantry_HPP

class ABPVisPantry_C : public AVisStructure
{
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x0520 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x0528 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x0530 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x0538 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x0540 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x0548 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x0550 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x0558 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x0560 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0568 (size: 0x8)

}; // Size: 0x570

#endif
