#ifndef UE4SS_SDK_BPVisFoundationT2_90turn_3x3x9_HPP
#define UE4SS_SDK_BPVisFoundationT2_90turn_3x3x9_HPP

class ABPVisFoundationT2_90turn_3x3x9_C : public AVisStructure
{
    class UVisFoundationDecorMesh* VisFoundationDecorMesh13;                          // 0x0480 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh12;                          // 0x0488 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh11;                          // 0x0490 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh10;                          // 0x0498 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh9;                           // 0x04A0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh8;                           // 0x04A8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh5;                           // 0x04B0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh4;                           // 0x04B8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x04C0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x04C8 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04D0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04D8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04E8 (size: 0x8)

}; // Size: 0x4F0

#endif
