#ifndef UE4SS_SDK_BPVisRavenDen_HPP
#define UE4SS_SDK_BPVisRavenDen_HPP

class ABPVisRavenDen_C : public AVisResource
{
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh13;               // 0x04A0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh12;               // 0x04A8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh11;               // 0x04B0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh10;               // 0x04B8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh9;                // 0x04C0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh8;                // 0x04C8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh7;                // 0x04D0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh6;                // 0x04D8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh5;                // 0x04E0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh4;                // 0x04E8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh3;                // 0x04F0 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh2;                // 0x04F8 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh1;                // 0x0500 (size: 0x8)
    class UVisRandomizedStaticMeshComponent* VisRandomizedStaticMesh;                 // 0x0508 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0510 (size: 0x8)

}; // Size: 0x518

#endif
