#ifndef UE4SS_SDK_BPVisGridFoundationSquareStraight_HPP
#define UE4SS_SDK_BPVisGridFoundationSquareStraight_HPP

class ABPVisGridFoundationSquareStraight_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x04C8 (size: 0x8)
    class UVisRandomDecalDecorComponent* VisRandomDecalDecor;                         // 0x04D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x04D8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x04E0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x04E8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x04F0 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* VisFoundationBottomMeshDecor;       // 0x04F8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0500 (size: 0x8)
    class USceneComponent* Decors;                                                    // 0x0508 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0510 (size: 0x8)

}; // Size: 0x518

#endif
