#ifndef UE4SS_SDK_BPVisTownCraftingStone_HPP
#define UE4SS_SDK_BPVisTownCraftingStone_HPP

class ABPVisTownCraftingStone_C : public AVisRefinery
{
    class UVisStaticMeshComponent* Props8;                                            // 0x0568 (size: 0x8)
    class UVisStaticMeshComponent* Props7;                                            // 0x0570 (size: 0x8)
    class UVisStaticMeshComponent* Props6;                                            // 0x0578 (size: 0x8)
    class UVisStaticMeshComponent* Props5;                                            // 0x0580 (size: 0x8)
    class UVisStaticMeshComponent* Props4;                                            // 0x0588 (size: 0x8)
    class UVisStaticMeshComponent* Props3;                                            // 0x0590 (size: 0x8)
    class UVisStaticMeshComponent* Props2;                                            // 0x0598 (size: 0x8)
    class UVisStaticMeshComponent* Props1;                                            // 0x05A0 (size: 0x8)
    class UVisStaticMeshComponent* Props;                                             // 0x05A8 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureCollapsedMesh;                        // 0x05B0 (size: 0x8)
    class UVisStaticMeshComponent* MainStructureMesh;                                 // 0x05B8 (size: 0x8)

}; // Size: 0x5C0

#endif
