#ifndef UE4SS_SDK_BPVisGridFoundationHalfCrenellationStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationHalfCrenellationStraight_T2_HPP

class ABPVisGridFoundationHalfCrenellationStraight_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x0518 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x0528 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x0538 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0540 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor;       // 0x0548 (size: 0x8)
    class UVisFoundationFillerMeshDecorComponent* VisFoundationFillerMeshDecor1;      // 0x0550 (size: 0x8)

}; // Size: 0x558

#endif
