#ifndef UE4SS_SDK_BPVisHouseT1_HPP
#define UE4SS_SDK_BPVisHouseT1_HPP

class ABPVisHouseT1_C : public AVisStructure
{
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x0520 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh_Roof;                                // 0x0528 (size: 0x8)
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x0530 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x0538 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x0540 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x0548 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x0550 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0558 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0560 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0568 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0570 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0578 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0580 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0588 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0590 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0598 (size: 0x8)
    class USceneComponent* Populated;                                                 // 0x05A0 (size: 0x8)

}; // Size: 0x5A8

#endif
