#ifndef UE4SS_SDK_BPVisHouseT1_HPP
#define UE4SS_SDK_BPVisHouseT1_HPP

class ABPVisHouseT1_C : public AVisStructure
{
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh_Roof;                                // 0x04D0 (size: 0x8)
    class UBPVisFamilyMeshComponent_C* BPVisFamilyMeshComponent;                      // 0x04D8 (size: 0x8)
    class UNiagaraComponent* Niagara;                                                 // 0x04E0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh10;                                   // 0x04E8 (size: 0x8)
    class UVisTeamMeshComponent* VisTeamMesh;                                         // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh6;                                    // 0x04F8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0500 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0508 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect9;                                      // 0x0510 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect6;                                      // 0x0518 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect5;                                      // 0x0520 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect2;                                      // 0x0528 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect1;                                      // 0x0530 (size: 0x8)
    class UScorchEffectComponent* ScorchEffect4;                                      // 0x0538 (size: 0x8)
    class USceneComponent* Fire;                                                      // 0x0540 (size: 0x8)
    class USceneComponent* Populated;                                                 // 0x0548 (size: 0x8)

}; // Size: 0x550

#endif
