#ifndef UE4SS_SDK_BPVisGridFoundationFloorTriangularStraightBuildsite_HPP
#define UE4SS_SDK_BPVisGridFoundationFloorTriangularStraightBuildsite_HPP

class ABPVisGridFoundationFloorTriangularStraightBuildsite_C : public AVisBuildSite
{
    class UStaticMeshComponent* Plane;                                                // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* Plane1;                                               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* PlaneDiagBottom;                                      // 0x04D0 (size: 0x8)
    class UStaticMeshComponent* Plane3;                                               // 0x04D8 (size: 0x8)
    class UStaticMeshComponent* Plane5;                                               // 0x04E0 (size: 0x8)
    class UStaticMeshComponent* PlaneDiagTop;                                         // 0x04E8 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh1;                                    // 0x04F8 (size: 0x8)

}; // Size: 0x500

#endif
