#ifndef UE4SS_SDK_BPVisFoodTable_HPP
#define UE4SS_SDK_BPVisFoodTable_HPP

class ABPVisFoodTable_C : public AVisStructure
{
    class UNiagaraComponent* WorkshopFire;                                            // 0x0480 (size: 0x8)
    class UVisStaticMeshComponent* TableCloth1;                                       // 0x0488 (size: 0x8)
    class UVisStaticMeshComponent* TableCloth;                                        // 0x0490 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile11;                 // 0x0498 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile10;                 // 0x04A0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile9;                  // 0x04A8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile8;                  // 0x04B0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile7;                  // 0x04B8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile6;                  // 0x04C0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile5;                  // 0x04C8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile4;                  // 0x04D0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile3;                  // 0x04D8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile2;                  // 0x04E0 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile1;                  // 0x04E8 (size: 0x8)
    class UVisSingleItemStockpileComponent* VisSingleItemStockpile;                   // 0x04F0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04F8 (size: 0x8)

}; // Size: 0x500

#endif
