#ifndef UE4SS_SDK_BPVisGridFoundationSideRampDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationSideRampDiagonal_T2_HPP

class ABPVisGridFoundationSideRampDiagonal_T2_C : public AVisStructure
{
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference4; // 0x0558 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference3; // 0x0560 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference2; // 0x0568 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference7; // 0x0570 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference5; // 0x0578 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference6; // 0x0580 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference1; // 0x0588 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference; // 0x0590 (size: 0x8)
    class UVisDynamicInstancedMeshGroupComponent* VisDynamicInstancedMeshGroup;       // 0x0598 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor7;          // 0x05A0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor6;          // 0x05A8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor4;          // 0x05B0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor11;         // 0x05B8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor9;          // 0x05C0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor5;          // 0x05C8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor8;          // 0x05D0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor12;         // 0x05D8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor13;         // 0x05E0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor10;         // 0x05E8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor16;         // 0x05F0 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor15;         // 0x05F8 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor14;         // 0x0600 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor70;                         // 0x0608 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor71;                         // 0x0610 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor50;                         // 0x0618 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor53;                         // 0x0620 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor55;                         // 0x0628 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor54;                         // 0x0630 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor67;                         // 0x0638 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor47;                         // 0x0640 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor69;                         // 0x0648 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor56;                         // 0x0650 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor49;                         // 0x0658 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor73;                         // 0x0660 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor57;                         // 0x0668 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor52;                         // 0x0670 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor51;                         // 0x0678 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor72;                         // 0x0680 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor68;                         // 0x0688 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor62;                         // 0x0690 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor63;                         // 0x0698 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor64;                         // 0x06A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor61;                         // 0x06A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor60;                         // 0x06B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor48;                         // 0x06B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor58;                         // 0x06C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor10;                         // 0x06C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor65;                         // 0x06D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor46;                         // 0x06D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor59;                         // 0x06E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x06E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor44;                         // 0x06F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor43;                         // 0x06F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor45;                         // 0x0700 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor41;                         // 0x0708 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor40;                         // 0x0710 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x0718 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* VisFoundationBottomMeshDecor;       // 0x0720 (size: 0x8)
    class UVisFoundationBottomMeshDecorComponent* VisFoundationBottomMeshDecor1;      // 0x0728 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor97;                         // 0x0730 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor98;                         // 0x0738 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor96;                         // 0x0740 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor99;                         // 0x0748 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor100;                        // 0x0750 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor94;                         // 0x0758 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor86;                         // 0x0760 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor75;                         // 0x0768 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor76;                         // 0x0770 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor79;                         // 0x0778 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor77;                         // 0x0780 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor78;                         // 0x0788 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor93;                         // 0x0790 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor109;                        // 0x0798 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor110;                        // 0x07A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor111;                        // 0x07A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor87;                         // 0x07B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor92;                         // 0x07B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor88;                         // 0x07C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor89;                         // 0x07C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor90;                         // 0x07D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor91;                         // 0x07D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor95;                         // 0x07E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor108;                        // 0x07E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor102;                        // 0x07F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor80;                         // 0x07F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor103;                        // 0x0800 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor82;                         // 0x0808 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor83;                         // 0x0810 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor81;                         // 0x0818 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor84;                         // 0x0820 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor85;                         // 0x0828 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor107;                        // 0x0830 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor104;                        // 0x0838 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor101;                        // 0x0840 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor105;                        // 0x0848 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor106;                        // 0x0850 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor74;                         // 0x0858 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x0860 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor36;                         // 0x0868 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x0870 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x0878 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor30;                         // 0x0880 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor38;                         // 0x0888 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor32;                         // 0x0890 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0898 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x08A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor33;                         // 0x08A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x08B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x08B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x08C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x08C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x08D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x08D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x08E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x08E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x08F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x08F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor37;                         // 0x0900 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x0908 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor39;                         // 0x0910 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0918 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor35;                         // 0x0920 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x0928 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0930 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x0938 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x0940 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x0948 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0950 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0958 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0960 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0970 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0978 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0980 (size: 0x8)

}; // Size: 0x988

#endif
