#ifndef UE4SS_SDK_BPVisGridFoundationQuarterWallInclineStraight_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationQuarterWallInclineStraight_T2_HPP

class ABPVisGridFoundationQuarterWallInclineStraight_T2_C : public AVisStructure
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x0518 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x0520 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x0528 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0530 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0538 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x0540 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0548 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x0550 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x0558 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0560 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0568 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0570 (size: 0x8)

}; // Size: 0x578

#endif
