#ifndef UE4SS_SDK_BPVisIndustryFoundation_3x3Point_HPP
#define UE4SS_SDK_BPVisIndustryFoundation_3x3Point_HPP

class ABPVisIndustryFoundation_3x3Point_C : public AVisStructure
{
    class UVisStaticMeshComponent* Pillar05;                                          // 0x0480 (size: 0x8)
    class UVisStaticMeshComponent* Pillar04;                                          // 0x0488 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh3;                           // 0x0490 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh2;                           // 0x0498 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh1;                           // 0x04A0 (size: 0x8)
    class UVisFoundationDecorMesh* VisFoundationDecorMesh;                            // 0x04A8 (size: 0x8)
    class UVisStaticMeshComponent* Pillar03;                                          // 0x04B0 (size: 0x8)
    class UVisStaticMeshComponent* Pillar02;                                          // 0x04B8 (size: 0x8)
    class UMeshVisibilityDataComponent* MeshVisibilityData;                           // 0x04C0 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh_Roof;                                // 0x04C8 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x04D0 (size: 0x8)

}; // Size: 0x4D8

#endif
