#ifndef UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_T2_HPP
#define UE4SS_SDK_BPVisGridFoundationWallFlatDiagonal_T2_HPP

class ABPVisGridFoundationWallFlatDiagonal_T2_C : public AVisStructure
{
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference3; // 0x0560 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference2; // 0x0568 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference1; // 0x0570 (size: 0x8)
    class UVisDynamicMeshTemplateReferenceComponent* VisDynamicMeshTemplateReference; // 0x0578 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0580 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor2;          // 0x0588 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor;           // 0x0590 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor3;          // 0x0598 (size: 0x8)
    class UVisFoundationEdgeMeshDecorComponent* VisFoundationEdgeMeshDecor1;          // 0x05A0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x05A8 (size: 0x8)

}; // Size: 0x5B0

#endif
