#ifndef UE4SS_SDK_BPVisWorldEntranceCave_HPP
#define UE4SS_SDK_BPVisWorldEntranceCave_HPP

class ABPVisWorldEntranceCave_C : public AVisWorldEntrance
{
    class UDecalComponent* Decal;                                                     // 0x0460 (size: 0x8)
    class UDecalComponent* Blood1;                                                    // 0x0468 (size: 0x8)
    class UDecalComponent* Blood;                                                     // 0x0470 (size: 0x8)
    class UDecalComponent* CaveEntrance;                                              // 0x0478 (size: 0x8)
    class UDecalComponent* Animal Bones;                                              // 0x0480 (size: 0x8)
    class UDecalComponent* BaseDecal;                                                 // 0x0488 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0490 (size: 0x8)
    class UVisStaticMeshComponent* VisStaticMesh;                                     // 0x0498 (size: 0x8)

}; // Size: 0x4A0

#endif
