#ifndef UE4SS_SDK_FaceBrickTemplate1200BasetT2Half_HPP
#define UE4SS_SDK_FaceBrickTemplate1200BasetT2Half_HPP

class AFaceBrickTemplate1200BasetT2Half_C : public AActor
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x0290 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x0298 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor29;                         // 0x02A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor31;                         // 0x02A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor28;                         // 0x02B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor34;                         // 0x02B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x02C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x02C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x02D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x02D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x02E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x02E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
