#ifndef UE4SS_SDK_FaceBrickTemplate300_HPP
#define UE4SS_SDK_FaceBrickTemplate300_HPP

class AFaceBrickTemplate300_C : public AActor
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x0290 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x0298 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x02A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x02A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x02B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x02B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x02C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x02C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x02D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x02D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x02E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x02E8 (size: 0x8)

}; // Size: 0x2F0

#endif
