#ifndef UE4SS_SDK_FaceBrickTemplate300T2Short_HPP
#define UE4SS_SDK_FaceBrickTemplate300T2Short_HPP

class AFaceBrickTemplate300T2Short_C : public AActor
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor9;                          // 0x0290 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor8;                          // 0x0298 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor7;                          // 0x02A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor6;                          // 0x02A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor5;                          // 0x02B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor4;                          // 0x02B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor3;                          // 0x02C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor2;                          // 0x02C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor1;                          // 0x02D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor;                           // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
