#ifndef UE4SS_SDK_FaceBrickTemplate450_HPP
#define UE4SS_SDK_FaceBrickTemplate450_HPP

class AFaceBrickTemplate450_C : public AActor
{
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor27;                         // 0x0290 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor26;                         // 0x0298 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor25;                         // 0x02A0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor24;                         // 0x02A8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor23;                         // 0x02B0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor22;                         // 0x02B8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor21;                         // 0x02C0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor20;                         // 0x02C8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor11;                         // 0x02D0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor19;                         // 0x02D8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor18;                         // 0x02E0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor17;                         // 0x02E8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor16;                         // 0x02F0 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor15;                         // 0x02F8 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor12;                         // 0x0300 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor14;                         // 0x0308 (size: 0x8)
    class UVisRandomMeshDecorComponent* VisRandomMeshDecor13;                         // 0x0310 (size: 0x8)

}; // Size: 0x318

#endif
