#ifndef UE4SS_SDK_Palisade01_HPP
#define UE4SS_SDK_Palisade01_HPP

class APalisade01_C : public AAnvilPrefab
{
    class UStaticMeshComponent* TownWell14;                                           // 0x0290 (size: 0x8)
    class UStaticMeshComponent* TownWell11;                                           // 0x0298 (size: 0x8)
    class UStaticMeshComponent* TownWell10;                                           // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* TownWell9;                                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* TownWell8;                                            // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* TownWell7;                                            // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* TownWell6;                                            // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* TownWell5;                                            // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* TownWell4;                                            // 0x02D0 (size: 0x8)
    class USceneComponent* SharedRoot;                                                // 0x02D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
