#ifndef UE4SS_SDK_WoodPathLong01_HPP
#define UE4SS_SDK_WoodPathLong01_HPP

class AWoodPathLong01_C : public AAnvilPrefab
{
    class UBoxComponent* Box;                                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Plank6;                                               // 0x0298 (size: 0x8)
    class UStaticMeshComponent* Plank5;                                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Plank4;                                               // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Plank2;                                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Plank1;                                               // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Plank;                                                // 0x02C0 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
