#ifndef UE4SS_SDK_WoodPlankingLong02_HPP
#define UE4SS_SDK_WoodPlankingLong02_HPP

class AWoodPlankingLong02_C : public AAnvilPrefab
{
    class UBoxComponent* Box;                                                         // 0x0290 (size: 0x8)
    class UStaticMeshComponent* Plank8;                                               // 0x0298 (size: 0x8)
    class UStaticMeshComponent* Plank7;                                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* Plank6;                                               // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Plank5;                                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Plank4;                                               // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* Plank3;                                               // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* Plank2;                                               // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Plank1;                                               // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* Plank;                                                // 0x02D8 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x02E0 (size: 0x8)

}; // Size: 0x2E8

#endif
